{"count":200,"next_page":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles.json?page=3\u0026per_page=30","page":2,"page_count":7,"per_page":30,"previous_page":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles.json?page=1\u0026per_page=30","articles":[{"id":360002343753,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002343753-Release-Notes-1-5.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002343753-Release-Notes-1-5","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000515633,"created_at":"2018-03-24T21:28:04Z","updated_at":"2018-03-24T21:33:44Z","name":"Release Notes 1.5","title":"Release Notes 1.5","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:33:44Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eeBlocker OS 1.5.12\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBug Fixes\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFixed bug that could cause issues, if the gateway had multiple IP addresses on the same network interface.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 20px;\"\u003e\u003cstrong\u003eeBlocker OS 1.5.11\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 20px;\"\u003e\u003cstrong\u003eBug Fixes\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eFixed bug that could prevent eBlocker from working correctly, if its own IP address changed in the local network.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 20px;\"\u003e\u003cstrong\u003eeBlocker OS 1.5.9\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBug Fixes\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eImproves integration of Windows computers by avoiding false IP conflict messages.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eeBlocker OS 1.5\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNew Features\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDNS Server (beta)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTo prevent your provider analyzing your online behavior via Doman Name Service (DNS) requests we’ve added a local eBlocker DNS server with this release. eBlocker can now be used as DNS server to resolve domain-addresses to IP addresses. This helps to further protect your privacy: Instead of sending all DNS requests to only one external DNS server (i.e. your provider’s DNS) – which could profile all websites you were accessing – you can provide a list of DNS servers, and the eBlocker can distribute your requests between all these servers, so that no single server knows all accessed domains – but only a fraction. In addition, you can send your DNS requests through the Tor network (without routing all traffic through Tor) to completely hide the accessed websites from DNS.\u003c/p\u003e\n\u003cp\u003ePlease note that the DNS feature is still in beta and needs to be activated in the settings.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePause Feature and eBlocker Dashboard\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe challenge with the Pause feature was to extend or stop the Pause, once it was activated, because the eBlocker icon and Controlbar would no longer appear on new pages. With this release, eBlocker introduces the new eBlocker Dashboard, which provides permanent access to the Pause controls. The dashboard is automatically opened in a new browser tab, when the Pause feature is activated. Stay tuned for more Dashboard features in upcoming releases.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSSL Help Pages\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe help pages in regards of adding the eBlocker SSL root certificate to the different operating systems (Windows, MacOS, iOS, Android) and other apps has been completely revised and extended.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSystem Events and Log Messages\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSystem events have been extended and log messages have been improved to show relevant and clear information. Also, the eBlocker startup process has been improved to provide better feedback.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBug Fixes\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePlug-and-Play Mode\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe plug-and-play mode has been improved to be more efficient and more stable, especially for large downloads.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUser Provided Names\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSpecial characters in names for devices and profiles will now always be stored and displayed correctly.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGeneral\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSeveral bugs were fixed and improvements implemented to increase performance and stability even further.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePlease note that an update to the current eBlockeOS version 1.5.x may take 10 minutes, or slightly longer.\u003c/em\u003e\u003c/p\u003e"},{"id":360002343733,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002343733-Release-Notes-1-3.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002343733-Release-Notes-1-3","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000515633,"created_at":"2018-03-24T21:27:02Z","updated_at":"2018-03-24T21:27:22Z","name":"Release Notes 1.3","title":"Release Notes 1.3","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:27:02Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNew Features\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eParental Control \u003cem\u003e(Family Edition only)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Parental Control features have been enhanced: It is now possible to define user accounts for all family members and assign a parental control profile as well as devices to this user account. While each device has a main user and profile, it’s possible to allow users to temporarily take ownership of a device by entering their personal PIN.\u003c/p\u003e\n\u003cp\u003eIn addition to defining time ranges, during which Internet access is permitted, it’s now also possible to specify a maximum Internet usage time for a parental control profile.\u003c/p\u003e\n\u003cp\u003eFurthermore, it’s now possible to define individual black and white lists for restricted or explicitly allowed web sites.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVPN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe network wizard for VPN has been improved: It’s now possible to upload additional files like certificates or keys for a VPN configuration.\u003c/p\u003e\n\u003cp\u003eAnd the feedback about the status of the VPN connection during VPN startup has been improved.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTracker Blocking / Ad Blocking\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe domain of the currently visited web site can now separately be whitelisted for ad blocking vs. tracker blocking. So that it’s for example possible to switch off ad blocking – to bypass an add blocker wall on a news webs site – while still being protected against trackers on that same site.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIndividual settings for Tracker Blocking / Ad Blocking \u003cem\u003e(Family Edition only)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the Family Edition, the whitelisted domains for ad blocking and tracker blocking are now stored in the individual user accounts, so that each family member can adjust the settings to their needs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSystem Messages\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe eBlocker notifies the user about important system events in the icon and controlbar. Such system events can for example be: Temporarily interruption of power supply or network connection.\u003c/p\u003e\n\u003cp\u003eStarting with this release, the eBlocker will also inform you about eBlockerOS updates through the icon and controlbar.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBug Fixes\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGeneral\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSeveral additional bugs were fixed and improvements implemented to further increase performance and stability.\u003c/p\u003e"},{"id":360002342454,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002342454-Release-Notes-1-0.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002342454-Release-Notes-1-0","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000515633,"created_at":"2018-03-24T21:26:01Z","updated_at":"2018-03-24T21:26:24Z","name":"Release Notes 1.0","title":"Release Notes 1.0","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:26:01Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNew Features\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eParental Control \u003cem\u003e(Family Edition only)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou can now define a set of Parental Control profiles to control and restrict internet access of certain devices, e.g. your kid’s tablets, laptops or game consoles. Per profile, you can activate predefined website categories (black lists) with (literally) millions of known websites, which provide unsuitable or malicious content. And you can define daily time slots, when internet access should at all be possible.\u003cbr\u003e The Parental Control black lists will be updated automatically on a daily basis (if automatic updates are enabled).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVPN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eeBlocker can now connect your local network with OpenVPN networks to anonymize your outgoing IP address. This is an alternative to \u003cem\u003eTor\u003c/em\u003e. You can even define multiple VPN profiles and use different VPNs for different devices. \u003cbr\u003e We tested the connection to several commercial VPN providers (\u003ca href=\"https://www.eblocker.com/en/vpn_provider\" target=\"_blank\" rel=\"noopener\"\u003ehttps://www.eblocker.com/en/vpn_provider\u003c/a\u003e). \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eTor\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe stability and usability of the \u003cem\u003eTor\u003c/em\u003e function was improved significantly. You can always test the actual \u003cem\u003eTor\u003c/em\u003e status and your current exit node via the eBlocker controlbar.\u003cbr\u003e If \u003cem\u003eTor\u003c/em\u003e should temporarily become unavailable, you will no longer bypass \u003cem\u003eTor\u003c/em\u003e unnoticed.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDevice Management\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe eBlocker itself and the internet/Wifi router are now also shown in the list of all device. They are easily recognizable by their unique icons.\u003cbr\u003e Furthermore, the device list indicates if a device is currently online.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDHCP Server (Manual Network Mode)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThere are several new features, when the eBlocker is operated in manual network mode, e.g., when the eBlocker takes over the role as DHCP server for the local network:\u003cbr\u003e For each device, you can decide if it should receive a fixed IP address.\u003c/p\u003e\n\u003cp\u003eExisting devices will keep the IP address previously assigned by the internet/Wifi router when the eBlocker’s DHCP server is switched on.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSSL\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhen activating the SSL function for the first time, or when renewing the eBlocker’s SSL root certificate, it is now possible to provide a unique name for the certificate. This way, the certificate can easily be recognized and identified.\u003c/p\u003e\n\u003cp\u003eThe SSL exemption list offers now a search field for the domain to make it easier to find domains and maintain the list.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSetup and Support\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the unlikely event that the automatic setup of the eBlocker device does not work and the eBlocker Console is not reachable in the local network, it is now possible to insert an empty USB thumb drive into the eBlocker. When rebooting, the eBlocker will automatically write log and diagnostic messages to this thumb drive to help resolving the issue.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBug Fixes\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWindows 10 / Edge Support\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe eBlocker icon and controlbar are now also available on Windows 10 with the Edge browser. Please note that the advanced pause feature (adding 5 minute intervals and aborting pause) is not yet available with the Edge browser.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndroid Devices\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn some cases, it can happen that Android devices show Wifi reconnection messages, because the eBlocker blocks certain hidden communication to Google or others. This feature was further improved to avoid these reconnection messages.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAd-Blocker\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA bug was fixed that in some cases prevented the update of the ad blocker filter definitions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGeneral\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMore than 20 additional bugs were fixed to further improve performance and stability.\u003c/p\u003e"},{"id":360002343713,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002343713-Release-Notes-0-9-4.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002343713-Release-Notes-0-9-4","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T21:25:09Z","updated_at":"2018-03-24T21:25:28Z","name":"Release Notes 0.9.4","title":"Release Notes 0.9.4","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:25:09Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNew Features\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGeneral\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe performance and stability for encrypted connections (SSL) has been improved. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSSL Exemption Lists\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSSL exemption lists are now part of the daily filter updates. This means we can react much faster to resolve SSL related issues with apps. Additionally, we provide a simpler one-click process to add single domains to the SSL exemption list in case of SSL errors, e.g. to access internal sites with self-signed certificates.\u003c/p\u003e\n\u003cp\u003eThe look \u0026amp; feel of the SSL exemption list form has been optimized, and many new and improved SSL exemption lists for operating systems and popular apps have been added.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePause Feature\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eImproved pause feature: It is now possible to increase the pausing time in 5 minute steps (up to 20 minutes) and to abort the pausing at any time.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTor-Anonymization\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe eBlocker shows now a notification message, before Tor can be activated to make the user aware that Tor anonymization can have an impact on the performance of Internet connections. This notification can be switched off.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Icon\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe eBlocker icon shows an exclamation mark, when new system messages are available.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBug Fixes\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTracking Link Detection\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEndless tracking redirect loops will now be avoided.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDevice Cloaking\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDevice cloaking can now be reset also in German localization.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGeneral UI fixes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eButton to enable SSL functionality is now correctly rendered as active and available.\u003c/p\u003e\n\u003cp\u003eDomains can now be added to SSL exemption list also with Microsoft Internet Explorer.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLicense Management\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUpgrade licenses can now be released from one device and transferred to another device.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDiagnostics Report\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMissing information is again correctly included in diagnostics report.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCore\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSSL routing of disabled devices was sometimes not correctly restored after a reboot. This has been fixed.\u003c/p\u003e\n\u003cp\u003eReboot after system update could fail in rare cases due to inconsistent SSL exemption lists. This has been fixed.  \u003c/p\u003e"},{"id":360002343693,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002343693-Release-Notes-0-9-3.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002343693-Release-Notes-0-9-3","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":-1,"vote_count":1,"section_id":360000523174,"created_at":"2018-03-24T21:24:13Z","updated_at":"2018-11-19T08:42:09Z","name":"Release Notes 0.9.3","title":"Release Notes 0.9.3","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:24:13Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNew Features\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdministrator password\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAccess to the eBlocker settings can now be protected by an optional administrator password. The administrator password can be set under settings/general.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSimplified definition of exception lists \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe definition of exception lists for apps has been simplified, to define exceptions for apps that are not compatible with eBlocker-SSL.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExpert tools (beta)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn addition, we have developed an analysis tool for technical experts, which can be used to easily analyze the communication of apps and create exception rules for apps.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLicense transfer from one device to another\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIt is now possible to transfer an update license from one device to another device. This is particularly interesting for our tech savvy customers who have built their own eBlocker based on the Raspberry / Banana Pi platform and want to transfer their license to a different Pi.\u003c/p\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 20px;\"\u003e\u003cstrong\u003eBug fixes and improvements\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImproved detection of tracking links\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe detection and treatment of tracking links has been greatly improved. So far, it could occur that eBlocker only showed a blank page (1x1-pixel) after detecting a tracking link. Now a dialog is displayed after detecting a tracking link, so the user can be guided a lot better.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImproved user interface in settings\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe user interface in the General, Devices and IP-Anonymization settings has been improved to show the available information more clearly. In addition, the version of the filter list is now also displayed.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBug fixes for stability and performance\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMany bugs have been fixed to improve the stability and performance of eBlockerOS.\u003c/p\u003e"},{"id":360002343673,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002343673-Release-Notes-0-9-2.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002343673-Release-Notes-0-9-2","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T21:23:09Z","updated_at":"2018-03-24T21:23:30Z","name":"Release Notes 0.9.2","title":"Release Notes 0.9.2","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:23:10Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cspan style=\"font-size: 18px;\"\u003e\u003cstrong\u003eNew Features\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdded Apps for improved SSL compatibility \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhen activating eBlocker’s SSL/HTTPS-support most websites work just fine when accessed by a regular browser. Unfortunately a few popular apps (e.g. Facebook, Twitter, etc.) are not compatible with eBlocker’s SSL-support. To support those apps they can be activated for SSL-exemption (whitelisting) under Settings\u0026gt;Apps. Be aware when activating an app in the Apps menu that you are not protected by your eBlocker on the corresponding websites either. We do not recommend the usage of apps as they can put your privacy at risk. To improve your privacy we suggest not to use apps but rather access the corresponding websites by a regular browser which is protected by your eBlocker.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdded multi-language support \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’ve added support for German and English. Now you can switch languages under Settings\u0026gt;System\u0026gt;Timezone and Language.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdded support for time zones\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’ve added support for different time zones. This is important for the update procedure. Now you can set your time zone under Settings\u0026gt;System\u0026gt;Timezone and Language.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdded messages in the Controlbar\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eImportant system messages from your eBlocker are now notified in the Controlbar. The message icon only appears if there are new messages available.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdded detection of routers that require manual network configuration \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eeBlocker is compatible with pretty much all routers in automatic network configuration mode. Currently we are aware of two router models from AVM that are only compatible when eBlocker is set up in manual network configuration mode. To notify users of those routers to change the network mode, we’ve implemented an automatic router detection and messaging to the user.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSupport for Banana PI M2+ board\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Banana PI M2+ which is the main board for the eBlocker series production is now officially supported. You can download the eBlockerOS for this board for free here: \u003ca href=\"http://www.eBlocker.com/download\"\u003ewww.eBlocker.com/download\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 18px;\"\u003e\u003cstrong\u003eBug fixes and improvements\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImproved Tor connection status \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’ve improved the tor connection handling and removed a display bug that showed “not connected” even when Tor was just working fine.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImproved network setup wizard \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe improved network setup wizard guides you through the steps that are necessary to enable manual network configuration mode.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImproved activation wizard \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’ve added several screens to the activation wizard to ease initial eBlocker setup and guide new users through the license activation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImproved SSL documentation \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’ve improved and corrected the documentation for activating SSL-support for most popular browsers. The documentation is now available in German as well.\u003c/p\u003e"},{"id":360002342434,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002342434-Release-Notes-0-9-1.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002342434-Release-Notes-0-9-1","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T21:22:09Z","updated_at":"2018-03-24T21:22:26Z","name":"Release Notes 0.9.1","title":"Release Notes 0.9.1","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:22:09Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003eThis maintenance release mainly includes bug fixes and improvements in the background.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImprovements and Bug Fixes\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUser interface improvements\u003c/li\u003e\n\u003cli\u003eImprovements for recognizing tracking links\u003c/li\u003e\n\u003cli\u003eSeveral bug fixes for SSL/HTTPS support\u003c/li\u003e\n\u003cli\u003eBug fixes in the network configuration: duplicate IP-address assignment, setting the gateway\u003c/li\u003e\n\u003cli\u003eInternet Explorer is fully supported now\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eKnown Issues\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMicrosoft Edge is not showing the eBlocker icon even though the eBlocker is working correctly. Workaround: Please use a different browser to access the eBlocker settings.\u003c/li\u003e\n\u003c/ul\u003e"},{"id":360002343653,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002343653-Release-Notes-0-9.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002343653-Release-Notes-0-9","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T21:21:20Z","updated_at":"2018-03-24T21:21:38Z","name":"Release Notes 0.9","title":"Release Notes 0.9","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:21:20Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNew Features\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSSL-Support\u003c/strong\u003e\u003cbr\u003eNow the beta version of SSL/HTTPS-support can be activated via the settings under „SSL“. Once SSL-support is activated the eBlocker terminates the SSL-connection (instead of the browser) and encrypts the connection to the browser again. Please note that a \u003cstrong\u003esecurity certificate needs to be installed\u003c/strong\u003e once only in your browser in order for SSL to work. The installation is described in the settings and is done with a few clicks that take only seconds. Additionally we recommend to add websites that need end-to-end security (i.e. online banking sites) to the SSL exemption list in the Settings.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePause Feature\u003c/strong\u003e\u003cbr\u003eeBlocker’s activity can now be deactivated for 5 minutes on a particular device in the case that websites are not displayed correctly or links are not directed to the desired page. After 5 minutes eBlocker resumes to normal activity automatically.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLicense Renewal\u003c/strong\u003e\u003cbr\u003eUpdate licenses can now be renewed by entering a valid license key without the need to delete a previously activated license.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBugfixes and Improvements\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndroid WLAN connectivity improved\u003c/strong\u003e\u003cbr\u003eAndroid devices are testing the WLAN Internet connectivity by requesting known tracking services from Google (so called “Google Captive Portal Check”). In the case that the Android device can not connect to the Google service, because the request gets eblocked, the Android device disconnects and reinitiates the WLAN connection.\u003c/p\u003e\n\u003cp\u003eTo avoid this behavior the eBlocker now answers the requests from Android devices instead of Google service so no data is being sent to Google anymore. This default behavior can be deactivated in the Setting under Anonymization.\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTracking Links / 1x1-Pixel and empty pages behavior improved\u003c/strong\u003e\u003cbr\u003eRecognition of tracking links (ie. in newsletters) that profile user activity has been improved so that users are automatically forwarded to the target page without getting tracked. In the case that eBlocker can not determine the target page automatically a dialog is being shown to the user.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMiscellaneous Bugs\u003c/strong\u003e\u003cbr\u003eAdditionally we’ve fixed several bugs in the backend and optimized the pattern matching algorithm for blockinglists.\u003c/p\u003e"},{"id":360002342293,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002342293-Release-Notes-0-8-9-2.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002342293-Release-Notes-0-8-9-2","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T17:54:05Z","updated_at":"2018-03-24T17:54:31Z","name":"Release Notes 0.8.9-2","title":"Release Notes 0.8.9-2","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:54:05Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cspan style=\"font-size: 18px;\"\u003e\u003cspan style=\"font-size: 20px;\"\u003eNew Features\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e*** Attention: Since version 0.8.9-2 we support only hardware with at least 512 MB RAM ***\u003c/p\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 18px;\"\u003e\u003cstrong\u003eAdvanced Anonymization\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eIn the settings we've added a new section \"Anonymization\" where you can access the following new features:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTor exit country selectable\u003c/strong\u003e \u003cbr\u003eNow you can select the Tor exit nodes by country. If more than one country is selected the IP will be randomly changed between the countries.\u003c/p\u003e\n\u003cp\u003eNow, there is \u003cstrong\u003eexperimental support \u003c/strong\u003efor two advanced features:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWebRTC Anti IP-Leak\u003c/strong\u003e\u003cbr\u003eBackground: WebRTC enables real time communication by establishing P2P connections. This is useful for some applications like VoIP calling or chatting. But WebRTC leaks your real IP address to establish these connections (even your local LAN IP) to the peers or webservers. \u003c/p\u003e\n\u003cp\u003eEnabling this option disables the WebRTC protocol to prevent IP leakage.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHTTP Referer Removal\u003c/strong\u003e\u003cbr\u003eBackground: HTTP referer header are send when you browse the web. The referer tells the webserver, which website refered you to the current site. The HTTP referer can be used by the current site to collect data about your browsing habits. Some websites rely on HTTP referers internally. Enabling this option can cause issues with some sites.\u003c/p\u003e\n\u003cp\u003eWebRTC and HTTP Referer blocking are disabled by default.\u003c/p\u003e\n\u003ch3\u003e\u003cspan style=\"font-size: 20px;\"\u003eBugfixes and Improvements\u003c/span\u003e\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eAn issue with blocking list updates was fixed on boards with only 512 MB RAM (Raspberry Pi B+).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cul\u003e\n\u003cli\u003eThe automatic update switch is now showing the correct status.\u003c/li\u003e\n\u003cli\u003eeBlocker now starts even without a DHCP server in the network in automatic mode, so that the emergency IP \u003ca href=\"http://169.254.94.109:3000/\"\u003ehttp://169.254.94.109:3000/\u003c/a\u003e should always be accessible.\u003c/li\u003e\n\u003cli\u003eImproved the caching for faster loading of the eBlocker user interface.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003e\u003cstrong\u003eSecurity updates\u003c/strong\u003e\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eThe glibc6 package was updated due to security vulnerability (CVE-2015-7547).\u003c/li\u003e\n\u003c/ul\u003e"},{"id":360002342273,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002342273-Release-notes-0-8-7.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002342273-Release-notes-0-8-7","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T17:53:18Z","updated_at":"2018-03-24T17:53:18Z","name":"Release notes 0.8.7","title":"Release notes 0.8.7","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:53:18Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003ch3\u003eIP address change\u003c/h3\u003e\n\u003cp\u003eAn issue was fixed: eBlocker will keep working when it has been assigned a new IP address by the router.\u003c/p\u003e\n\u003ch3\u003eStatic MAC address\u003c/h3\u003e\n\u003cp\u003eAn issue was fixed: Banana Pi M2 boards will now keep their MAC address between reboots.\u003c/p\u003e\n\u003ch3\u003eTor control\u003c/h3\u003e\n\u003cp\u003eAnonymization settings are now saved permanently.\u003c/p\u003e\n\u003cp\u003eAnonymization can be enabled per device. It can also be set in the devices screen of the settings.\u003c/p\u003e\n\u003cp\u003eA new Tor identitiy can be requested from the anonymization menu in the controlbar.\u003c/p\u003e\n\u003cp\u003eTor connectivity is checked regularly. If a Tor connection can not be established a warning is shown and routing via Tor is temporarily disabled.\u003c/p\u003e\n\u003ch3\u003eDisable activity icon\u003c/h3\u003e\n\u003cp\u003eThere are settings in the devices screen for the activity icon. The icon on a page can be shown\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ealways\u003c/li\u003e\n\u003cli\u003efor 5 seconds only\u003c/li\u003e\n\u003cli\u003enever\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eDevices\u003c/h3\u003e\n\u003cp\u003eDevices can be deleted in the devices settings.\u003c/p\u003e\n\u003ch3\u003eLogging\u003c/h3\u003e\n\u003cp\u003eURLs are not logged in case of errors.\u003c/p\u003e"},{"id":360002342233,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002342233-Release-notes-0-8-3.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002342233-Release-notes-0-8-3","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T17:52:04Z","updated_at":"2018-03-24T17:52:04Z","name":"Release notes 0.8.3","title":"Release notes 0.8.3","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:52:04Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cdiv class=\"article-separator\"\u003e\n\u003cdiv class=\"article-separator-repeat\"\u003e \u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv class=\"article-content\"\u003e\n\u003ch3\u003eWorkaround for FritzBox 7490 issues\u003c/h3\u003e\n\u003cp\u003eeBlocker now uses IP masquerading in manual network configuration. This ensures that SSL, FTP and other non-HTTP connections are more reliable when eBlocker is connected to a Fritzbox 7490.\u003c/p\u003e\n\u003ch3\u003eNetwork configuration is verified\u003c/h3\u003e\n\u003cp\u003eInput on the network configuration screen is now validated more thorougly.\u003c/p\u003e\n\u003ch3\u003eRegistration can be reset\u003c/h3\u003e\n\u003cp\u003eThe registration can be reset when eBlocker was registered with a wrong license key. Use this feature only if advised by support. This action can not be undone and you can not re-register the previous license key.\u003c/p\u003e\n\u003cp\u003eNote that the following reboot will take up to 5 minutes.\u003c/p\u003e\n\u003ch3\u003eImproved tracker blocking\u003c/h3\u003e\n\u003cp\u003eAn issue was fixed where links from Google were sometimes leading to white pages.\u003c/p\u003e\n\u003ch3\u003eUI improvements\u003c/h3\u003e\n\u003cp\u003eThe controlbar rendering was improved for Microsoft Internet Explorer and Chrome browsers.\u003c/p\u003e\n\u003c/div\u003e"},{"id":360002341154,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002341154-Release-notes-0-8-2.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002341154-Release-notes-0-8-2","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T17:51:27Z","updated_at":"2018-03-24T17:56:05Z","name":"Release notes 0.8.2","title":"Release notes 0.8.2","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:56:05Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003ePlease note: you might need to clear your browser's cache in order to see the changes in the controlbar and settings screens. To clear your browser cache please hold \"shift\" and press the reload button in your browser. \u003c/p\u003e\n\u003ch3\u003eDevice cloaking\u003c/h3\u003e\n\u003cp\u003eEach browser sends a unique identifier (a so called \"user agent\") to a webserver, so the webserver can adjust content for the specific browser and device. This can result in higher prices i.e. if the website uses dynamic pricing engines to increase prices for iPad users for instance. \u003cbr\u003eWith the new release the \"user agent\" can now be changed. Click on the cloaking icon in the controlbar and select a device from the list. Technically advanced users can also define a custom user agent.\u003c/p\u003e\n\u003ch3\u003eList blocked URLs\u003c/h3\u003e\n\u003cp\u003eThe blocked tracking and ad services are now listed under the controlbar icons Trackers and Ads.\u003c/p\u003e\n\u003ch3\u003eUI improvements\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eThe controlbar now has a button for whitelisting the current domain.\u003c/li\u003e\n\u003cli\u003eThe settings screens have been redesigned and cleaned up.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eDevice list\u003c/h3\u003e\n\u003cp\u003eDevices can be individually named in the devices settings screen. This helps to identify particular devices. The device list is now sortable by IP-, MAC-address or name. The current device, i.e. the device you are using to view the settings screen, is highlighted.\u003c/p\u003e\n\u003ch3\u003eBug fixes\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eSome pages did not show the controlbar icon (e.g. imdb.com). This issue is fixed.\u003c/li\u003e\n\u003cli\u003eIn the device settings SNOM and Gigaset devices are turned off by default.\u003c/li\u003e\n\u003c/ul\u003e"},{"id":360002341134,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002341134-Release-notes-0-8-0.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002341134-Release-notes-0-8-0","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T17:50:44Z","updated_at":"2018-03-24T17:50:44Z","name":"Release notes 0.8.0","title":"Release notes 0.8.0","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:50:44Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003eNew features\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe eBlocker can be registered with a valid license key.\u003c/p\u003e\n\u003cp\u003eAfter registration you can update the software in the General screen in settings. Automatic updates once per day are enabled by default.\u003c/p\u003e\n\u003cp\u003eReboot and shutdown buttons were added to the System screen in Settings.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBug fixes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHTTP connections to other devices on the local network are not routed through the eBlocker any more. For example, you should not see an eBlocker icon on the administration interface of your router.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImprovements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLot\"s of smaller improvements in the background to support automatic updates, improved performance, software architectural improvements (refactoring).\u003c/p\u003e"},{"id":360002341114,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002341114-Release-notes-0-7-5.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002341114-Release-notes-0-7-5","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T17:49:45Z","updated_at":"2018-03-24T17:49:45Z","name":"Release notes 0.7.5","title":"Release notes 0.7.5","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:49:45Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cdiv class=\"article-separator\"\u003e\n\u003cdiv class=\"article-separator-repeat\"\u003e \u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv class=\"article-content\"\u003e\n\u003cp\u003e\u003cstrong\u003eNew features\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSupport for Tor has been added. Note that due to missing SSL support, only unencrypted HTTP traffic can be routed via Tor.\u003c/p\u003e\n\u003cp\u003eFor diagnosing routing problems, a packet logging feature has been added. Packet logging can be enabled in the System settings screen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBug fixes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eeBlocker does not send ICMP redirect packets any more. These redirects could possibly confuse clients by telling them to send outgoing packets directly to the router instead of the eBlocker.\u003c/p\u003e\n\u003cp\u003eWhen enabling the manual network configuration, eBlocker's built-in DHCP server is now started reliably after the next boot.\u003c/p\u003e\n\u003c/div\u003e"},{"id":360002341034,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002341034-How-to-integrate-my-own-DNS-server-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002341034-How-to-integrate-my-own-DNS-server-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":-1,"vote_count":1,"section_id":360000515273,"created_at":"2018-03-24T17:25:41Z","updated_at":"2019-01-21T13:51:52Z","name":"How to integrate my own DNS server?","title":"How to integrate my own DNS server?","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-08-29T10:30:51Z","user_segment_id":null,"permission_group_id":744634,"label_names":["server","dns","own","eigener","eigenen"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eWith the eBlockers DNS function you not only have the possibility to integrate external DNS servers, you can also integrate your own Do It Yourself (DIY) DNS server.\u003c/p\u003e\nIf you already run a DIY DNS server, you should first make sure that it is stored in your router as the DNS server. Now activate the DNS function in your eBlocker under Settings \u0026gt; DNS Firewall. Select the \"Internet Provider\" option. \u003c/div\u003e\n\u003c/div\u003e"},{"id":360002342093,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002342093-Where-can-I-find-more-public-DNS-server-on-the-Internet-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002342093-Where-can-I-find-more-public-DNS-server-on-the-Internet-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":1,"vote_count":3,"section_id":360000515273,"created_at":"2018-03-24T17:24:50Z","updated_at":"2019-01-21T13:53:21Z","name":"Where can I find more public DNS server on the Internet?","title":"Where can I find more public DNS server on the Internet?","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-06-21T09:00:50Z","user_segment_id":null,"permission_group_id":744634,"label_names":["server","dns","public","öffentliche"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eWe've listed a small number of DNS servers for you \u003ca href=\"https://www.eblocker.com/en/dns-server-list/\" target=\"_blank\" rel=\"noopener\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eMore publicly available DNS servers can be found on the internet. Search for \"public DNS servers\" or \"Censorship free DNS servers\".\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e"},{"id":360002340994,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002340994-Admin-locked-out-from-Parental-Control-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002340994-Admin-locked-out-from-Parental-Control-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":1,"vote_count":1,"section_id":360000522794,"created_at":"2018-03-24T17:21:00Z","updated_at":"2018-11-08T22:19:23Z","name":"Admin locked out from Parental Control.","title":"Admin locked out from Parental Control.","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:21:00Z","user_segment_id":null,"permission_group_id":744634,"label_names":["parental","control","jugendschutz","locked","out","ausgesperrt"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eYou have added all devices to a Parental Control profile and thus have no longer access to the eBlocker settings. \u003c/p\u003e\n\u003cp\u003eTo open the eBlocker settings you can either enter the eBlockers IP address (IP address:3000 - Example: \u003ca href=\"http://192.168.1.26:3000\"\u003ehttp://192.168.1.26:3000\u003c/a\u003e), or the eBlocker emergency IP Address(\u003ca href=\"http://169.254.94.109:3000\"\u003ehttp://169.254.94.109:3000\u003c/a\u003e) in your browser.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cspan class=\"modalTitle\"\u003e \u003c/span\u003e\u003c/p\u003e"},{"id":360002340954,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002340954-Delays-and-video-streams-stop-loading-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002340954-Delays-and-video-streams-stop-loading-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":2,"section_id":360000515233,"created_at":"2018-03-24T17:17:06Z","updated_at":"2018-12-23T19:55:12Z","name":"Delays and video streams stop loading.","title":"Delays and video streams stop loading.","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:17:06Z","user_segment_id":null,"permission_group_id":744634,"label_names":["slow","langsam","tor","stream","stop","loading","wartezeit","video","music","abbrechen"],"body":"\u003cp\u003eVerify if you have enabled the eBlocker's Tor-network (Anon function). If you have activated the Tor-network, please deactivate it.\u003c/p\u003e\n\u003cp\u003eThe Tor-network does not guarantee fixed bandwidths of its Exit Nodes. Therefore, it may take a long time before a website is fully loaded, or video streams may stop loading.\u003c/p\u003e"},{"id":360002341973,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002341973-The-real-IP-address-is-displayed-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002341973-The-real-IP-address-is-displayed-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":2,"vote_count":2,"section_id":360000515233,"created_at":"2018-03-24T17:15:43Z","updated_at":"2019-04-11T14:46:28Z","name":"The real IP address is displayed.","title":"The real IP address is displayed.","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2019-04-11T14:46:28Z","user_segment_id":null,"permission_group_id":744634,"label_names":["ip","address","real","reale","addresse","displayed","angezeigt","tor"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eIf an IP address will not be anonymized by the eBlocker, this may have several reasons.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eThe eBlocker is not activated for the device.\u003c/li\u003e\n\u003cli\u003eThe eBlocker is enabled for the device, but the eBlocker HTTPS function was not enabled for the device and (or) the eBlocker certificate was not properly stored on the device.\u003c/li\u003e\n\u003cli\u003eYou were using neither the Tor network nor a VPN server connection. The IP address cannot be anonymized.\u003c/li\u003e\n\u003cli\u003eParts of the website may come from the browser cache.\u003c/li\u003e\n\u003cli\u003eYou are using a browser extension which could reveal the true IP address (for example FLASH).\u003c/li\u003e\n\u003cli\u003eYou may have activated the IPv6 protocol for your internal network (home network), which is not yet compatible with the eBlocker.\u003c/li\u003e\n\u003c/ol\u003e\n\u003c/div\u003e\n\u003c/div\u003e"},{"id":360002341953,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002341953-Many-CAPTCHAs-are-displayed.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002341953-Many-CAPTCHAs-are-displayed","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":1,"vote_count":1,"section_id":360000515233,"created_at":"2018-03-24T17:14:24Z","updated_at":"2019-04-27T08:36:17Z","name":"Many CAPTCHAs are displayed","title":"Many CAPTCHAs are displayed","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:14:24Z","user_segment_id":null,"permission_group_id":744634,"label_names":["captcha","tor"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eSome websites figure out that the call comes from the Tor network and want to verify that the call came from a person and is not an automated attack, for added security. For this purpose, a CAPTCHA is displayed. This is a function of the web page that you’ve accessed and cannot be influenced by the eBlocker.\u003c/p\u003e\n\u003cp\u003eSince the release of eBlockerOS 1.11, this phenomenon may occur more often because with Tor network activated, the complete data communication is run via Tor. In particular the websites that are loaded via HTTPS. In previous versions of eBlockerOS, HTTPS requests were routed over Tor only if the SSL feature was enabled for that device.\u003c/p\u003e\n\u003cp\u003ePlease note that CAPTCHAs are often used on websites where you have to register with a personal account anyway. Therefore, the provider of the website can assign all your inquiries to this account anyway - even if no personal information is known about you. Neither the Tor network nor the eBlocker can prevent this. However, the eBlocker prevents in any case that unnoticed requests are transmitted to other third parties, especially data collectors (trackers) are transmitted - even if Tor is not used. Using the Tor network does not necessarily guarantee greater anonymity in such cases.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e"},{"id":360002340294,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360002340294-No-eBlocker-Dashboard.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360002340294-No-eBlocker-Dashboard","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":-20,"vote_count":36,"section_id":360000522734,"created_at":"2018-03-24T15:31:56Z","updated_at":"2019-06-25T14:39:26Z","name":"No eBlocker Dashboard","title":"No eBlocker Dashboard","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-08-29T09:48:43Z","user_segment_id":null,"permission_group_id":744634,"label_names":["icon"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eWhen you open setup.eblocker.com, or eblocker.box, in yur browser you should see the eBlocker Dashboard.\u003c/p\u003e\n\u003cp\u003eIf you see a website without an eBlocker icon instead, check the following first:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIs the power supply properly assembled?\u003c/li\u003e\n\u003cli\u003eIs the network cable plugged into the eBlocker LAN port correctly?\u003c/li\u003e\n\u003cli\u003eIs the network cable plugged into the router correctly?\u003c/li\u003e\n\u003cli\u003eIf everything is connected correctly , the two LEDs on the eBlocker backside should light up / flash after a few seconds.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf the two LEDs on the eBlocker LAN port are blinking, please open the settings of your router. In the network settings you should see the eBlocker as a new device. Your router has given the eBlocker an IP address. Note down this IP address.\u003c/p\u003e\n\u003cp\u003eOpen a new browser Tab, enter the noted IP address and insert :3000 at the end of the IP address (example: 192.168.0.26:3000). Now you should see the eBlocker settings.\u003c/p\u003e\n\u003cp\u003eIf you do not see the eBlocker settings, try the eBlocker emergency IP address. 169.254.94.109:3000\u003c/p\u003e\n\u003cp\u003eIn the eBlocker settings you can find the menu item \"Devices\". Here you will find all devices found by the eBlocker in your network. Your device with which you are currently in the eBlocker settings will be listed in as the first device in the list. Click on the IP address of your device and check in the settings if the eBlocker is activated for this device.\u003c/p\u003e\n\u003cp\u003eTip: Bookmark your eBlocker Dashboard so that you always have quick access to the Dashboard.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e"},{"id":360024737733,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360024737733-What-kind-of-list-formats-are-supported-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360024737733-What-kind-of-list-formats-are-supported-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":1,"vote_count":1,"section_id":360004584253,"created_at":"2019-06-13T04:44:18Z","updated_at":"2019-06-13T10:35:32Z","name":"What kind of list formats are supported?","title":"What kind of list formats are supported?","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2019-06-13T04:44:18Z","user_segment_id":null,"permission_group_id":744634,"label_names":["blocker format formats"],"body":"\u003cp\u003eThe eBlocker allows you to upload four different list formats:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\"Domain List\"\u003c/strong\u003e \u003cbr\u003eDomain lists are lists which contain normal domains.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eExample\u003c/strong\u003e: \u003cbr\u003edomain.com\u003cbr\u003edomain.ru\u003cbr\u003ebad.domain2.org\u003cbr\u003everybad.domain2.pw\u003cbr\u003every.bad123.domain3.net\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003e\"squid-acl list\"\u003c/strong\u003e \u003cbr\u003eSquid-acl lists are comparable to domain list lists.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eExample\u003c/strong\u003e:\u003cbr\u003edomain.com\u003cbr\u003edomain.ru\u003cbr\u003ebad.domain2.org\u003cbr\u003everybad.domain2.pw\u003cbr\u003every.bad123.domain3.net\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003e\"etc.hosts list\"\u003c/strong\u003e \u003cbr\u003eEtc.host lists are lists which for example have an IP address in front of the domain. These are usually the IP address of the local host (127.0.0.1), or the IP address 0.0.0.0.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eExample\u003c/strong\u003e: \u003cbr\u003e127.0.0.1 domain.com\u003cbr\u003e127.0.0.1 domain.ru\u003cbr\u003e127.0.0.1 bad.domain2.org\u003cbr\u003e127.0.0.1 verybad.domain2.pw\u003cbr\u003e127.0.0.1 very.bad123.domain3.net\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003e\"easylist\"\u003c/strong\u003e \u003cbr\u003eEasylist are lists in the format of known browser extensions such as AdBlock.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eExample\u003c/strong\u003e: \u003cbr\u003e/adzone_\u003cbr\u003e/theadzone/*\u003cbr\u003e###adsontheright\u003cbr\u003e-advertise.$domain=~i-domain.net|~bad-domain.gr\u003cbr\u003e||domain.net^$third-part\u003cbr\u003e@@/ad_file/*$image,domain=domain.de|domains.de\u003cbr\u003ebaddomain.com###IMU_468x60\u003c/pre\u003e\n\u003cp\u003eFor the \u003cstrong\u003edomain\u003c/strong\u003e, \u003cstrong\u003esquid-acl\u003c/strong\u003e and \u003cstrong\u003eect.hosts\u003c/strong\u003e list, the # character indicates a comment which will not be imported by the eBlocker.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eExample\u003c/strong\u003e:\u003cbr\u003e# This hosts file is brought to you by XXXXXXX\u003cbr\u003e# You are free to copy and distribute this file for non-commercial uses.\u003cbr\u003e# Last updated: Mon, 28 May 2019 at 06:53:40 GMT\u003c/pre\u003e\n\u003cp\u003e \u003c/p\u003e"},{"id":360024168334,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360024168334-Which-scenarios-are-conceivable-at-the-end-of-the-procedure-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360024168334-Which-scenarios-are-conceivable-at-the-end-of-the-procedure-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":4,"vote_count":4,"section_id":360004512333,"created_at":"2019-06-05T08:46:01Z","updated_at":"2019-06-23T10:14:16Z","name":"Which scenarios are conceivable at the end of the procedure?","title":"Which scenarios are conceivable at the end of the procedure?","source_locale":"de","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2019-06-06T16:44:39Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp class=\"western\" style=\"margin-bottom: 0cm;\"\u003eThree scenarios are possible:\u003c/p\u003e\n\u003cp class=\"western\" style=\"margin-bottom: 0cm;\"\u003e1. A financial investor is found for the continuation of the company.\u003c/p\u003e\n\u003cp class=\"western\" style=\"margin-bottom: 0cm;\"\u003e2. The company is sold as a whole or in parts to another company and the technologies are further developed and operated by the buyer.\u003c/p\u003e\n\u003cp class=\"western\" style=\"margin-bottom: 0cm;\"\u003e3. The company is liquidated in order to serve the creditors with outstanding claims against the\u003c/p\u003e\n\u003cp class=\"western\" style=\"margin-bottom: 0cm;\"\u003ecompany.\u003c/p\u003e"},{"id":360017299313,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360017299313-Devices.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360017299313-Devices","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":0,"vote_count":0,"section_id":360003201954,"created_at":"2019-02-06T08:16:34Z","updated_at":"2019-06-05T07:30:23Z","name":"Devices","title":"Devices","source_locale":"de","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2019-06-05T07:30:23Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cspan class=\"wysiwyg-color-green120\"\u003eeBlocker Base ✓\u003c/span\u003e / \u003cspan class=\"wysiwyg-color-green120\"\u003eeBlocker Pro ✓\u003c/span\u003e / \u003cspan class=\"wysiwyg-color-green120\"\u003eeBlocker Family ✓\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThis page is divided into the following sections:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevice list\u003c/li\u003e\n\u003cli\u003eDevice discovery\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024774894/geraete-00-en.png\" alt=\"geraete-00-en.png\"\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eDevice list\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cspan lang=\"EN-US\"\u003eThe \u003cstrong\u003eDevices\u003c/strong\u003e function shows a list of all network devices that are identified by your eBlocker in your home network. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan lang=\"EN-US\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360037903273/23-01en-Devices.png\" alt=\"23-01en-Devices.png\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe devices are initially identified by their IP address and - as far as the eBlocker can determine - by the manufacturer. By clicking on the IP address, you open further details about the device and can adjust the settings.\u003c/p\u003e\n\u003cp\u003eYou can easily disable or enable the eBlocker in the overview for all devices except your router and your eBlocker by moving the switch in front of the IP address.\u003c/p\u003e\n\u003cp\u003eSymbols at the IP address:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOrange computer = eBlocker is enabled for this device.\u003c/li\u003e\n\u003cli\u003eGray computer = eBlocker is deactivated for this device.\u003c/li\u003e\n\u003cli\u003eRouter = Your gateway / router\u003c/li\u003e\n\u003cli\u003eeBlocker Logo = Your eBlocker\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSymbols at the Status:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStar = the device you are currently accessing the eBlocker settings with.\u003c/li\u003e\n\u003cli\u003eNetwork icon Orange = the device is online.\u003c/li\u003e\n\u003cli\u003eNetwork icon Grey = the device is offline.\u003c/li\u003e\n\u003cli\u003eLock icon Orange = HTTPS is activated\u003c/li\u003e\n\u003cli\u003eLock icon grey = HTTPS is deactivated\u003c/li\u003e\n\u003cli\u003eSmartphone icon Orange = Device is connected via eBLocker Mobile\u003c/li\u003e\n\u003cli\u003eSmartphone icon grey = Device is not connected via eBlocker Mobile\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eA click on the \u003cstrong\u003eRefresh\u003c/strong\u003e button reloads the device list.\u003c/p\u003e\n\u003cp\u003eWith a click on the \u003cstrong\u003eEdit\u003c/strong\u003e button you can select single or multiple devices from the device list and then delete them from the device list.\u003c/p\u003e\n\u003cp\u003eIf you click on an entry in the device list, the device details for this device will be displayed.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDevice details\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe recommend assigning a device name to all devices so that you can easily recognize them at any time (e. g. \"Christian's laptop\", \"Living room TV\" or \"Sabine's smartphone\").\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793153/geraete-en-02.png\" alt=\"geraete-en-02.png\"\u003e\u003c/p\u003e\n\u003cp\u003eThe IP address, the hardware address (MAC) and, if available, the manufacturer per device are also displayed here.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eActivate eBlocker\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBy default, the eBlocker is automatically activated for most devices. Only some device types (e. g. some IP phones and Hi-Fi components) are deactivated in the default setting. Devices for which the eBlocker is activated are displayed with an orange icon.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793173/geraete-en-03.png\" alt=\"geraete-en-03.png\"\u003e\u003c/p\u003e\n\u003cp\u003eYou can define at any time for each device individually whether it should be monitored by the eBlocker or not and whether the eBlocker for this device is in the pause. If the eBlocker has been activated for the device, additional functions are available below.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReset device\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHere you can reset a device to the basic device setting of the eBlocker.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793193/geraete-en-04.png\" alt=\"geraete-en-04.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional function - User\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eeBlocker Family customers can determine whether the device should be assigned to a certain user.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872394/geraete-en-05.png\" alt=\"geraete-en-05.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional function - Anonymization\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHere you can activate IP anonymization and determine whether you want to use a Tor or VPN connection.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793213/geraete-en-06.png\" alt=\"geraete-en-06.png\"\u003e\u003c/p\u003e\n\u003cp\u003eIn addition, you can determine the cloaking for a device here. This function is only available for eBlocker Pro and Family customers, because you have to activate the HTTPS function of the eBlocker for the device cloaking. Open the selection and select one of the predefined cloaks (\"User Agents\") or enter your own User Agent.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional function - Mobile\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHere you can - if the eBlocker Mobile feature has been activated - activate access to your eBlocker for this device from outside your network.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872414/geraete-en-07.png\" alt=\"geraete-en-07.png\"\u003e\u003c/p\u003e\n\u003cp\u003eYou can determine whether this device is only activated for Internet access then, or whether eBlocker can also be configured from the device from outside your network.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional function - Blocker\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHere you can decide whether the eBlocker should not block trackers and ads, whether the eBlocker should use its \u003cstrong\u003eDomain Blocker\u003c/strong\u003e, or whether the eBlocker should use its \u003cstrong\u003ePattern Blocker\u003c/strong\u003e. The \u003cstrong\u003ePattern Blocker\u003c/strong\u003e setting preempts the activation of the HTTPS function.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872434/geraete-en-08.png\" alt=\"geraete-en-08.png\"\u003e\u003c/p\u003e\n\u003cp\u003eIf you set the setting to Automatic, the eBlocker will use the HTTPS function (enabled or disabled) to decide for you whether to use the domain or pattern blocker. The setting \u003cstrong\u003eAutomatic\u003c/strong\u003e is our recommendation.\u003c/p\u003e\n\u003cp\u003eYou can also activate the Malware \u0026amp; Phishing protection of your eBlocker here.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional function - HTTPS\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf the HTTPS function on the eBlocker have been activated in general, you can instruct the eBlocker to monitor encrypted connections (HTTPS) for each device individually.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793233/geraete-en-09.png\" alt=\"geraete-en-09.png\"\u003e\u003c/p\u003e\n\u003cp\u003eYou can also activate the HTTPS error recording for each device to find the server connection suppressed by the eBlocker more quickly later in case of connection problems with apps, for example.\u003c/p\u003e\n\u003cp\u003eImportant: eBlocker Base customers will only be able to see the eBlocker icon on HTTP pages.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional function - Controlbar\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHere you can specify whether the eBlocker icon should always, never or only briefly be displayed for five seconds on the device when you access a new web page.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872454/geraete-en-10.png\" alt=\"geraete-en-10.png\"\u003e\u003c/p\u003e\n\u003cp\u003eAdditionally, there is the option to show the eBlocker icon only in standard browsers like Microsoft Edge, Firefox, Chrome, or Safari. This also includes browsers based on Chrome or Firefox. For example, the eBlocker icon will not appear in apps.\u003c/p\u003e\n\u003cp\u003eHere you can also set the position of the eBlocker icon.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional function - Notifications\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHere you can determine for each device whether all, the most important or no system messages from the eBlocker should be displayed.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793253/geraete-en-11.png\" alt=\"geraete-en-11.png\"\u003e\u003c/p\u003e\n\u003cp\u003eAs a default setting for all devices, all system messages from the eBlocker are displayed.\u003c/p\u003e\n\u003cp\u003eYou can also define individually for each device which confirmation and information dialogs should be displayed.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eDevice Discovery\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eAutomatic device discovery\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe eBlocker detects new devices in your local network automatically after a short time and displays them on the \u003cstrong\u003eDevices\u003c/strong\u003e page.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793293/geraete-en-12.png\" alt=\"geraete-en-12.png\"\u003e\u003c/p\u003e\n\u003cp\u003eHere you can specify whether the eBlocker should now search for new devices \u003cstrong\u003eevery 10 seconds\u003c/strong\u003e, \u003cstrong\u003eevery 5 minutes\u003c/strong\u003e, \u003cstrong\u003eonce per hour\u003c/strong\u003e, or \u003cstrong\u003enever\u003c/strong\u003e. If you select the \u003cstrong\u003eNever\u003c/strong\u003e option, please note that you must always manually search for new devices.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eManual device discovery\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith a click on the \u003cstrong\u003eDiscover new devices\u003c/strong\u003e button, you can manually discover new devices at any time.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793273/geraete-en-13.png\" alt=\"geraete-en-13.png\"\u003e\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e"},{"id":360013510133,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360013510133--Release-Notes-2-2.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360013510133--Release-Notes-2-2","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":51,"vote_count":67,"section_id":360001752594,"created_at":"2018-12-10T16:05:11Z","updated_at":"2019-06-04T14:11:32Z","name":" Release Notes 2.2","title":" Release Notes 2.2","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2019-05-02T10:55:55Z","user_segment_id":null,"permission_group_id":744634,"label_names":["eBlockerOS","eOS","2.2"],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan class=\"wysiwyg-font-size-large\"\u003eeBlockerOS 2.2.20\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBugfixes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn rare cases it could occur that the eBlocker would not be fully operational, after the WiFi router has been changed. The eBlocker could then only be restarted by executing a factory reset. This problem has been fixed: Even after changing the WiFi router, the eBlocker will in all cases be fully operational.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e \u003cstrong\u003e\u003cspan class=\"wysiwyg-font-size-large\"\u003eeBlockerOS 2.2.19\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBugfixes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eElimination of bugs related to the start and stop of VPN connections. These bugs had however no direct impact on the functioning of the VPN connection.\u003c/p\u003e\n\u003cp\u003eThe connection test for a VPN cannot be executed anymore, while there is an active connection into this VPN. Reason is that the test could impact the active connection.\u003c/p\u003e\n\u003cp\u003eUnneeded error messages in the context of blocked requests (e.g. trackers or ads), which have been accessed via HTTPS, will now be avoided.\u003c/p\u003e\n\u003cp\u003eIn very rare cases, the network confguration could temporarily be inaccurate after a reboot. This error has been fixed.\u003c/p\u003e\n\u003cp\u003eElimination of a problem with the daily update process: In rare cases, the update process could trigger a problem that could then only be fixed by rebooting the eBlocker.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan class=\"wysiwyg-font-size-large\"\u003eeBlockerOS 2.2.17\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBugfixes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn rare cases, the eBlocker could lose the connection to an external time server, when the network mode was switched from automatic to individual settings. Because of this, the internal clock of the eBlocker might increasingly lost time, which could then have caused subsequent errors. This bug has been fixed.\u003c/p\u003e\n\u003cp\u003eIn same cases, when using Tor via eBlocker Mobile, only HTTP traffic was routed through the Tor network.\u003cbr\u003eThis bug has been fixed: Even when using eBlocker Mobile, the complete traffic will\u003cbr\u003ebe routed through the Tor network, if Tor is activated for a device.\u003c/p\u003e\n\u003cp\u003eWhen using Tor, DNS requests would not have been routed through the Tor network, if the eBlocker DNS firewall was switched off. This bug has been fixed: If Tor is activated for a device, all DNS requests of that device will be routed through Tor, even if the DNS firewall is switched off.\u003c/p\u003e\n\u003cp\u003eIn same cases, devices connected via eBlocker Mobile could not resolve the URL \"eBlocker.box\". A reboot was necessary to make this URL available. This bug has been fixed: After activation of eBlocker Mobile, the URL \"eBlocker.box\" is now immediately available also for all mobile devices.\u003c/p\u003e\n\u003cp\u003eWhen updating a very old eBlocker OS version directly to the latest version eOS 2.2, the new, active monitoring of VPN connection would not work due to a missing software package. This problem has been fixed and\u003cbr\u003ethe missing package is now always installed.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImprovements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe setup wizard for eBlocker Mobile contains now clear instructions to configure the port forwarding for UDP.\u003c/p\u003e\n\u003cp\u003eAn important log file has been added to the diagnosis report.\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan class=\"wysiwyg-font-size-large\"\u003eeBlockerOS 2.2.15\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImportant Bugfix\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA bug in the logging system of the eBlocker could in rare cases damage the eBlocker's directory structure, caused by an unclean shutdown. If that happend, the eBlocker would not be able to start again. This bug has been fixed and cannot occur anymore. However, we strongly recommend to always use eBlocker settings to initiate a clean shutdown of the eBlocker and never just remove the power supply.\u003c/p\u003e\n\u003cp\u003eA repair script has been prepaired for affected customers that can be requested from eBlocker support at any time (support@eBlocker.com).\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e \u003cstrong\u003e\u003cspan class=\"wysiwyg-font-size-large\"\u003eeBlockerOS 2.2.14\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNew Features and Improvements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Mobile\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA new assistant (wizard) helps with the setup of OpenVPN on different mobile devices.\u003c/p\u003e\n\u003cp\u003eIt is now possible to define for each mobile device, if it may access other devices in the local network, while connected via eBlocker Mobile.\u003c/p\u003e\n\u003cp\u003eThe devices overview indicates now, if a device is connected via eBlocker Mobile or not, or if it may connect at all.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVPN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA new option allows an active monitoring of the VPN connection with automatic reconnection. For some VPN providers, active monitoring is necessary to gain an enduring, stable connection.\u003c/p\u003e\n\u003cp\u003eThe VPN setup form prevents the browser now from auto-filling the password field.\u003c/p\u003e\n\u003cp\u003eIn case there are connection failures while setting up or activating a VPN connection, these errors will now be shown with additional context information.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHTTPS Support\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA new assistant (wizard) helps with the installation of the eBlocker certificate into Windows, macOS, iOS and Android and into different browser environments.\u003c/p\u003e\n\u003cp\u003eThe file name of the downloaded eBlocker certificate is now more descriptive and allows to easily recognize and retrieve the file.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eParental Controls\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe blacklist for “illegal filesharing sites” has been extracted from the general list “inappropriate content” and is now available as independent black list.\u003c/p\u003e\n\u003cp\u003eIf the Parental Controls access time restrictions cut the internet access for a device, any running streams (e.g. movies) will also be interrupted promptly, latest as soon as the the already buffered content has been played.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNetwork Settings\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn expert mode, the administrator can now select the default DHCP lease time.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTracker and Ad Blocker\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe blocker page for blocked domains provides now the option to temporarily pause the eBlocker, so that it is possible to reach the original target site if necessary. Keep in mind that it might take a few minutes, until the pausing has an effect, due to local DNS caches of the browser or the operating system.\u003c/p\u003e\n\u003cp\u003eThe blocker page has been completely refurbished and became a whole new layout.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Settings\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe rendering of tables on very small screens (smartphones) has been improved.\u003c/p\u003e\n\u003cp\u003eDevices that are currently online can no longer be \"deleted\" – they would anyway reappear in the list after a short time. Resetting to default settings, however, is still possible for all devices at any time via the details view.\u003c/p\u003e\n\u003cp\u003eThe eBlocker settings now always show clearly, while a process is still running in the background and the user has to wait a moment before the next setting can be made.\u003c/p\u003e\n\u003cp\u003eThe navigation menu has been improved and optimized for mobile devices.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Dashboard\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf the dashboard is not being used or is running in a hidden tab, it will automatically be switched off after a while and restart automatically, when it is brought forward or reused. (The previously displayed dialog box is not shown anymore.)\u003c/p\u003e\n\u003cp\u003eThe pause time can now be set to a maximum of 10 hours.\u003c/p\u003e\n\u003cp\u003eImproved drag \u0026amp; drop of dashboard cards. Especially attaching a card to a short column is now more reliable.\u003c/p\u003e\n\u003cp\u003eThe navigation menu has been improved and optimized for mobile devices. In particular, you can quickly switch to the eBlocker settings at any time by clicking on the gearwheel icon in the upper right corner.\u003c/p\u003e\n\u003cp\u003eThe tooltips are now easier to read due to a larger font and a stronger contrast.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOther improvements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInternal network and protocol libraries have been updated for further performance and stability improvements.\u003c/p\u003e\n\u003cp\u003eThe eBlocker settings are now available on port 80 shortly after the restart, not only on port 3000. Until now, port 80 was only available after start-up was complete.\u003c/p\u003e\n\u003cp\u003eThe domain www.eblocker.box is now also redirected to the dashboard (not only eblocker.box).\u003c/p\u003e\n\u003cp\u003eIn rare cases, unplanned disconnection of power from the eBlocker may damage single files. The self-repair mechanisms have been improved to make this even less likely. However, we still strongly recommend that you shut down the eBlocker in an ordered manner using the settings before disconnecting the power supply!\u003c/p\u003e\n\u003cp\u003eOptimization of the loading time of the eBlocker applications (Settings, Dashboard, ControlBar etc.) as well as optimization of the data transfer when using pattern blockers and extended blockers.\u003c/p\u003e\n\u003cp\u003eExtension of the Diagnostic Report with important status information, as well as removal of unnecessary or misleading messages from the log files. In addition, the maximum size of all log files is limited to prevent memory overflow.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBug fixes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA problem in network expert mode was fixed: This problem could have cause problems with the DHCP server if the netmask of the local network changed.\u003c/p\u003e\n\u003cp\u003eA problem in network expert mode was fixed: The DNS Firewall configuration was not always displayed consistently and seemed to change itself in certain configurations.\u003c/p\u003e\n\u003cp\u003eA problem with manually created, trusted HTTPS Web sites has been fixed: In some cases, these entries could not be deleted again.\u003c/p\u003e\n\u003cp\u003eA problem with the DNS Firewall has been fixed: Some routers publish the invalid address \"0.0.0.0\" as a secondary DNS server. This address is now ignored.\u003c/p\u003e\n\u003cp\u003eA problem related to devices with invalid subnet addresses has been fixed: When such a device is rediscovered, it is now ignored and no longer displayed. Devices already in the list remain in the list.\u003c/p\u003e\n\u003cp\u003eA problem related to dynamic IP addresses in the local network has been fixed: In rare cases, an error occurred when the eBlocker received a new IP Address from the DHCP Server that was previously assigned to another device.\u003c/p\u003e\n\u003cp\u003eA problem with reloading the eBlocker settings immediately after a reboot was fixed: Sometimes it was necessary to reload the page to display the settings correctly.\u003c/p\u003e\n\u003cp\u003eA problem with eBlocker Mobile on AMD platforms has been fixed.\u003c/p\u003e\n\u003cp\u003eA problem with eBlocker Mobile on Raspberry Pi B3+ platforms has been fixed.\u003c/p\u003e\n\u003cp\u003eA display problem related to parental controls profiles has been fixed.\u003c/p\u003e\n\u003cp\u003eMinor inconsistencies in the user interface have been fixed.\u003c/p\u003e\n\u003cp\u003eA rare problem when starting the eBlocker has been fixed.\u003c/p\u003e\n\u003cp\u003eA rare problem with the creation of the diagnostic report has been fixed.\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e"},{"id":360008637593,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360008637593-What-is-fragFINN-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360008637593-What-is-fragFINN-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":0,"vote_count":0,"section_id":360000522794,"created_at":"2018-08-28T13:53:46Z","updated_at":"2018-08-29T10:07:08Z","name":"What is fragFINN?","title":"What is fragFINN?","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-08-29T10:07:02Z","user_segment_id":null,"permission_group_id":744634,"label_names":["fragfinn","frag","finn"],"body":"\u003cp\u003eStarting with eBlockerOS version 2, we have added some extra protection for your children with an extended protection list from fragFINN. fragFINN is an German Internet search engine for children whose results have been specially selected for the young Internet users.\u003c/p\u003e\n\u003cp\u003eFor e.g., when you create a new Parental Control profile, you can now restrict access restrictions as followed:\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360011357094/fragFINN-EN01.png\" alt=\"fragFINN-EN01.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSelect the main policy \"Following categories are allowed, everything else is restricted\".\u003c/li\u003e\n\u003cli\u003eSelect fragFINN and save the setting.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cbr\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360011357074/fragFINN-EN02.png\" alt=\"fragFINN-EN02.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003eAdditionally we have added a fragFINN search field to the eBlocker message.\u003cbr\u003eIf you have set your eBlocker interface to English, you will see the search engine DuckDuckGo here.\u003c/p\u003e"},{"id":360008030973,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360008030973-Where-can-I-download-a-compatible-OpenVPN-app-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360008030973-Where-can-I-download-a-compatible-OpenVPN-app-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":4,"vote_count":4,"section_id":360000522814,"created_at":"2018-08-13T09:05:19Z","updated_at":"2019-01-01T09:33:47Z","name":"Where can I download a compatible OpenVPN app?","title":"Where can I download a compatible OpenVPN app?","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-08-13T09:05:19Z","user_segment_id":null,"permission_group_id":744634,"label_names":["windows","mac","macos","app","vpn","android","iphone","ipad"],"body":"\u003cp\u003eTo benefit from all eBlocker features on the road, simply connect to your own eBlocker at home. You need one of the following free apps for your operating system to open a VPN tunnel to your home network.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpenVPN App für macOS\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTunnelblick (Open Source GNU General Public License) - \u003ca href=\"https://tunnelblick.net/downloads.html\" target=\"_blank\" rel=\"noopener\"\u003eDownload here...\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpenVPN Connect für iOS iPhone\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDownload on the App Store - \u003ca href=\"https://itunes.apple.com/de/app/openvpn-connect/id590379981?mt=8\" target=\"_blank\" rel=\"noopener\"\u003eDownload here...\u003c/a\u003e \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpenVPN Connect für iOS iPad\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDownload on the App Store - \u003ca href=\"https://itunes.apple.com/us/developer/openvpn-technologies/id590379984?mt=8\" target=\"_blank\" rel=\"noopener\"\u003eDownload here...\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpenVPN App für Android\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOpenVPN Connect on Google Play - \u003ca href=\"https://play.google.com/store/apps/details?id=net.openvpn.openvpn\" target=\"_blank\" rel=\"noopener\"\u003eDownload here...\u003c/a\u003e \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpenVPN App für Windows\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOpenVPN Connect (OpenVPN Technologies) - \u003ca href=\"https://openvpn.net/index.php/open-source/downloads.html\" target=\"_blank\" rel=\"noopener\"\u003eDownload here...\u003c/a\u003e \u003c/p\u003e"},{"id":360006811553,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360006811553-Why-do-I-not-receive-any-updates-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360006811553-Why-do-I-not-receive-any-updates-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":1,"vote_count":3,"section_id":360000522734,"created_at":"2018-07-10T08:23:35Z","updated_at":"2019-06-07T19:42:47Z","name":"Why do I not receive any updates?","title":"Why do I not receive any updates?","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-08-29T09:53:48Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003eThe eBlocker Pro and eBlocker Family receive filter list updates automatically - daily from Monday to Friday. There are no updates on weekends and holidays.\u003c/p\u003e\n\u003cp\u003eThe eBlocker Base operating system update will be performed automatically as soon as a new update is available.\u003c/p\u003e\n\u003cp\u003eIn the eBlocker Settings \u0026gt; Menu \"General\" you can see which eBlocker filter list version is installed in the tab \"Update\". Here you can also determine when your eBlocker should check for updates or whether you prefer to perform them manually.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360011473913/01-EN.png\" alt=\"01-EN.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWe recommend that you perform the automatic update at night.\u003c/p\u003e\n\u003cp\u003eIf you are an eBlocker Pro or eBlocker Family customer and do not receive any updates for a few days, first check whether you may have set the update mode to \"manual\". If this is not the case, please create a diagnostic report from your eBlocker and send it to our support team with a short description of your problem: support@eblocker.com\u003c/p\u003e\n\u003cp\u003eYou can create the diagnostic report for your eBlocker in the eBlocker Settings \u0026gt; System \u0026gt; Diagnostics tab. The creation of the report takes about 30 seconds and is then saved as a TGZ file using the free compression program \"gzip\"*.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e* gzip is standard in the UNIX world today because it offers a good compression level and high compression speed.\u003c/em\u003e\u003c/p\u003e"},{"id":360005410573,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360005410573-The-eBlocker-Support-Forum-.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360005410573-The-eBlocker-Support-Forum-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":true,"position":1,"vote_sum":6,"vote_count":12,"section_id":360000516793,"created_at":"2018-06-05T13:16:13Z","updated_at":"2019-04-13T06:03:34Z","name":"The eBlocker Support Forum ","title":"The eBlocker Support Forum ","source_locale":"en-us","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2018-06-19T09:57:22Z","user_segment_id":null,"permission_group_id":744634,"label_names":["#forum","#community","#support"],"body":"\u003cp\u003e\u003cstrong\u003eWelcome to the eBlocker support forum.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe support forum offers a German and an English user interface. At the top and bottom of the page you can easily select the preferred language.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360007623534/en-oben.png\" alt=\"en-oben.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006828273/01EN.png\" alt=\"01EN.png\"\u003e\u003c/p\u003e\n\u003cp\u003eThe support forum offers you the possibility to browse the FAQs and the knowledge base.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006769994/02EN.png\" alt=\"02EN.png\"\u003e\u003c/p\u003e\n\u003cp\u003eYou can search the complete support forum – that includes the FAQs, the knowledge base and the community area - for answers.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006770034/03EN.png\" alt=\"03EN.png\"\u003e\u003c/p\u003e\n\u003cp\u003eRegistered users can communicate with other eBlocker users in the community area. All questions or suggestions submitted to the community will also be read and answered by our support team.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006828213/04EN.png\" alt=\"04EN.png\"\u003e\u003c/p\u003e\n\u003cp\u003eIf you are looking for direct contact to our support team, you can submit your questions here without registration. Of course you can also contact our support team via the e-mail address support@eblocker.com.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006770054/05EN.png\" alt=\"05EN.png\"\u003e\u003c/p\u003e\n\u003cp\u003eBefore you contact our support team directly, please read the article \"\u003ca href=\"https://support.eblocker.com/hc/en-us/articles/360004587533-Contact-eBlocker-Support\" target=\"_blank\" rel=\"noopener\"\u003eContact eBlocker Support\u003c/a\u003e\" in the knowledge base.\u003c/p\u003e\n\u003cp\u003eWe ask you to comply with the following rules and guidelines, when posting a new post to our community or when replying to a post.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIf you have any criticism, please make sure that you publish it in a constructive way.\u003c/li\u003e\n\u003cli\u003ePlease write in a way that respects other users.\u003c/li\u003e\n\u003cli\u003eDo not flame or insult other users in the community.\u003c/li\u003e\n\u003cli\u003ePlease use an appropriate and descriptive subject for your posting.\u003c/li\u003e\n\u003cli\u003eDo not publish any personal data.\u003c/li\u003e\n\u003cli\u003eDo not post any spam, offensive content or links to phishing sites in the community area.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease note that our moderators reserve the right to edit or delete any post at any time. We also reserve the right to block users who violate the forum rules.\u003c/p\u003e\n\u003cp\u003eThank you for your understanding.\u003c/p\u003e"},{"id":360004553814,"url":"https://eblocker.zendesk.com/api/v2/help_center/en-us/articles/360004553814-The-eBlocker-HTTPS-Function.json","html_url":"https://support.eblocker.com/hc/en-us/articles/360004553814-The-eBlocker-HTTPS-Function","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":3,"vote_count":5,"section_id":360000516773,"created_at":"2018-05-20T16:59:55Z","updated_at":"2019-02-22T16:32:01Z","name":"The eBlocker HTTPS Function","title":"The eBlocker HTTPS Function","source_locale":"de","locale":"en-us","outdated":false,"outdated_locales":[],"edited_at":"2019-02-06T20:39:44Z","user_segment_id":null,"permission_group_id":744634,"label_names":["ssl","https","certificate","Zertifikat"],"body":"\u003cp\u003eAfter first connection the eBlocker shows its eBlocker icon only on HTTP pages. To be able to see the eBlocker symbol on HTTPS pages, you must activate the SSL function in the eBlocker and then store the eBlocker HTTPS certificate in the desired device.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImportant\u003c/strong\u003e: The HTTPS function is only available for the eBlocker Pro and eBlocker Family.\u003c/p\u003e\n\u003cp\u003eFor devices where the eBlocker certificate cannot be stored, you should not activate the HTTPS function of eBlocker.\u003c/p\u003e\n\u003cp\u003eThe eBlocker HTTPS function can be found in the eBlocker \u003cstrong\u003eSettings\u003c/strong\u003e \u0026gt; \u003cstrong\u003eHTTPS\u003c/strong\u003e menu.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024817794/HTTPS-WD-EN-01.png\" alt=\"HTTPS-WD-EN-01.png\"\u003e\u003c/p\u003e\n\u003cp\u003eIf you activate the eBlocker HTTPS function for the first time, we recommend to renew the eBlocker certificate. Click on the \u003cstrong\u003eCERTIFICATE\u003c/strong\u003e tab in the HTTPS menu and then on the \u003cstrong\u003eRenew now\u003c/strong\u003e button at the bottom.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024817814/HTTPS-WD-DE-02.png\" alt=\"HTTPS-WD-DE-02.png\"\u003e\u003c/p\u003e\n\u003cp\u003eFollow the wizard and you have created a new eBlocker certificate, which is valid from the time of creation.\u003c/p\u003e\n\u003cp\u003eNow you can store the eBlocker certificate. We recommend to store the eBlocker certificate in the operating system first. Most browsers, or other programs, use the certificates from the certificate store of your operating system. Some few programs that use their own certificate store on all operating systems are the browser Firefox, Cliqz, Seamonkey, or the e-mail program Thunderbird.\u003c/p\u003e\n\u003cp\u003eHere you can find a list of our Certificate FAQ articles for the operating systems:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://support.eblocker.com/hc/en-us/articles/360011665393\" target=\"_blank\" rel=\"noopener\"\u003eStoring the eBlocker certificate\u003c/a\u003e \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy is the eBlocker certificate so important?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThink of the eBlocker certificate as a key. As soon as you activate the SSL function of the eBlocker, the eBlocker opens the encrypted HTTPS / SSL data packages. The eBlocker removes data collectors and data collecting advertisements and encrypts the now unencrypted data package a second time. Your browser, or app, expects an encrypted data package. In order for your browser, or the app, to open the data packages encrypted by eBlocker again, you need the appropriate key (the eBlocker certificate).\u003c/p\u003e\n\u003cp\u003ePlease also visit our \u003ca href=\"https://support.eblocker.com/hc/en-us/categories/360000227134-FAQs\" target=\"_blank\" rel=\"noopener\"\u003eFAQ's\u003c/a\u003e.\u003c/p\u003e"}],"sort_by":"position","sort_order":"asc"}