{"count":195,"next_page":"https://eblocker.zendesk.com/api/v2/help_center/de/articles.json?page=3\u0026per_page=30","page":2,"page_count":7,"per_page":30,"previous_page":"https://eblocker.zendesk.com/api/v2/help_center/de/articles.json?page=1\u0026per_page=30","articles":[{"id":360002343753,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002343753-Release-Notes-1-5.json","html_url":"https://support.eblocker.com/hc/de/articles/360002343753-Release-Notes-1-5","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000515633,"created_at":"2018-03-24T21:28:04Z","updated_at":"2018-03-24T21:33:44Z","name":"Release Notes 1.5","title":"Release Notes 1.5","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:28:21Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eeBlocker OS 1.5.12\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBeseitigte Fehler\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEs wurde Fehler behoben, der Probleme verursachen könnte, wenn das Gateway mehrere IP-Adressen auf derselben Netzwerkschnittstelle hatte.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 20px;\"\u003e\u003cstrong\u003eeBlocker OS 1.5.11\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBeseitigte Fehler\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEs wurde Fehler behoben, der verhindern könnte, dass eBlocker ordnungsgemäß funktioniert, wenn sich seine eigene IP-Adresse im lokalen Netzwerk geändert hat.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 20px;\"\u003e\u003cstrong\u003eeBlocker OS 1.5.9\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 20px;\"\u003e\u003cstrong\u003eBeseitigte Fehler\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eVerbesserte Integration von Windows-Systemen durch Vermeidung von fälschlichen Meldungen zu IP-Adresskonflikten.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eeBlocker OS 1.5\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNeue Funktionen\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDNS-Server (Beta)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUm zu verhindern, dass Ihr Provider Ihr Online-Verhalten über DNS-Anfragen (Domain Name Service) analysiert, haben wir mit diesem Release einen lokalen eBlocker-DNS-Server hinzugefügt.\u003c/p\u003e\n\u003cp\u003eDer eBlocker kann jetzt als DNS-Server verwendet werden, um Domain-Adressen in IP-Adressen aufzulösen. Dadurch können Sie Ihre Privatsphäre noch umfassender schützen: Anstatt alle DNS-Anfragen an einen einzigen, externen DNS-Server zu schicken (z.B. an den DNS-Server Ihres Providers), der ein Persönlichkeitsprofil über alle aufgerufenen Websites erstellt, können Sie eine Liste von beliebig vielen externen DNS-Servern angeben. Der eBlocker kann dann die Anfragen über alle diese externen Server verteilen, so dass kein einzelner externer Server über alle Informationen zu den besuchten Websites verfügt, sondern nur über einen Bruchteil. Zusätzlich können Sie die DNS-Anfragen auch über das Tor-Netzwerk versenden (ohne den gesamten Verkehr durch Tor zu schicken), so dass Ihre originäre IP-Adresse bei den DNS Servern nicht bekannt wird.\u003c/p\u003e\n\u003cp\u003eBitte beachten Sie, dass die DNS-Funktion noch in der Beta ist und in den Einstellungen aktiviert werden muss.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePause-Funktion und eBlocker Dashboard\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Herausforderung bei der Pause-Funktion war, die Pause zu verlängern oder abzubrechen, wenn sie einmal aktiviert ist. Das eBlocker-Symbol und die Controlbar erscheinen bei aktivierter Pause auf neu geladenen Seiten natürlich nicht. Mit dem neuen Release stellen wir Ihnen das eBlocker Dashboard vor, über das sie jederzeit Zugriff auf die Pause-Funktionen haben. Das Dashboard öffnet sich beim Aktivieren der Pause automatisch in einem eigenen Browser-Tab. Seien Sie gespannt auf weitere Dashboard-Funktionen in zukünftigen Releases.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSSL-Hilfeseiten\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Hilfeseiten rund um das Hinzufügen des eBlocker SSL Root-Zertifikats zu den verschiedenen Betriebssystemen (Windows, MacOS, iOS, Android) und zu anderen Apps wurden komplett überarbeitet und ergänzt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSystem-Ereignisse und Log-Meldungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWeitere wichtige Systemereignisse wurden hinzugefügt und die Log-Meldungen wurden verbessert, um relevante und verständliche Informationen anzuzeigen. Außerdem wurde der eBlocker-Startprozess verbessert, um bessere Rückmeldung zum aktuellen Status zu geben.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBeseitigte Fehler und weitere Verbesserungen\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePlug-und-Play-Modus\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDer Plug-und-Play-Modus wurde weiter verbessert, und ist jetzt noch effizienter und stabiler. Insbesondere lange Downloads können jetzt störungsfrei durchgeführt werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenutzerdefinierte Namen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSonderzeichen in einigen benutzerdefinierten Namen (z.B. für Geräte und Profile) werden jetzt korrekt gespeichert und dargestellt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAllgemein\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMehrere Fehler wurden behoben und Verbesserungen wurden umgesetzt, um die Stabilität und Performanz der eBlockers weiter zu erhöhen.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBitte beachten Sie, dass ein Update auf die aktuelle eBlocker Version 1.5.x gegebenenfalls 10 Minuten, oder etwas länger, dauern kann.\u003c/em\u003e\u003c/p\u003e"},{"id":360002343733,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002343733-Release-Notes-1-3.json","html_url":"https://support.eblocker.com/hc/de/articles/360002343733-Release-Notes-1-3","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000515633,"created_at":"2018-03-24T21:27:02Z","updated_at":"2018-03-24T21:27:22Z","name":"Release Notes 1.3","title":"Release Notes 1.3","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:27:22Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNeue Funktionen\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJugendschutz \u003cem\u003e(Nur Family Edition)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Jugendschutz-Funktionen wurden erweitert: Es ist jetzt möglich individuelle Benutzerkonten für alle Familienmitglieder anzulegen. Jedem Benutzer können dann ein Jugendschutz-Profil sowie die jeweils verwendeten Geräte zugeordnet werden. Während jedes Gerät einen Hauptnutzer hat, kann man Benutzern erlauben auch andere Geräte durch Eingabe eines Benutzer-PINs vorübergehend in Besitz zu nehmen.\u003c/p\u003e\n\u003cp\u003eZusätzlich zur Einrichtung von Zeiträumen, in denen der Internet-Zugriff gestattet ist, können jetzt für jedes Jugendschutz-Profil maximale Nutzungszeiten pro Tag festgelegt werden.\u003c/p\u003e\n\u003cp\u003eDarüber hinaus ist es jetzt möglich, selbst eigene Listen von verboten oder ausdrücklich erlaubten Websites anzulegen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVPN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDer Netzwerk Assistent für VPN-Zugänge wurde verbessert: Es ist jetzt möglich zusätzliche Dateien zu einer Konfiguration hochzuladen, zum Beispiel für Zertifikate oder Schlüssel.\u003c/p\u003e\n\u003cp\u003eDie Rückmeldung über den Status der VPN-Verbindung während der Startphase wurde verbessert.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTracker-Blocking / AdBlocking\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFür die gerade besuchte Website kann jetzt separat das Ad-Blocking bzw. das Tracker-Blocking ausgeschaltet werden (Whitelisting). Dadurch ist es zum Beispiel möglich, nur das Ad-Blocking abzuschalten – um eine Ad-Blocker-Schranke auf einer Nachrichtenseite zu umgehen – während Sie auf der gleichen Seite weiterhin vor Trackern geschützt sind.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIndividuelle Einstellungen für Tracker-Blocking / Ad-Blocking \u003cem\u003e(Nur Family Edition)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn der Family Edition werden die Einstellungen zu freigeschalteten Domains bei Ad-Blocking/Tracker-Blocking (Whitelisting) nun an den individuellen Benutzerkonten gespeichert. So dass jedes Familienmitglied die Einstellungen an die eigenen Bedürfnisse anpassen kann.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSystemmeldungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDer eBlocker benachrichtigt den Benutzer nun über das Vorliegen von wichtigen Systemmeldungen über das Icon und die ControlBar. Dazu gehört u.a. der zeitweilige Verlust der Stromversorgung oder der Netzwerkverbindung.\u003c/p\u003e\n\u003cp\u003eAb diesem Release informiert der eBlocker über das Icon und die ControlBar außerdem über eBlockerOS-Aktualisierungen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBeseitigte Fehler und Verbesserungen\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAllgemein\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eViele weitere Fehler wurden behoben und Verbesserungen wurden umgesetzt, um die Stabilität und Performanz weiter zu erhöhen.\u003c/p\u003e"},{"id":360002342454,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002342454-Release-Notes-1-0.json","html_url":"https://support.eblocker.com/hc/de/articles/360002342454-Release-Notes-1-0","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000515633,"created_at":"2018-03-24T21:26:01Z","updated_at":"2018-03-24T21:26:24Z","name":"Release Notes 1.0","title":"Release Notes 1.0","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:26:24Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNeue Funktionen\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJugendschutz \u003c/strong\u003e\u003cstrong\u003e\u003cem\u003e(Nur Family Edition)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSie können nun einen Satz von Jugendschutz-Profilen festlegen, um damit die Internet-Nutzung durch einzelne Geräten zu überwachen und zu beschränken. Z.B. die Tablets, Laptops oder Spielekonsolen ihrer Kinder. Sie können für jedes Profil den Zugriff auf unangemessene Inhalte verbieten und dazu aus einer vordefinierten Liste von Website-Kategorien (Sperrlisten) auswählen. Darüber hinaus können Sie für jeden Wochentag Zeiten festlegen, zu denen die Internet-Nutzung gestattet ist. Die Jugendschutz-Sperrlisten werden täglich automatisch aktualisiert, falls automatische Updates aktiviert sind.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVPN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDer eBlocker kann jetzt Ihr lokale Heimnetz mit OpenVPN-Netzwerken verbinden, um Ihre ausgehende IP-Adresse zu anonymisieren. Dies ist eine Alternative zum \u003cem\u003eTor\u003c/em\u003e-Netzwerk. Sie können mehrere unterschiedliche VPN-Profile festlegen und sogar einzelne Endgeräte mit unterschiedlichen VPNs verbinden. Wir haben bereits die Kompatibilität zu einigen kommerziellen VPN-Anbietern getestet (\u003ca href=\"https://www.eblocker.com/de/vpn_provider\"\u003ehttps://www.eblocker.com/de/vpn_provider\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eTor\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSie Stabilität und Benutzbarkeit der \u003cem\u003eTor\u003c/em\u003e-Funktion wurde deutlich verbessert. Sie können den Status des \u003cem\u003eTor\u003c/em\u003e-Netzwerks sowie Ihren aktuellen Ausgangsknoten jederzeit leicht über die Controlbar testen. Falls \u003cem\u003eTor\u003c/em\u003e zeitweilig nicht verfügbar sein sollte, können Sie nicht mehr unbemerkt an \u003cem\u003eTor\u003c/em\u003e vorbei ins Internet gelangen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGeräteverwaltung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDer eBlocker sowie Ihr Internet/WLAN-Router sind nun ebenfalls in der Liste aller Geräte sichtbar. Sie können leicht über spezielle Symbole erkannt werden. Darüber hinaus wird jetzt angezeigt, ob ein Gerät online ist.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDHCP Server (Manueller Netzwerk-Modus)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWenn der eBlocker im manuellen Netzwerk-Modus betrieben wird, also, wenn der eBlocker die Rolle des DHCP-Servers im Heimnetz übernimmt, stehen einige neue Funktionen zur Verfügung:\u003c/p\u003e\n\u003cp\u003eSie können für jedes Gerät festlegen, ob es eine feste oder eine dynamische IP-Adresse bekommen soll. Und vorhandene Geräte behalten bei der Umstellung auf den manuellen Netzwerk-Modus die IP-Adresse, die sie ursprünglich vom Internet/WLAN-Router erhalten hatten.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSSL\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWenn die SSL-Unterstützung zum ersten Mal aktiviert wird, oder wenn das eBlocker SSL Root-Zertifikat erneuert wird, kann man jetzt einen eindeutigen Namen für das Zertifikat vergeben. So kann das eBlocker-Zertifikat jederzeit leicht erkannt und identifiziert werden.\u003c/p\u003e\n\u003cp\u003eDie SSL-Ausnahmeliste bietet jetzt eine Suchfunktion, so dass es leichter ist einen bestimmten Eintrag in der Liste zu finden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInbetriebnahme und Support\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIm unwahrscheinlichen Fall, dass die automatische Inbetriebnahme des eBlocker nicht funktioniert und der eBlocker im lokalen Netzwerk nicht erreichbar ist, kann man jetzt einen leeren USB-Stick in den eBlocker einstecken. Beim nächsten Neustart wird der eBlocker dann automatisch einige Status- und Diagnosemeldungen auf den USB-Stick schreiben. Diese Meldungen können dann helfen das Problem zu lösen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBeseitigte Fehler und Verbesserungen\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUnterstützung von Windows 10 mit dem Edge-Browser\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDas eBlocker-Symbol und die Controlbar sind nun auch bei Verwendung von Windows 10 mit dem Edge-Browser verfügbar. Bitte beachten Sie, dass die erweitere Pause-Funktion (Verlängern der Pause um 5 Minuten und Abbruch der Pause) mit dem Edge-Browser derzeit noch nicht zur Verfügung stehen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndroid-Geräte\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn manchen Fällen kann es vorkommen, dass Android-Geräte unerwartet eine Aufforderung zur Neuverbindung ins WLAN anzeigen. Die Ursache dafür ist, dass der eBlocker versteckte Kommunikation des Geräts zu Google oder anderen unterbindet. Diese Funktion wurde weiter verbessert, um entsprechende Meldungen zu vermeiden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWerbeblocker\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEs wurde ein Problem behoben, das in manchen Fällen die Aktualisierung der Werbe-Sperrliste verhindert hat.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAllgemein\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMehr als 20 weitere Fehler wurden behoben, um die Stabilität und Performanz weiter zu verbessern.\u003c/p\u003e"},{"id":360002343713,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002343713-Release-Notes-0-9-4.json","html_url":"https://support.eblocker.com/hc/de/articles/360002343713-Release-Notes-0-9-4","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T21:25:09Z","updated_at":"2018-03-24T21:25:28Z","name":"Release Notes 0.9.4","title":"Release Notes 0.9.4","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:25:28Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNeue Funktionen\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAllgemein\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEine verbesserte Performance und Stabilität bei verschlüsselten Verbindungen (SSL).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAusnahmelisten für SSL\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Ausnahmelisten für SSL sind jetzt Teil der täglichen Filterlisten-Aktualisierung. D.h. wir können jetzt viel schneller reagieren und Probleme in Verbindung mit SSL-Abfragen von Apps beheben. Zusätzlich haben wir einen einfachen „nur-ein-Klick“-Ablauf, um eine URL im Falle von SSL-Fehlern der Ausnahmeliste hinzuzufügen (beispielsweise für interne Server mit selbstsigniertem Zertifikat).\u003c/p\u003e\n\u003cp\u003eDie Benutzerschnittstelle zur Bearbeitung der SSL Ausnahmeliste wurde optimiert. Außerdem wurden viele Ausnahmelisten für Betriebssysteme und populäre Apps hinzugefügt und vorhandene Ausnahmelisten verbessert.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePause-Funktionalität\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eVerbesserte Pause-Funktionalität: Es ist jetzt möglich, die Pause in Schritten von 5 Minuten auf bis zu 20 Minuten zu verlängern. Darüber hinaus ist es möglich, die Pause jederzeit zu beenden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTor-Anonymisierungsfunktion\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDer eBlocker zeigt nun einen Hinweis, bevor die Tor-Anonymisierungsfunktion aktiviert werden kann, um den Benutzer zu informieren, dass die Geschwindigkeit des Internetzugangs durch Tor reduziert sein kann. Dieser Hinweis kann deaktiviert werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Icon\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDas eBlocker Icon zeigt nun durch ein Ausrufungszeichen an, dass Systemmeldungen für den Benutzer vorliegen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eBeseitigte Fehler und Verbesserungen\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eErkennung von Tracking-Links\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEndlosschleifen bei erkannten Tracking-Links werden nun vermieden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGerätetarnung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Gerätetarnung kann nun auch auf der deutschsprachigen Benutzeroberfläche zurückgesetzt werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAllgemeine Fehler in der Benutzeroberfläche\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Schaltfläche zur Aktivierung der SSL-Funktionalität wird nun korrekt als verfügbar und aktiv angezeigt.\u003c/p\u003e\n\u003cp\u003eDas Hinzufügen von Einträgen zur SSL Ausnahmeliste funktioniert nun auch mit dem Microsoft Internet Explorer.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLizenzverwaltung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUpgrade-Lizenzen können nun auch von einem Gerät gelöst und einem anderen Gerät zugewiesen werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDiagnosebericht\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFehlende Informationen werden wieder korrekt im Diagnosebericht angezeigt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKernsystem\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDas SSL-Routing von deaktivierten Geräten wurde nach einem Neustart nicht immer korrekt wiederhergestellt. Dieser Fehler wurde behoben.\u003c/p\u003e\n\u003cp\u003eDer Neustart konnte in seltenen Fällen fehlschlagen, wenn die SSL Ausnahmelisten inkonsistent waren. Dieser Fehler wurde ebenfalls behoben.\u003c/p\u003e"},{"id":360002343693,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002343693-Release-Notes-0-9-3.json","html_url":"https://support.eblocker.com/hc/de/articles/360002343693-Release-Notes-0-9-3","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":-1,"vote_count":1,"section_id":360000523174,"created_at":"2018-03-24T21:24:13Z","updated_at":"2018-11-19T08:42:09Z","name":"Release Notes 0.9.3","title":"Release Notes 0.9.3","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:24:33Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cspan style=\"font-size: 20px;\"\u003e\u003cstrong\u003eNeue Funktionen\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdministrator-Passwort\u003c/strong\u003e \u003c/p\u003e\n\u003cp\u003eDer Zugriff auf die eBlocker Einstellungen kann jetzt durch ein optionales Administrator-Passwort abgesichert werden. Das Administrator-Passwort kann unter Einstellungen/Allgemein eingestellt werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVereinfachte Definition von Ausnahmelisten\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Definition von Ausnahmelisten für Apps wurde vereinfacht, um Ausnahmen für Apps zu definieren die mit eBlocker-SSL nicht kompatibel sind. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExpertentools (beta)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eZusätzlich haben wir für technische Experten ein Analysewerkzeug entwickelt, mit dem es sehr einfach ist, die Kommunikation von Apps zu analysieren und Ausnahmeregeln für Apps zu erstellen. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLizenzübertragung von Gerät zu Gerät\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAb sofort ist es möglich, eine Update-Lizenz auf ein anderes Gerät zu übertragen. Dies ist insbesondere für unsere technisch versierten Kunden interessant, die auf Basis der Raspberry/Banana Pi Plattform ihren eigenen eBlocker gebaut haben und ihre Lizenz auf ein anderen Pi übertragen möchten.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003e\u003cspan style=\"font-size: 30px;\"\u003e\u003cspan style=\"font-size: 12px;\"\u003eBeseitigte Fehler und Verbesserungen\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cbr\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVerbesserte Erkennung von Tracking Links\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Erkennung und Behandlung von Tracking Links wurde stark verbessert. Bisher konnte es vorkommen, dass der eBlocker bei Erkennung eines Tracking-Links nur eine leere Seite (1x1-Pixel) angezeigt hat. Jetzt wird bei der Erkennung von Tracking Links stets ein Dialog eingeblendet, in dem der Nutzer besser geführt wird.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVerbesserte Benutzeroberfläche in den Einstellungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Benutzeroberfläche in den Einstellungen wurde bei den Menüpunkten Allgemein, Geräte und IP-Anonymisierung verbessert und übersichtlicher gestaltet. Zudem wird jetzt auch stets die Version der Filterlisten angezeigt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBugfixes zur Stabilität und Performanz\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEs wurden viele Fehler beseitigt, um die Stabilität und Performanz von eBlockerOS zu verbessern.\u003c/p\u003e\n\u003cdiv class=\"clear\"\u003e \u003c/div\u003e"},{"id":360002343673,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002343673-Release-Notes-0-9-2.json","html_url":"https://support.eblocker.com/hc/de/articles/360002343673-Release-Notes-0-9-2","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T21:23:09Z","updated_at":"2018-03-24T21:23:30Z","name":"Release Notes 0.9.2","title":"Release Notes 0.9.2","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:23:30Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cspan style=\"font-size: 18px;\"\u003e\u003cspan style=\"font-size: 14px;\"\u003e\u003cstrong\u003eNeue Funktionen\u003c/strong\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEinstellungen\u0026gt;Apps für verbesserte SSL-Kompatibilität\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie meisten Websites funktionieren bei eingeschalteter SSL/HTTPS-Unterstützung völlig problemlos, wenn Sie im Browser geladen werden. Jedoch gibt es einige populäre Apps (z.B. Facebook, Twitter, etc.), die nicht mit der eBlocker SSL-Unterstützung kompatibel sind. Damit diese Apps trotzdem wie gewohnt funktionieren, können diese Apps jetzt von der Erfassung durch den eBlocker ausgenommen werden, indem Sie unter Einstellungen\u0026gt;Apps aktiviert werden. Bitte beachten Sie, dass bei der Aktivierung von Apps die jeweils korrespondierenden Websites durch den eBlocker nicht geschützt werden können. Wir raten generell von der Nutzung von Apps ab, da diese ein deutlich erhöhtes Risiko für Ihre Privatsphäre darstellen. Statt dessen empfehlen wir die entsprechenden Webseiten im Browser zu laden, der durch den eBlocker geschützt wird.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUnterstützung für mehrere Sprachen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAb sofort steht die Benutzeroberfläche sowohl in Englisch als auch in Deutsch zur Verfügung. Die Sprache kann unter Einstellungen\u0026gt;System\u0026gt;Zeitzone und Sprache ausgewählt werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUnterstützung für Zeitzonen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Zeitzone, in der der eBlocker eingesetzt wird, kann jetzt eingestellt werden. Dies ist wichtig, damit die zeitgesteuerten automatischen Updates korrekt funktionieren. Die Zeitzone kann unter Einstellungen\u0026gt;System\u0026gt;Zeitzone und Sprache eingestellt werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSystemmeldungen in der Controlbar\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWichtige Systemmeldungen des eBlockers werden jetzt in der Controlbar angezeigt. Das Nachrichtensymbol erscheint dabei nur dann, wenn neue Meldungen vorliegen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eErkennung von Routern, die eine manuelle Netzwerkkonfiguration benötigen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie automatische Netzwerkkonfiguration des eBlocker ist mit praktisch sämtlichen Routern kompatibel. Aktuell sind uns nur zwei Router von AVM/Fritzbox bekannt, die eine manuelle Netzwerkkonfiguration benötigen. Der eBlocker erkennt diese Routermodelle nun automatisch und weist über eine Systemmeldung auf die notwendige manuelle Netzwerkkonfiguration hin.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUnterstützung für Banana PI M2+ Boards\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDas neue Banana Pi M2+ Board, welches das Mainboard (Hauptplatine) für die Seriengeräte bildet, wird nun offiziell unterstützt. Das eBlockerOS Image für dieses Board kann unter \u003ca href=\"http://www.eBlocker.com/download\"\u003ewww.eBlocker.com/download\u003c/a\u003e kostenlos heruntergeladen werden.\u003c/p\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 18px;\"\u003e\u003cstrong\u003eBeseitigte Fehler und Verbesserungen\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVerbesserter Tor-Verbindungsstatus\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWir haben die Behandlung von Tor-Verbindungen verbessert und einen Fehler beseitigt, der „Tor nicht verbunden“ angezeigt hat, obwohl Tor problemlos lief.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVerbesserter Netzwerk-Konfigurationsassistent\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWir haben den Konfigurationsassistenten für manuelle Netzwerkeinstellungen verbessert. Dieser führt Sie nun klarer durch die notwendigen Schritte.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVerbesserter Aktivierungsassistent\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWir haben den Aktivierungsassistenten weiter verbessert, um die initiale Lizenz-Aktivierung des eBlockers weiter zu vereinfachen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVerbesserte Hilfe für die SSL-Unterstützung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWir haben die Hilfe für die Aktivierung der SSL-Unterstützung überarbeitet, korrigiert und um die populärsten Browser ergänzt. Die Hilfe steht jetzt auch in deutscher Sprache zur Verfügung.\u003c/p\u003e"},{"id":360002342434,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002342434-Release-Notes-0-9-1.json","html_url":"https://support.eblocker.com/hc/de/articles/360002342434-Release-Notes-0-9-1","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T21:22:09Z","updated_at":"2018-03-24T21:22:26Z","name":"Release Notes 0.9.1","title":"Release Notes 0.9.1","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:22:26Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003eDieses Maintenance Release umfasst hauptsächlich viele Bugfixes und Verbesserungen im Hintergrund.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVerbesserungen und Bugfixes\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eVerbesserungen in der grafischen Benutzeroberfläche\u003c/li\u003e\n\u003cli\u003eVerbesserungen in der Erkennung von Tracking-Links\u003c/li\u003e\n\u003cli\u003eDiverse Bugfixes bei der SSL/HTTPS-Unterstützung\u003c/li\u003e\n\u003cli\u003eBugfixes in der Netzwerkkonfiguration: doppelte IP-Adressvergabe, Setzen des Gateways\u003c/li\u003e\n\u003cli\u003eVollständige Unterstützung von Internet Explorer\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBekannte Probleme\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMicrosoft Edge Browser zeigt kein eBlocker Icon an, obwohl der eBlocker korrekt funktioniert. Abhilfe: Bitte verwenden Sie für Einstellungen am eBlocker einen anderen Browser.\u003c/li\u003e\n\u003c/ul\u003e"},{"id":360002343653,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002343653-Release-Notes-0-9.json","html_url":"https://support.eblocker.com/hc/de/articles/360002343653-Release-Notes-0-9","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T21:21:20Z","updated_at":"2018-03-24T21:21:38Z","name":"Release Notes 0.9","title":"Release Notes 0.9","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:21:38Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eNeue Funktionen\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSSL-Unterstützung\u003c/strong\u003e\u003cbr\u003eDie beta-Version der SSL/HTTPS-Unterstützung kann in den Settings unter „SSL“ aktiviert werden. Dabei terminiert der eBlocker die SSL-Verbindung mit dem Server und verschlüsselt die Verbindung zum Browser erneut. Bitte beachten Sie, dass dazu einmalig ein sogenanntes Sicherheitszertifikat in Ihrem Browser installiert werden muss. Dieser Vorgang ist mit wenigen Klicks in Sekunden erledigt wird in den Settings ausführlich erläutert. Zusätzlich empfehlen wir, dass Websites, auf denen sichere Ende-zu-Ende Transaktionen durchgeführt werden (wie z.B. im Online-Banking), der SSL-Ausnahmeliste hinzugefügt werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePause-Funktion\u003c/strong\u003e\u003cbr\u003eIm Fall, dass Websites nicht korrekt angezeigt oder Links nicht aufgerufen werden können, kann der eBlocker nun für 5 Minuten für das jeweilige Endgerät pausiert werden. Nach Ablauf der 5 Minuten aktiviert sich der eBlocker wieder automatisch.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLizenzverlängerungen\u003c/strong\u003e\u003cbr\u003eUpdate-Lizenzen können jetzt ohne Löschung der bestehenden Lizenz durch Eingabe eines gültigen Lizenzschlüssels verlängert werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 20px;\"\u003eVerbesserungen und Bugfixes\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndroid WLAN-Verbindungen verbessert\u003c/strong\u003e\u003cbr\u003eAndroid Geräte prüfen die WLAN-Verbindung mit dem Internet, indem bekannte Google-Tracking Dienste aufgerufen werden (sog. Google Captive Portal Check). Kann das Android Gerät den Dienst nicht aufrufen, weil er vom eBlocker geblockt wird, so wird die WLAN-Verbindung vom Android Gerät unterbrochen und neu aufgebaut.\u003c/p\u003e\n\u003cp\u003eUm dieses Verhalten zu verhindern antwortet der eBlocker jetzt automatisch anstelle der Google-Tracking Dienste und es werden keine Daten an Google mehr gesendet. Dieses Verhalten kann in den Settings unter Anonymisierung wieder deaktiviert werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTracking Links / 1x1-Pixel und leere Seiten Verhalten verbessert\u003c/strong\u003e\u003cbr\u003eLinks, die Nutzerprofile erfassen (z.B. in Newslettern) werden jetzt noch besser erkannt und automatisch, ohne dass der Nutzerklick erfasst wird, auf die Zielseite weitergeleitet. Kann der eBlocker die Zielseite nicht automatisch erkennen, wird ein entsprechender Dialog eingeblendet.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDiverse Bugs\u003c/strong\u003e\u003cbr\u003eZusätzlich haben wir viele Bugs im eBlocker Backend geschlossen und das Verfahren zum Abgleich mit den Blockinglisten optimiert.\u003c/p\u003e"},{"id":360002342293,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002342293-Release-Notes-0-8-9-2.json","html_url":"https://support.eblocker.com/hc/de/articles/360002342293-Release-Notes-0-8-9-2","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":0,"section_id":360000523174,"created_at":"2018-03-24T17:54:05Z","updated_at":"2018-03-24T17:54:31Z","name":"Release Notes 0.8.9-2","title":"Release Notes 0.8.9-2","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:54:31Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cspan style=\"font-size: 20px;\"\u003eNeue Funktionen\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 18px;\"\u003e\u003cspan style=\"font-size: 16px;\"\u003e\u003cstrong\u003eAdvanced Anonymization (verbesserte Anonymisierung)\u003c/strong\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eMit diesem Release wurde die \u003cstrong\u003e\"Anonymization\" Einstellungsseite in den Settings hinzugefügt\u003c/strong\u003e, auf der folgende neue Funktionen zur Verfügung stehen:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSelektierbare Tor Exit Länder\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Länder für die IP-Anonymisierung (Tor Exit Nodes) können jetzt frei gewählt werden. Es können beliebig viele Länder ausgewählt werden, und es wird zufällig ein Tor Exit Node in einem dieser Länder gewählt. \u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNeue experimentelle Funktionen:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWebRTC Anti IP-Adressen Leckage\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHintergrund: WebRTC ermöglicht Echtzeit-Kommunikation durch Client zu Client (P2P) Kommunikation. WebRTC wird beispielsweise für IP-Telefonie und Chat über den Browser verwendet. Beim Verbindungsaufbau über WebRTC kann nicht nur Ihre vom Provider vergebene IP-Adresse bekannt werden, sondern auch Ihre lokale IP Adresse im LAN.\u003c/p\u003e\n\u003cp\u003eWenn Sie die WebRTC Option aktivieren wird das Protokoll abgeschaltet und die IP-Adresse kann nicht mehr abgegriffen werden.\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEntfernung des HTTP Referer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHintergrund: Im HTTP Protokoll wird standardmäßig der sogenannte Referer an die aufgerufene Website gesendet. Der Referer ist die URL, die Sie auf die aktuelle Webseite verwiesen hat (z.B. über einen Link-Klick). Die aktuelle Website kann so einen Teil Ihres Surfverhaltens analysieren. Einige Websites benötigen jedoch den Referer für die Funktionsfähigkeit. Das Einschalten dieser Option kann zu Fehlern auf Webseiten führen.\u003c/p\u003e\n\u003cp\u003eSowohl WebRTC Blockierung als auch HTTP Referer Entfernung sind standardmäßig abgeschaltet.\u003c/p\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 20px;\"\u003eBugfixes und Verbesserungen\u003c/span\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEin Problem beim Update der Blockierungs-Listen auf Boards mit nur 512MB RAM (Raspberry Pi B+) wurde behoben\u003c/li\u003e\n\u003c/ul\u003e\n\u003cul\u003e\n\u003cli\u003eDer Schalter zum Aktivieren / Deaktivieren der automatischen Updates repräsentiert wieder den richtigen Zustand der automatischen Updatefunktion.\u003c/li\u003e\n\u003cli\u003eDer eBlocker startet nun auch ohne zugeordneter DHCP IPv4 Adresse (im automatischen Modus) und auch ohne, dass ein Gateway gefunden wurde. Somit sollten die eBlocker Einstellungsseiten immer unter folgender Adresse erreichbar sein: \u003ca href=\"http://169.254.94.109:3000/\"\u003ehttp://169.254.94.109:3000/\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003eDas Caching der Einstellungsseiten und der Controlbar des eBlockers wurde verbessert, wodurch schnellere Ladezeiten dieser Elemente ermöglicht werden.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 18px;\"\u003e\u003cstrong\u003eSicherheitsupdates\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEine Sicherheitslücke im glibc6 Paket, wurde durch ein Update auf eine neuere Version behoben (CVE-2015-7547)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cdiv class=\"clear\"\u003e \u003c/div\u003e"},{"id":360002341034,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002341034-Wie-binde-ich-einen-eigenen-DNS-Server-ein-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002341034-Wie-binde-ich-einen-eigenen-DNS-Server-ein-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":-1,"vote_count":1,"section_id":360000515273,"created_at":"2018-03-24T17:25:41Z","updated_at":"2019-01-21T13:51:52Z","name":"Wie binde ich einen eigenen DNS Server ein?","title":"Wie binde ich einen eigenen DNS Server ein?","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-08-29T10:29:52Z","user_segment_id":null,"permission_group_id":744634,"label_names":["server","dns","own","eigener","eigenen"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eMit der DNS Funktion vom eBlocker haben Sie nicht nur die Möglichkeit externe DNS Server einzubinden, Sie können auch einen eigenen Do It Yourself (DIY) DNS Server einbinden.\u003c/p\u003e\n\u003cp\u003eWenn Sie bereits einen DIY DNS Server betreiben, sollten Sie als erstes sichergehen, dass dieser in Ihrem Router als DNS Server hinterlegt ist. Aktivieren Sie nun die DNS-Funktion in Ihrem eBlocker unter Einstellungen \u0026gt; Menü \"DNS-Firewall\". Wählen Sie die Option \"Internet Provider\" aus.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e"},{"id":360002342093,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002342093-Wo-finde-ich-%C3%B6ffentlich-verf%C3%BCgbare-DNS-Server-im-Internet-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002342093-Wo-finde-ich-%C3%B6ffentlich-verf%C3%BCgbare-DNS-Server-im-Internet-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":1,"vote_count":3,"section_id":360000515273,"created_at":"2018-03-24T17:24:50Z","updated_at":"2019-01-21T13:53:21Z","name":"Wo finde ich öffentlich verfügbare DNS Server im Internet?","title":"Wo finde ich öffentlich verfügbare DNS Server im Internet?","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:25:15Z","user_segment_id":null,"permission_group_id":744634,"label_names":["server","dns","public","öffentliche"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eEine kleine Anzahl von DNS Server haben wir \u003ca href=\"https://www.eblocker.com/de/dns-server-liste/\" target=\"_blank\" rel=\"noopener\"\u003ehier\u003c/a\u003e für Sie aufgelistet.\u003c/p\u003e\n\u003cp\u003eWeitere öffentlich verfügbare DNS Server finden Sie im Internet. Geben Sie hierfür die Begriffe \"Öffentliche Nameserver\", oder \"Alternative DNS Server\" in die Suchmaschine ein.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e"},{"id":360002340994,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002340994-Admin-vom-Jugendschutz-ausgesperrt-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002340994-Admin-vom-Jugendschutz-ausgesperrt-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":1,"vote_count":1,"section_id":360000522794,"created_at":"2018-03-24T17:21:00Z","updated_at":"2018-11-08T22:19:23Z","name":"Admin vom Jugendschutz ausgesperrt.","title":"Admin vom Jugendschutz ausgesperrt.","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:21:23Z","user_segment_id":null,"permission_group_id":744634,"label_names":["parental","control","jugendschutz","locked","out","ausgesperrt"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eSie haben versehentlich alle Geräte einem Jugendschutz-Profil zugeordnet und können die eBlocker Einstellungen nun nicht mehr aufrufen. \u003c/p\u003e\n\u003cp\u003eUm zu den Einstellungen zu gelangen, können Sie die IP Adresse des eBlocker (IP Adresse:3000 - Beispiel: \u003ca href=\"http://192.168.1.26:3000\"\u003ehttp://192.168.1.26:3000\u003c/a\u003e), oder die Notfall IP Adresse des eBlockers (\u003ca href=\"http://169.254.94.109:3000\"\u003ehttp://169.254.94.109:3000\u003c/a\u003e) im Browser eingeben.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e"},{"id":360002340954,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002340954-Lange-Wartezeiten-und-Videostreams-brechen-ab-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002340954-Lange-Wartezeiten-und-Videostreams-brechen-ab-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":0,"vote_count":2,"section_id":360000515233,"created_at":"2018-03-24T17:17:06Z","updated_at":"2018-12-23T19:55:12Z","name":"Lange Wartezeiten und Videostreams brechen ab.","title":"Lange Wartezeiten und Videostreams brechen ab.","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:17:30Z","user_segment_id":null,"permission_group_id":744634,"label_names":["slow","langsam","tor","stream","stop","loading","wartezeit","video","music","abbrechen"],"body":"\u003cp\u003eÜberprüfen Sie, ob Sie das Tor-Netzwerk (Anon Funktion) des eBlocker aktiviert haben. Wenn Sie das Tor-Netzwerk aktiviert haben, dann deaktivieren dies Sie bitte.\u003c/p\u003e\n\u003cp\u003eDas Tor-Netzwerk garantiert keine festen Bandbreiten seiner Exit-Nodes. Deshalb kann es sein, dass es beim Aufruf einer Webseite lange dauern kann, bis die Webseite komplett geladen ist, oder Videostreams abbrechen.\u003c/p\u003e"},{"id":360002341973,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002341973-Die-echte-IP-Adresse-wird-angezeigt-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002341973-Die-echte-IP-Adresse-wird-angezeigt-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":2,"vote_count":2,"section_id":360000515233,"created_at":"2018-03-24T17:15:43Z","updated_at":"2019-04-11T14:46:28Z","name":"Die echte IP Adresse wird angezeigt.","title":"Die echte IP Adresse wird angezeigt.","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-04-11T14:44:08Z","user_segment_id":null,"permission_group_id":744634,"label_names":["ip","address","real","reale","addresse","displayed","angezeigt","tor"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eWenn eine IP Adresse nicht durch den eBlocker anonymisiert wird, kann das mehrere Gründe haben.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eDer eBlocker ist für das Gerät nicht aktiviert.\u003c/li\u003e\n\u003cli\u003eDer eBlocker ist für das Gerät aktiviert, aber die eBlocker HTTPS Funktion wurde für das Gerät nicht aktiviert und (oder) das eBlocker Zertifikat wurde auf dem Gerät nicht richtig hinterlegt.\u003c/li\u003e\n\u003cli\u003eSie benutzten weder das Tor-Netzwerk, noch eine VPN-Server Verbindung. So kann die IP-Adresse nicht anonymisiert werden.\u003c/li\u003e\n\u003cli\u003eTeile der Webseite kommen eventuell aus dem Browser Cache.\u003c/li\u003e\n\u003cli\u003eSie haben eine Browser Erweiterungen im Einsatz, welche die wahre IP-Adresse verraten könnte (zum Beispiel FLASH).\u003c/li\u003e\n\u003cli\u003eSie haben vielleicht für Ihr Internes Netzwerk (Heimnetz) das IPv6 Protokoll aktiviert, mit welchem der eBlocker noch nicht kompatibel ist.\u003c/li\u003e\n\u003c/ol\u003e\n\u003c/div\u003e\n\u003c/div\u003e"},{"id":360002341953,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002341953-Es-werden-viele-CAPTCHAs-angezeigt.json","html_url":"https://support.eblocker.com/hc/de/articles/360002341953-Es-werden-viele-CAPTCHAs-angezeigt","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":1,"vote_count":1,"section_id":360000515233,"created_at":"2018-03-24T17:14:24Z","updated_at":"2019-04-27T08:36:17Z","name":"Es werden viele CAPTCHAs angezeigt","title":"Es werden viele CAPTCHAs angezeigt","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T17:14:54Z","user_segment_id":null,"permission_group_id":744634,"label_names":["captcha","tor"],"body":"\u003cp\u003eEinige Websites stellen fest, dass der Aufrufer aus dem Tor-Netzwerk kommt und wollen dann als zusätzliche Sicherheit überprüfen, dass es sich um eine Person und keinen automatisierten Zugriff oder gar einen Angriff handelt. Zu diesem Zweck wird ein CAPTCHA eingeblendet. Das ist eine Funktion der aufgerufenen Webseite und kann vom eBlocker nicht beeinflusst werden.\u003c/p\u003e\n\u003cp\u003eSeit eBlockerOS 1.11 tritt dieses Phänomen eventuell öfter auf, weil bei aktiviertem Tor-Netzwerk nun immer die komplette Datenkommunikation über Tor läuft. Insbesondere auch die Webseiten, die über HTTPS geladen werden. Bei früheren eBlockerOS-Versionen wurden HTTPS-Anfragen nur dann über Tor geleitet, wenn die SSL-Funktion für das entsprechende Gerät aktiviert war.\u003c/p\u003e\n\u003cp\u003eBeachten Sie bitte, dass CAPTCHAs oftmals auf Websites eingesetzt werden, bei denen Sie sich ohnehin mit einem persönlichen Account anmelden müssen. Daher kann der Anbieter der Website sowieso alle Ihre Anfragen diesem Account zuordnen - auch wenn weiter keine persönlichen Daten über Sie bekannt sind. Das können weder das Tor-Netzwerk noch der eBlocker verhindern. Der eBlocker verhindert aber in jedem Fall - auch wenn Tor nicht verwendet wird, dass unbemerkt Anfragen an weitere Dritte, insbesondere Datensammler (Tracker) übertragen werden. Die Verwendung des Tor-Netzwerks gewährleistet in solchen Fällen also nicht unbedingt eine größere Anonymität.\u003c/p\u003e"},{"id":360002340294,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002340294-Kein-eBlocker-Dashboard.json","html_url":"https://support.eblocker.com/hc/de/articles/360002340294-Kein-eBlocker-Dashboard","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":0,"vote_sum":-20,"vote_count":36,"section_id":360000522734,"created_at":"2018-03-24T15:31:56Z","updated_at":"2019-06-25T14:39:26Z","name":"Kein eBlocker Dashboard","title":"Kein eBlocker Dashboard","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-08-29T09:47:18Z","user_segment_id":null,"permission_group_id":744634,"label_names":["icon"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eBeim Aufruf von setup.eblocker.com, oder eblocker.box sollten Sie im Browser das eBlocker Dashboard sehen.\u003c/p\u003e\n\u003cp\u003eWenn Sie statt dessen eine Webseite ohne einem eBlocker Icon sehen, dann überprüfen Sie zunächst folgendes:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIst das Netzteil richtig zusammen gebaut?\u003c/li\u003e\n\u003cli\u003eIst das Netzwerkkabel richtig mit dem eBlocker LAN Port verbunden?\u003c/li\u003e\n\u003cli\u003eIst das Netzwerkkabel richtig mit dem Router verbunden?\u003c/li\u003e\n\u003cli\u003eWenn alles richtig angeschlossen ist, sollten beim eBlocker nach einigen Sekunden die beiden LEDs leuchten / blinken.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWenn beim eBlocker die beiden LEDs am LAN Port blinken, öffnen Sie die Einstellungen Ihres Routers. Unter den Netzwerkeinstellungen sollten Sie den eBlocker als neues Gerät sehen. Ihr Router hat den eBlocker eine IP-Adresse gegeben. Notieren Sie sich diese IP-Adresse.\u003c/p\u003e\n\u003cp\u003eÖffnen Sie einen neuen Browser Tab. Geben Sie die notierte IP-Adresse ein und fügen Sie am Ende der IP-Adresse :3000 hinzu (Beispiel: 192.168.0.26:3000). Jetzt sollten Sie die eBlocker Einstellungen sehen.\u003c/p\u003e\n\u003cp\u003eWenn Sie die eBlocker Einstellungen nicht sehen, probieren Sie die eBlocker Notfall IP-Adresse. 169.254.94.109:3000\u003c/p\u003e\n\u003cp\u003eIn den eBlocker Einstellungen finden Sie den Menüpunkt \"Geräte\" (Englisch: Devices). Hier finden Sie alle vom eBlocker gefundene Geräte in Ihrem Netzwerk. Ihr Gerät, mit dem Sie in den eBlocker Einstellungen sind, wird in dieser Liste an erster Stelle angezeigt . Klicken Sie auf die IP-Adresse Ihres Gerätes und überprüfen Sie in den Einstellungen, ob der eBlocker für dieses Gerät aktiviert ist.\u003c/p\u003e\n\u003cp\u003eTipp: Legen Sie sich ein Lesezeichen für Ihr eBlocker Dashboard an, so haben Sie immer schnellen Zugriff auf das Dashboard.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e"},{"id":360024737733,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360024737733-Was-f%C3%BCr-Formate-von-Listen-werden-unterst%C3%BCtzt-.json","html_url":"https://support.eblocker.com/hc/de/articles/360024737733-Was-f%C3%BCr-Formate-von-Listen-werden-unterst%C3%BCtzt-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":1,"vote_count":1,"section_id":360004584253,"created_at":"2019-06-13T04:44:18Z","updated_at":"2019-06-13T10:35:32Z","name":"Was für Formate von Listen werden unterstützt?","title":"Was für Formate von Listen werden unterstützt?","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-06-13T04:47:59Z","user_segment_id":null,"permission_group_id":744634,"label_names":["blocker format formats"],"body":"\u003cp style=\"margin-bottom: 0cm; line-height: 100%;\"\u003eDer eBlocker erlaubt Ihnen das Hochladen von vier verschieden Listen-Formate:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\"Domain Listen\"\u003c/strong\u003e \u003c/p\u003e\n\u003cp\u003eDomain Listen sind Listen, welche ganz normale Domains enthalten.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eBeispiel\u003c/strong\u003e: \u003cbr\u003edomain.com\u003cbr\u003edomain.ru\u003cbr\u003ebad.domain2.org\u003cbr\u003everybad.domain2.pw\u003cbr\u003every.bad123.domain3.net\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003e\"squid-acl Listen\"\u003c/strong\u003e \u003c/p\u003e\n\u003cp style=\"margin-bottom: 0cm; line-height: 100%;\"\u003eSquid-acl Listen sind vergleichbar mit den Domain Liste Listen.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eBeispiel\u003c/strong\u003e:\u003cbr\u003edomain.com\u003cbr\u003edomain.ru\u003cbr\u003ebad.domain2.org\u003cbr\u003everybad.domain2.pw\u003cbr\u003every.bad123.domain3.net\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003e\"etc.hosts Listen\"\u003c/strong\u003e \u003c/p\u003e\n\u003cp\u003eEtc.host Listen sind Listen, die vor der Domain zum Beispiel eine IP-Adresse stehen haben. Dabei handelt es sich meist um die IP-Adresse des Localhost (127.0.0.1), oder auch um die IP-Adresse 0.0.0.0.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eBeispiel\u003c/strong\u003e: \u003cbr\u003e127.0.0.1 domain.com\u003cbr\u003e127.0.0.1 domain.ru\u003cbr\u003e127.0.0.1 bad.domain2.org\u003cbr\u003e127.0.0.1 verybad.domain2.pw\u003cbr\u003e127.0.0.1 very.bad123.domain3.net\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003e\"easylist\"\u003c/strong\u003e \u003c/p\u003e\n\u003cp\u003eEasylist sind Listen im Format der bekannten Browser Erweiterungen wie zum Beispiel AdBlock.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eBeispiel\u003c/strong\u003e: \u003cbr\u003e/adzone_\u003cbr\u003e/theadzone/*\u003cbr\u003e###adsontheright\u003cbr\u003e-advertise.$domain=~i-domain.net|~bad-domain.gr\u003cbr\u003e||domain.net^$third-part\u003cbr\u003e@@/ad_file/*$image,domain=domain.de|domains.de\u003cbr\u003ebaddomain.com###IMU_468x60\u003c/pre\u003e\n\u003cp\u003eNur für die \u003cstrong\u003eDomain\u003c/strong\u003e, \u003cstrong\u003esquid-acl\u003c/strong\u003e und \u003cstrong\u003eect.hosts\u003c/strong\u003e Liste gilt, dass das # Zeichen eine Bemerkung kennzeichnet, welche nicht vom eBlocker importiert wird.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eBeispiel\u003c/strong\u003e:\u003cbr\u003e# This hosts file is brought to you by XXXXXXX\u003cbr\u003e# You are free to copy and distribute this file for non-commercial uses.\u003cbr\u003e# Last updated: Mon, 28 May 2019 at 06:53:40 GMT\u003c/pre\u003e\n\u003cp\u003e \u003c/p\u003e"},{"id":360024168334,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360024168334-Welche-Szenarien-sind-zum-Abschluss-des-Verfahrens-denkbar-.json","html_url":"https://support.eblocker.com/hc/de/articles/360024168334-Welche-Szenarien-sind-zum-Abschluss-des-Verfahrens-denkbar-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":4,"vote_count":4,"section_id":360004512333,"created_at":"2019-06-05T08:46:01Z","updated_at":"2019-06-23T10:14:16Z","name":"Welche Szenarien sind zum Abschluss des Verfahrens denkbar?","title":"Welche Szenarien sind zum Abschluss des Verfahrens denkbar?","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-06-05T08:46:01Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp class=\"western\" style=\"margin-bottom: 0in;\"\u003eDrei Szenarien sind möglich:\u003c/p\u003e\n\u003col\u003e\n\u003cli style=\"margin-bottom: 0in;\"\u003eEs wird ein Finanzinvestor für die Fortsetzung des Unternehmens gefunden.\u003c/li\u003e\n\u003cli style=\"margin-bottom: 0in;\"\u003eDas Unternehmen wird als Ganzes oder in Teilen an ein anderes Unternehmen verkauft und die Technologien werden vom Käufer weiter entwickelt und betrieben.\u003c/li\u003e\n\u003cli style=\"margin-bottom: 0in;\"\u003eDas Unternehmen wird liquidiert, um die Gläubiger mit offenen Forderungen gegen die Gesellschaft zu bedienen.\u003c/li\u003e\n\u003c/ol\u003e"},{"id":360017299313,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360017299313-Ger%C3%A4te.json","html_url":"https://support.eblocker.com/hc/de/articles/360017299313-Ger%C3%A4te","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":0,"vote_count":0,"section_id":360003201954,"created_at":"2019-02-06T08:16:34Z","updated_at":"2019-06-05T07:30:23Z","name":"Geräte","title":"Geräte","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-06-05T07:29:44Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cspan class=\"wysiwyg-color-green120\"\u003eeBlocker Base ✓ / eBlocker Pro ✓ / eBlocker Family ✓\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eDiese Seite ist weiter unterteilt in die folgenden Abschnitte:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGeräte\u003c/li\u003e\n\u003cli\u003eGeräte Suchen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025690953/geraete-00-de.png\" alt=\"geraete-00-de.png\"\u003e\u003c/p\u003e\n\u003ch2\u003eGeräte\u003c/h2\u003e\n\u003cp\u003eDie Funktion \u003cstrong\u003eGeräte\u003c/strong\u003e zeigt Ihnen die Liste aller Netzwerkgeräte an, die der eBlocker in Ihrem Heimnetzwerk erkannt hat.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360037903293/23-01de-Devices.png\" alt=\"23-01de-Devices.png\"\u003e\u003c/p\u003e\n\u003cp\u003eDie Geräte werden zunächst durch ihre IP-Adresse und – soweit der eBlocker das ermitteln kann – durch den Hersteller identifiziert. Durch einen Klick auf die IP-Adresse können Sie weitere Details zu dem Gerät öffnen und einige Einstellungen vornehmen.\u003c/p\u003e\n\u003cp\u003eSie können in der Übersicht den eBlocker für alle Geräte, bis auf Ihren Router und Ihrem eBlocker, einfach deaktivieren, oder aktivieren, indem Sie den Schalter vor der betreffenden IP-Adresse umstellen.\u003c/p\u003e\n\u003cp\u003eFür Ihren Router und Ihren eBlocker können Sie einen optionalen Namen vergeben, jedoch keine weiteren Einstellungen vornehmen.\u003c/p\u003e\n\u003cp\u003eSymbole bei der IP Adresse:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOranger Computer = eBlocker ist für dieses Gerät aktiviert\u003c/li\u003e\n\u003cli\u003eGrauer Computer = eBlocker ist für dieses Gerät deaktiviert\u003c/li\u003e\n\u003cli\u003eRouter = Ihr Gateway / Router\u003c/li\u003e\n\u003cli\u003eeBlocker Logo = Ihr eBlocker\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSymbole beim Status:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStern = Der Gerät mit dem Sie aktuell in den eBlocker Einstellungen sind\u003c/li\u003e\n\u003cli\u003eNetzwerk Icon Orange = Das Gerät ist online\u003c/li\u003e\n\u003cli\u003eNetzwerk Icon Grau = Das Gerät ist offline\u003c/li\u003e\n\u003cli\u003eSchloss Icon Orange = HTTPS ist aktiviert\u003c/li\u003e\n\u003cli\u003eSchloss Icon Grau = HTTPS ist deaktiviert\u003c/li\u003e\n\u003cli\u003eSmartphone Icon Orange = Gerät ist über eBlocker Mobile verbunden\u003c/li\u003e\n\u003cli\u003eSmartphone Icon Grau = Gerät ist nicht über eBlocker Mobile verbunden\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEin Klick auf den Button \u003cstrong\u003eNeu laden\u003c/strong\u003e lädt die Geräteliste erneut.\u003c/p\u003e\n\u003cp\u003eMit einem Klick auf den Button \u003cstrong\u003eBearbeiten\u003c/strong\u003e können Sie einzelne, oder mehrere, Geräte aus der Geräteliste auswählen und diese dann aus der Geräteliste löschen.\u003c/p\u003e\n\u003cp\u003eWenn Sie auf einen Eintrag in der Geräteliste klicken, werden die Gerätedetails für dieses Gerät angezeigt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGerätedetails\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWir empfehlen für alle Geräte einmalig einen Gerätenamen zu vergeben, damit Sie die Geräte jederzeit leicht wiedererkennen können (z.B.: „Christians Laptop“, „Fernseher Wohnzimmer“ oder „Sabines Smartphone“).\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872194/geraete-de-02.png\" alt=\"geraete-de-02.png\"\u003e\u003c/p\u003e\n\u003cp\u003eHier werden Ihnen zusätzlich auch die IP Adresse, die Hardware Adresse (MAC) und gegebenenfalls der Hersteller pro Gerät angezeigt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker aktivieren\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn der Grundeinstellung ist der eBlocker für die meisten Geräte automatisch aktiviert.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793033/geraete-de-03.png\" alt=\"geraete-de-03.png\"\u003e\u003c/p\u003e\n\u003cp\u003eSie können jederzeit für jedes Gerät individuell festlegen, ob es vom eBlocker überwacht werden soll oder nicht und ob der eBlocker für dieses Gerät in der Pause ist. Falls der eBlocker für das Gerät aktiviert wurde, stehen im Folgenden weiteren Funktionen zur Verfügung.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGerät zurücksetzen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier können Sie ein Gerät auf die Gerätegrundeinstellung des eBlockers zurücksetzen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872234/geraete-de-04.png\" alt=\"geraete-de-04.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWeitere Funktion - Benutzer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eeBlocker Family Kunden können hier bestimmen, ob das Gerät zu einem bestimmten Benutzer zugeordnet werden soll.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872254/geraete-de-05.png\" alt=\"geraete-de-05.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWeitere Funktion - Anonymisierung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAktivieren Sie die IP-Anonymisierung und bestimmen Sie ob Sie eine Tor- oder VPN-Verbindung benutzen möchten.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793053/geraete-de-06.png\" alt=\"geraete-de-06.png\"\u003e\u003c/p\u003e\n\u003cp\u003eZusätzlich können Sie hier die Tarnung für ein Gerät bestimmen. Diese Funktion steht nur den eBlocker Pro und Family Kunden zur Verfügung, da man für die Gerätetarnung die HTTPS Funktion des eBlockers aktivieren muss. Öffnen Sie dazu die Auswahl und wählen Sie einen der vordefinierten Tarnungen (User Agenten) aus oder geben Sie einen eigenen User Agenten ein.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWeitere Funktion - Mobile\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier können Sie - sofern die eBlocker Mobile Funktion aktiviert wurde - den Zugriff auf Ihren eBlocker für dieses Gerät von außerhalb Ihres Netzwerkes aktivieren.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872294/geraete-de-07.png\" alt=\"geraete-de-07.png\"\u003e\u003c/p\u003e\n\u003cp\u003eSie können bestimmen, ob dieses Gerät nur für den Internetzugriff aktiviert ist, oder ob man von dem Gerät aus von außerhalb Ihres Netzwerkes auf andere Geräte in Ihrem lokalen Netzwerk zugreifen kann.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWeitere Funktion - Blocker\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDiese Funktion steht nur eBlocker Pro und Family Kunden zur Verfügung. Hier können Sie bestimmen, ob der eBlocker Tracker und trackende Werbung blockieren soll, ob der eBlocker seinen \u003cstrong\u003eDomain Blocker\u003c/strong\u003e, oder ob der eBlocker seinen \u003cstrong\u003ePattern Blocker\u003c/strong\u003e benutzen soll. Die Einstellung \u003cstrong\u003ePattern Blocker\u003c/strong\u003e setzt die Aktivierung von der HTTPS Funktion vor aus.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793073/geraete-de-08.png\" alt=\"geraete-de-08.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWenn Sie die Einstellung auf Automatisch setzen, wird der eBlocker anhand der HTTPS Funktion (aktiviert oder deaktiviert) für Sie entscheiden, ob der Domain, oder Pattern Blocker benutzt wird. Wir empfehlen die Einstellung \u003cstrong\u003eAutomatisch\u003c/strong\u003e zu verwenden.\u003c/p\u003e\n\u003cp\u003eZudem können Sie hier den Malware \u0026amp; Phishing Schutz des Ihres eBlockers aktivieren.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWeitere Funktion - HTTPS\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDiese Funktion steht nur eBlocker Pro und Family Kunden zur Verfügung. Sie können hier, wenn die HTTPS-Funktionalität auf dem eBlocker grundsätzlich aktiviert wurde, den eBlocker für jedes Gerät einzeln beauftragen, auch verschlüsselte Verbindungen (HTTPS) zu überwachen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793093/geraete-de-09.png\" alt=\"geraete-de-09.png\"\u003e\u003c/p\u003e\n\u003cp\u003eZudem können Sie hier für jedes Gerät die HTTPS-Fehleranalyse aktivieren, um später bei Verbindungsproblemen von zum Beispiel Apps schneller die vom eBlocker unterdrückte Serververbindung zu finden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWeitere Funktion - Controlbar\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLegen Sie hier fest, ob das eBlocker Symbol auf dem Gerät immer, nie oder nur für fünf Sekunden angezeigt werden soll, sobald Sie eine neue Webseite aufrufen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872314/geraete-de-10.png\" alt=\"geraete-de-10.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWichtig: eBlocker Base Kunden werden das eBlocker Icon nur auf HTTP Seiten sehen können.\u003c/p\u003e\n\u003cp\u003eZusätzlich gibt es die Option, das eBlocker Symbol nur in Standard-Browsern wie Microsoft Edge, Firefox, Chrome, oder Safari einzublenden. Dies umfasst auch Browser welche auf Chrome oder Firefox basieren. Das eBlocker Symbol wird dann beispielsweise nicht in Apps angezeigt.\u003c/p\u003e\n\u003cp\u003eAußerdem können Sie hier die Position des eBlocker Symbols festlegen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWeitere Funktion - Benachrichtigungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier können Sie pro Gerät bestimmen, ob alle, die wichtigsten oder keine Systemnachrichten vom eBlocker angezeigt werden sollen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872334/geraete-de-11.png\" alt=\"geraete-de-11.png\"\u003e\u003c/p\u003e\n\u003cp\u003eAls Standard Einstellung für alle Geräte, werden alle Systemnachrichten vom eBlocker angezeigt.\u003c/p\u003e\n\u003cp\u003eSie können hier zudem individuell für jedes Gerät bestimmen welche Bestätigungs- und Informationsdialoge angezeigt werden sollen.\u003c/p\u003e\n\u003ch2\u003eGeräte suchen\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eAutomatische Suche nach neuen Geräten\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDer eBlocker erkennt neue Geräte in Ihrem lokalen Netzwerk i.d.R. nach kurzer Zeit automatisch und zeigt diese auf der Seite \u003cstrong\u003eGeräte\u003c/strong\u003e an.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025793113/geraete-de-12.png\" alt=\"geraete-de-12.png\"\u003e\u003c/p\u003e\n\u003cp\u003eSie können hier festlegen, ob der eBlocker nun \u003cstrong\u003ealle 10 Sekunden\u003c/strong\u003e, \u003cstrong\u003ealle 5 Minuten\u003c/strong\u003e, \u003cstrong\u003eeinmal pro Stunde\u003c/strong\u003e, oder \u003cstrong\u003enie\u003c/strong\u003e nach neuen Geräten suchen soll. Sollten Sie die Option \u003cstrong\u003eNie\u003c/strong\u003e auswählen, dann beachten Sie bitte, dass Sie immer manuell nach neuen Geräten suchen müssen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eManuelle Suche nach neuen Geräten\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMit einem Klick auf die Schaltfläche \u003cstrong\u003eNeue Geräte suchen\u003c/strong\u003e, können Sie jederzeit manuell nach neuen Geräten suchen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024872354/geraete-de-13.png\" alt=\"geraete-de-13.png\"\u003e\u003c/p\u003e"},{"id":360013510133,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360013510133--Release-Notes-2-2.json","html_url":"https://support.eblocker.com/hc/de/articles/360013510133--Release-Notes-2-2","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":51,"vote_count":67,"section_id":360001752594,"created_at":"2018-12-10T16:05:11Z","updated_at":"2019-06-04T14:11:32Z","name":" Release Notes 2.2","title":" Release Notes 2.2","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-05-02T20:37:53Z","user_segment_id":null,"permission_group_id":744634,"label_names":["eBlockerOS","eOS","2.2"],"body":"\u003cp\u003e\u003cstrong\u003e\u003cspan class=\"wysiwyg-font-size-large\"\u003eeBlockerOS 2.2.20\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFehlerbehebungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn seltenen Fällen konnte es nach einem Wechsel des WLAN-Routers dazu kommen, dass der eBlocker nicht mehr vollständig funktioniert hat. Erst durch das Zurücksetzen auf die Werkseinstellungen konnte der eBlocker dann wieder gestartet werden. Dieses Problem wurde behoben: Auch nach einem Wechsel des WLAN-Routers funktioniert der eBlocker nun in jedem Fall korrekt und vollständig.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan class=\"wysiwyg-font-size-large\"\u003eeBlockerOS 2.2.19\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFehlerbehebungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBehebung von Fehlern im Zusammenhang mit den Starten und Stoppen einer VPN-Verbindung, die allerdings keinen direkten Einfluss auf die Funktion der VPN-Verbindung hatten.\u003c/p\u003e\n\u003cp\u003eDer Verbindungstest für ein VPN kann nun nicht mehr aufgerufen werden, solange eine aktive Verbindung in dieses VPN besteht. Grund ist, dass der Test aktive Verbindungen stören kann.\u003c/p\u003e\n\u003cp\u003eUnnötige Fehlermeldungen in Zusammenhang mit geblockten Anfragen (z.b. Tracker oder Werbung), die per HTTPS aufgerufen werden, werden nun vermieden.\u003c/p\u003e\n\u003cp\u003eIn sehr seltenen Fällen konnte die Netzwerkkonfiguration nach einen Neustart kurzzeitig fehlerhaft sein. Dieser Fehler wurde behoben.\u003c/p\u003e\n\u003cp\u003eBehebung eines Problems beim täglichen Aktualisierungsprozess: In seltenen Fällen konnte es zu einem Problem kommen, das nur durch einen Neustart gelöst werden konnte.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan class=\"wysiwyg-font-size-large\"\u003eeBlockerOS 2.2.17\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFehlerbehebungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn seltenen Fällen konnte der eBlocker beim Wechsel vom automatischen Netzwerkmodus in die individuellen Einstellungen die Verbindung zu einem externen Zeitserver verlieren. Dadurch konnte es passieren, dass die eingebaute Uhr des eBlockers zunehmend nach ging, wodurch es dann zu Folgefehlern kommen konnte. Dieses Problem wurde behoben.\u003c/p\u003e\n\u003cp\u003eBei der Verwendung von Tor über eBlocker Mobile wurde in manchen Fällen nur der HTTP-Verkehr über das Tor-Netzwerk geleitet. Dieser Fehler wurde behoben: Auch bei Verwendung von eBlocker Mobile wird nun immer der komplette Datenverkehr des Gerätes über Tor geleitet, falls Tor für das Gerät aktiviert ist.\u003c/p\u003e\n\u003cp\u003eBei Verwendung von Tor wurden DNS-Anfragen nicht über das Tor-Netzwerk geleitet, falls die eBlocker DNS Firewall abgeschaltet war. Dieser Fehler wurde behoben: Bei Verwendung von Tor werden nun immer alle DNS-Anfragen des Gerätes über das Tor-Netzwerk geleitet. Unabhängig davon, ob die DNS-Firewall aktiviert wurde.\u003c/p\u003e\n\u003cp\u003eBei Verwendung von eBlocker Mobile konnte die URL \"eBlocker.box\" von mobilen Geräten manchmal erst nach einem Neustart aufgelöst werden. Dieser Fehler wurde behoben: Bei Aktivierung von eBlocker Mobile steht die URL \"eBlocker.box\" nun immer sofort auch für mobile Geräte zur Verfügung.\u003c/p\u003e\n\u003cp\u003eWenn eine sehr alte eBlockerOS Version direkt auf eOS 2.2 aktualisiert wurde, konnte es vorkommen, dass das neue, aktive Monitoring von VPN-Verbindungen auf Grund eines fehlenden fehlendes Software-Pakets\u003cbr\u003enicht funktionierte. Dieses Problem wurde behoben. Das Software-Paket wird nun in jedem Fall installiert.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVerbesserungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDer Assistent zum Einrichten von eBlocker Mobile enthält nun einen Hinweis, dass die Port-Weiterleitung für UDP eingerichtet werden muss.\u003c/p\u003e\n\u003cp\u003eDer Diagnosebericht wurde um eine wichtige Logdatei erweitert.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan class=\"wysiwyg-font-size-large\"\u003eeBlockerOS 2.2.15\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWichtige Fehlerbehebung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEin Fehler im Logging-System des eBlocker konnte in seltenen Fällen dazu führen, dass bei unsachgemäßer Abschaltung des eBlockers die Verzeichnisstrukturen beschädigt wurden, wodurch der eBlocker dann nicht mehr starten konnte. Dieser Fehler wurde behoben und kann nicht mehr auftreten. Trotzdem empfehlen wir nach wie vor dringend, den eBlocker immer nur über die eBlocker Einstellungen herunterzufahren und nicht nur die Stromzufuhr zu unterbrechen!\u003cbr\u003e \u003cbr\u003e Für betroffene Kunden steht ein Repartur-Skript bereit, welches jederzeit vom eBlocker Support angefordert werden kann (\u003ca class=\"moz-txt-link-abbreviated\" href=\"mailto:support@eBlocker.com\"\u003esupport@eBlocker.com\u003c/a\u003e).\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e \u003cspan class=\"wysiwyg-font-size-large\"\u003e\u003cstrong\u003eeBlockerOS 2.2.14\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNeue Funktionen und Verbesserungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Mobile\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEin neuer Assistent hilft bei der Einrichtung von OpenVPN auf verschiedenen mobilen Geräten.\u003c/p\u003e\n\u003cp\u003eMan kann nun für jedes mobile Gerät definieren, ob dieses Gerät auf andere Geräte im lokalen Netz zugreifen kann, wenn es per eBlocker Mobile verbunden ist.\u003c/p\u003e\n\u003cp\u003eIn der Geräteübersicht wird nun angezeigt, ob ein Gerät mobil verbunden ist oder nicht, bzw. ob es sich mobil verbinden darf.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVPN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEine neue Option erlaubt das aktive Monitoring der VPN-Verbindung mit automatischer Neu-Verbindung. Bei manchen VPN-Providern ist dieses aktive Monitoring nötig, um eine dauerhaft stabile Verbindung zu erreichen.\u003c/p\u003e\n\u003cp\u003eEs wird nun verhindert, dass der Browser das Passwort-Feld bei den VPN-Profilen automatisch ausfüllt.\u003c/p\u003e\n\u003cp\u003eFalls es bei der Einrichtung oder Aktivierung einer VPN-Verbindung zu Verbindungsfehlern kommen sollte, werden diese nun übersichtlicher dargestellt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHTTPS-Unterstützung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEin neuer Assistent hilft bei der Aufnahme des eBlocker-Zertifikats in Windows, macOS, iOS und Android sowie in verschiedene Browser-Umgebungen.\u003c/p\u003e\n\u003cp\u003eDer Dateiname des heruntergeladenen eBlocker-Zertifikats ist jetzt sprechender und erlaubt eine leichtere Wiedererkennung der Datei.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJugendschutz\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Sperrliste für \"Illegale Download-Sites\" wurde aus der allgemeinen Liste \"Ungeeignete Inhalte\" herausgelöst und als eigenständige Liste bereitgestellt.\u003c/p\u003e\n\u003cp\u003eWenn das Jugendschutz-Zeitfenster den Internet-Zugriff abschaltet, werden nun auch laufende Streams (z.B. Filme) zeitnah unterbrochen, spätestens, wenn der bereits gepufferte Inhalt abgespielt worden ist.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNetzwerk-Einstellungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIm Expertenmodus kann die Standard-DHCP-Lease-Time nun vom Administrator gewählt werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTracker- und Ad-Blocker\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAuf der Blocker-Seite für geblockte Domains gibt es jetzt die Option, den eBlocker kurz zu pausieren, damit man die Zielseite ggf. doch erreichen kann. Beachten Sie, dass es wegen lokaler DNS-Caches des Browsers oder des Betriebssystems ein paar Minuten dauern kann, bis die Seite erreichbar wird.\u003c/p\u003e\n\u003cp\u003eDie Blocker-Seite wurde insgesamt überarbeitet und neu gestaltet.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Einstellungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie Darstellung von Tabellen auf sehr kleinen Bildschirmen (Smartphones) wurde verbessert.\u003c/p\u003e\n\u003cp\u003eGeräte, die aktuell online sind, können nicht mehr „gelöscht“ werden – sie würden ohnehin nach kurzer Zeit wieder in der Liste erscheinen. Das Rücksetzen auf Standard-Einstellungen ist aber über die Detail-Ansicht weiterhin jederzeit für alle Geräte möglich.\u003c/p\u003e\n\u003cp\u003eDatumsangaben werden nun immer korrekt in deutsch angezeigt. Bisher wurden teilweise englische Monatsabkürzungen verwendet.\u003c/p\u003e\n\u003cp\u003eDie eBlocker Einstellungen zeigen nun immer klar an, solange im Hintergrund noch ein Vorgang läuft und der Benutzer einen kleinen Moment warten muss, bevor die nächste Einstellung vorgenommen werden kann.\u003c/p\u003e\n\u003cp\u003eDas Navigationsmenü wurde verbessert und für mobile Geräte optimiert.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Dashboard\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWenn das Dashboard nicht verwendet wird oder in einem versteckten Tab läuft, schaltet es sich nach einer Weile automatisch ab und startet automatisch neu, wenn es nach vorne geholt oder erneut verwendet wird. (Die bisher angezeigte Dialogbox entfällt.)\u003c/p\u003e\n\u003cp\u003eDie Pause-Zeit kann nun bis maximal 10 Stunden eingestellt werden.\u003c/p\u003e\n\u003cp\u003eDas Verschieben der Dashboard-Karten (Drag \u0026amp; Drop) wurde verbessert. Insbesondere das Anhängen einer Karte an eine kurze Spalte funktioniert nun zuverlässiger.\u003c/p\u003e\n\u003cp\u003eDas Navigationsmenü wurde verbessert und für mobile Geräte optimiert. Insbesondere kann man durch Klick auf das Zahnrad-Symbol rechts oben jederzeit schnell in die eBlocker Einstellungen wechseln.\u003c/p\u003e\n\u003cp\u003eDie Tooltips sind durch eine größere Schrift und einen stärkeren Kontrast nun besser lesbar.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSonstige Verbesserungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInterne Netzwerk- und Protokoll-Bibliotheken wurden aktualisiert, um die Performanz und Stabilität weiter zu verbessern.\u003c/p\u003e\n\u003cp\u003eDie eBlocker-Einstellungen sind nun bereits kurz nach dem Neustart auch unter dem Standard-Port 80 erreichbar, nicht nur unter Port 3000. Bisher war Port 80 erst nach vollständigem Start erreichbar.\u003c/p\u003e\n\u003cp\u003eDer Aufruf von www.eblocker.box (nicht nur eblocker.box) wird nun auch auf das Dashboard umgeleitet.\u003c/p\u003e\n\u003cp\u003eIn seltenen Fällen können bei der ungeplanten Trennung der Stromzufuhr vom eBlocker einzelne Dateien beschädigt werden. Die Selbstreparatur-Mechanismen wurden verbessert, um diesen Fall noch unwahrscheinlicher zu machen. Wir empfehlen aber weiterhin dringend, den eBlocker über die Einstellungen geordnet herunterzufahren, bevor die Stromzufuhr unterbrochen wird!\u003c/p\u003e\n\u003cp\u003eOptimierungen bei der Ladezeit der eBlocker Anwendungen (Einstellungen, Dashboard, ControlBar u.a.) sowie Optimierung der Datenübertragung bei Pattern-Blockern und erweiterten Blockern.\u003c/p\u003e\n\u003cp\u003eErweiterung des Diagnose-Berichts um wichtige Status-Informationen, sowie Entfernung unnötiger oder irreführender Meldungen aus den Logdateien. Außerdem wird die maximale Größe aller Logdateien begrenzt, um einen Speicherüberlauf zu verhindern\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFehlerbehebungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBehebung eines Problems im Netzwerk-Expertenmodus: Hier konnte es zu Problemen mit dem DHCP-Server kommen, falls sich die Netzmaske des lokalen Netzwerks geändert hat.\u003c/p\u003e\n\u003cp\u003eBehebung eines Problems im Netzwerk-Expertenmodus: Hier wurde die Konfiguration der DNS-Firewall nicht immer konsistent angezeigt und hat sich in bestimmten Konstellationen scheinbar von selbst geändert.\u003c/p\u003e\n\u003cp\u003eBehebung eines Problems in Zusammenhang mit manuell angelegten, vertrauenswürdigen HTTPS-Websites: In manchen Fällen konnten diese Einträge nicht wieder gelöscht werden.\u003c/p\u003e\n\u003cp\u003eBehebung eines Problems in Zusammenhang mit der DNS-Firewall: Manche Router veröffentlichen die ungültige Adresse \"0.0.0.0\" als sekundären DNS-Server. Diese Angabe wird nun ignoriert.\u003c/p\u003e\n\u003cp\u003eBehebung eines Problems in Zusammenhang mit Geräten mit ungültigen Subnetz-Adressen: Wenn ein solches Geräte neu entdeckt wird, wird es nun ignoriert und nicht mehr angezeigt. Bereits in der Liste enthaltene Geräte bleiben aber in der Liste.\u003c/p\u003e\n\u003cp\u003eBehebung eines Problems in Zusammenhang mit dynamischen IP-Adressen im lokalen Netz: In seltenem Fällen kam es zu einem Fehler, wenn der eBlocker vom DHCP-Server eine neue IP-Adresse bekommen hat, die vorher einem anderen Gerät zugewiesen war.\u003c/p\u003e\n\u003cp\u003eBehebung eines Problems beim Aufruf der eBlocker Einstellungen direkt nach einem Neustart: Manchmal war das erneute Laden der Seite nötig, um die Einstellungen korrekt anzuzeigen.\u003c/p\u003e\n\u003cp\u003eBehebung eines Problems mit eBlocker Mobile auf AMD Plattformen.\u003c/p\u003e\n\u003cp\u003eBehebung eines Problems mit eBlocker Mobile auf Raspberry Pi B3+ Plattformen.\u003c/p\u003e\n\u003cp\u003eBehebung eines Anzeigeproblems in Zusammenhang mit Jugendschutzprofilen.\u003c/p\u003e\n\u003cp\u003eBehebung kleinerer Inkonsistenzen in der Benutzeroberfläche.\u003c/p\u003e\n\u003cp\u003eBehebung eines seltenen Problems beim Start des eBlockers.\u003c/p\u003e\n\u003cp\u003eBehebung eines seltenen Problems bei der Erstellung des Diagnose-Berichts.\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e"},{"id":360008637593,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360008637593-Was-ist-fragFINN-.json","html_url":"https://support.eblocker.com/hc/de/articles/360008637593-Was-ist-fragFINN-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":0,"vote_count":0,"section_id":360000522794,"created_at":"2018-08-28T13:53:46Z","updated_at":"2018-08-29T10:07:08Z","name":"Was ist fragFINN?","title":"Was ist fragFINN?","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-08-29T10:07:08Z","user_segment_id":null,"permission_group_id":744634,"label_names":["fragfinn","frag","finn"],"body":"\u003cp\u003eAb der eBlockerOS Version 2 haben wir einen zusätzlichen Schutz für Ihre Kinder durch eine umfangreiche Schutzliste von fragFINN eingebaut. fragFINN ist eine Internet Suchmaschine für Kinder, deren Ergebnisse speziell für kleinen Nutzer ausgewählt werden.\u003c/p\u003e\n\u003cp\u003eWenn Sie ein neues Jugendschutzprofil anlegen, können Sie zum Beispiel die Zugriffsbeschränkungen wie folgt einstellen:\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360011405193/fragFINN-DE01.png\" alt=\"fragFINN-DE01.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWählen Sie den Grundsatz \"Folgende Kategorien sind erlaubt, alle anderen Webseiten sind verboten\" aus.\u003c/li\u003e\n\u003cli\u003eWählen Sie fragFINN aus und speichern Sie die Einstellung.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWenn Sie dieses Jugendschutzprofil nun einem Benutzer zuweisen und dem Benutzer im Anschluss ein bestimmtes Gerät zuordnen, kann dieser Benutzer auf diesem Gerät nur noch auf die von fragFINN ausgewählten Webseiten zugreifen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360011405213/fragFINN-DE02.png\" alt=\"fragFINN-DE02.png\"\u003e\u003c/p\u003e\n\u003cp\u003eZusätzlich haben wir zu der Meldung des eBlockers ein fragFINN Suchfeld eingebaut.\u003cbr\u003eSollten Sie Ihre eBlocker Oberfläche auf Englisch eingestellt haben, so sehen Sie hier die Suche von DuckDuckGo.\u003c/p\u003e"},{"id":360008030973,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360008030973-Wo-kann-ich-eine-passende-OpenVPN-App-herunterladen-.json","html_url":"https://support.eblocker.com/hc/de/articles/360008030973-Wo-kann-ich-eine-passende-OpenVPN-App-herunterladen-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":4,"vote_count":4,"section_id":360000522814,"created_at":"2018-08-13T09:05:19Z","updated_at":"2019-01-01T09:33:47Z","name":"Wo kann ich eine passende OpenVPN App herunterladen?","title":"Wo kann ich eine passende OpenVPN App herunterladen?","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-08-13T09:06:57Z","user_segment_id":null,"permission_group_id":744634,"label_names":["windows","mac","macos","app","vpn","android","iphone","ipad"],"body":"\u003cp\u003eUm von allen eBlocker-Funktionen auch unterwegs zu profitieren, verbinden Sie sich einfach mit Ihrem eigenen eBlocker zu Hause. Sie benötigen eine der folgenden kostenlosen Apps für Ihr Betriebssystem, um einen VPN-Tunnel zu Ihrem Heimnetzwerk zu öffnen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpenVPN App für macOS\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTunnelblick (Open Source GNU General Public License) - \u003ca href=\"https://tunnelblick.net/downloads.html\" target=\"_blank\" rel=\"noopener\"\u003eDownload hier...\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpenVPN Connect für iOS iPhone\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDownload im App Store - \u003ca href=\"https://itunes.apple.com/de/app/openvpn-connect/id590379981?mt=8\" target=\"_blank\" rel=\"noopener\"\u003eDownload hier...\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpenVPN Connect für iOS iPad\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDownload im App Store - \u003ca href=\"https://itunes.apple.com/us/developer/openvpn-technologies/id590379984?mt=8\" target=\"_blank\" rel=\"noopener\"\u003eDownload hier...\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpenVPN App für Android\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOpenVPN Connect bei Google Play - \u003ca href=\"https://play.google.com/store/apps/details?id=net.openvpn.openvpn\" target=\"_blank\" rel=\"noopener\"\u003eDownload hier...\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOpenVPN App für Windows\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOpenVPN Connect (OpenVPN Technologies) - \u003ca href=\"https://openvpn.net/index.php/open-source/downloads.html\" target=\"_blank\" rel=\"noopener\"\u003eDownload hier...\u003c/a\u003e\u003c/p\u003e"},{"id":360006811553,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360006811553-Warum-empfange-ich-keine-Updates-.json","html_url":"https://support.eblocker.com/hc/de/articles/360006811553-Warum-empfange-ich-keine-Updates-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":1,"vote_count":3,"section_id":360000522734,"created_at":"2018-07-10T08:23:35Z","updated_at":"2019-06-07T19:42:47Z","name":"Warum empfange ich keine Updates?","title":"Warum empfange ich keine Updates?","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-08-29T09:53:10Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003eDie eBlocker Pro und eBlocker Family empfangen die Updates der Filterlisten automatisch – täglich von Montag bis Freitag. An Wochenenden und Feiertagen gibt es keine Updates.\u003c/p\u003e\n\u003cp\u003eDie Aktualisierung des Betriebssystems vom eBlocker Base wird automatisch durchgeführt, sobald ein neues Update zur Verfügung steht.\u003c/p\u003e\n\u003cp\u003eIn den eBlocker Einstellungen \u0026gt; Menü „Allgemein“ können Sie im Reiter „Aktualisierung“ sehen, welche eBlocker Filterlisten-Version installiert ist. Hier können Sie auch bestimmen, wann Ihr eBlocker nach Updates suchen soll oder ob Sie diese lieber manuell durchführen möchten.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360011425674/01-DE.png\" alt=\"01-DE.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWir empfehlen, die automatische Aktualisierung nachts durchzuführen.\u003c/p\u003e\n\u003cp\u003eWenn Sie als eBlocker Pro oder eBlocker Family Kunde einige Tage keine Updates bekommen sollten, überprüfen Sie zunächst, ob Sie den Update-Modus möglicherweis auf „manuell“ gestellt haben. Ist dies nicht der Fall, erstellen Sie bitte einen Diagnosebericht von Ihrem eBlocker und senden diesen mit einer kurzen Beschreibung Ihres Problems an unseren Support: support@eblocker.com\u003c/p\u003e\n\u003cp\u003eDen Diagnosebericht Ihres eBlockers können Sie in den eBlocker Einstellungen \u0026gt; System \u0026gt; Reiter „Diagnose“ erstellen. Die Erstellung des Berichts benötigt ca. 30 Sekunden und wird anschließend mit dem freien Kompressionsprogramm „gzip“* als TGZ-Datei gespeichert.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e* gzip ist heute in der UNIX-Welt Standard, da es einen guten Komprimierungsgrad und eine hohe Geschwindigkeit bei der Komprimierung bietet.\u003c/em\u003e\u003c/p\u003e"},{"id":360005410573,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360005410573-Das-eBlocker-Support-Forum-.json","html_url":"https://support.eblocker.com/hc/de/articles/360005410573-Das-eBlocker-Support-Forum-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":true,"position":1,"vote_sum":6,"vote_count":12,"section_id":360000516793,"created_at":"2018-06-05T13:16:13Z","updated_at":"2019-04-13T06:03:34Z","name":"Das eBlocker Support-Forum ","title":"Das eBlocker Support-Forum ","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-06-19T09:58:05Z","user_segment_id":null,"permission_group_id":744634,"label_names":["#forum","#community","#support"],"body":"\u003cp\u003eHerzlich willkommen im eBlocker Support-Forum.\u003c/p\u003e\n\u003cp\u003eDas Support-Forum bietet eine deutsche und eine englische Benutzeroberfläche. Oben und unten auf der Seite können Sie ganz einfach die gewünschte Sprache auswählen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360007623514/de-oben.png\" alt=\"de-oben.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006828253/01DE.png\" alt=\"01DE.png\"\u003e\u003c/p\u003e\n\u003cp\u003eDas Support-Forum bietet Ihnen die Möglichkeit in den FAQs oder in der Wissensdatenbank zu stöbern.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006770014/02DE.png\" alt=\"02DE.png\"\u003e\u003c/p\u003e\n\u003cp\u003eMit der Suche können Sie im gesamten Support-Forum – das umfasst die FAQs, die Wissensdatenbank und den Community-Bereich - nach Antworten suchen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006828193/03DE.png\" alt=\"03DE.png\"\u003e\u003c/p\u003e\n\u003cp\u003eAngemeldete Benutzer können sich mit anderen eBlocker-Benutzern in der Community austauschen. Dort werden Ihre Fragen oder Anregungen auch von unserem Support-Team gelesen und beantwortet.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006828233/04DE.png\" alt=\"04DE.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWer den direkten Kontakt zum eBlocker Support-Team sucht, kann ganz einfach und ohne Anmeldung hier seine Fragen einstellen. Natürlich erreichen Sie unser Support-Team auch über die Mailadresse support@eblocker.com.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006828173/05DE.png\" alt=\"05DE.png\"\u003e\u003c/p\u003e\n\u003cp\u003eBevor Sie unser Support-Team direkt kontaktieren, lesen Sie bitte den Beitrag \"\u003ca href=\"https://support.eblocker.com/hc/de/articles/360004587533-Den-eBlocker-Support-kontaktieren\" target=\"_blank\" rel=\"noopener\"\u003eDen eBlocker Support kontaktieren\u003c/a\u003e\" in der Wissensdatenbank.\u003c/p\u003e\n\u003cp\u003eWir bitten Sie die folgenden Regeln und Richtlinien einzuhalten, wenn Sie in der Community einen neuen Beitrag veröffentlichen oder auf einen Beitrag antworten.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWenn Sie Kritik haben, stellen Sie bitte sicher, dass Sie diese in einer konstruktiven Art und Weise veröffentlichen.\u003c/li\u003e\n\u003cli\u003eBitte schreiben Sie auf eine Art und Weise, die andere Benutzer respektiert.\u003c/li\u003e\n\u003cli\u003eBeleidigen Sie keine anderen Benutzer in der Community.\u003c/li\u003e\n\u003cli\u003eBitte verwenden Sie eine geeignete und beschreibende Betreffzeile, wenn Sie einen neuen Beitrag einstellen.\u003c/li\u003e\n\u003cli\u003eVeröffentlichen Sie keine persönlichen Daten.\u003c/li\u003e\n\u003cli\u003eVeröffentlichen Sie keinen Spam, keine anstößige Inhalte oder Links zu Phishing-Seiten in unserer Community.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBitte beachten Sie, dass sich unsere Moderatoren das Recht vorbehalten, jeden Beitrag jederzeit zu bearbeiten oder zu löschen. Außerdem behalten wir uns das Recht vor, Benutzer, die gegen die Forenregeln verstoßen, zu sperren.\u003c/p\u003e\n\u003cp\u003eVielen Dank für Ihr Verständnis.\u003c/p\u003e"},{"id":360004553814,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360004553814-Die-eBlocker-HTTPS-Funktion.json","html_url":"https://support.eblocker.com/hc/de/articles/360004553814-Die-eBlocker-HTTPS-Funktion","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":3,"vote_count":5,"section_id":360000516773,"created_at":"2018-05-20T16:59:55Z","updated_at":"2019-02-22T16:32:01Z","name":"Die eBlocker HTTPS Funktion","title":"Die eBlocker HTTPS Funktion","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-02-06T20:37:00Z","user_segment_id":null,"permission_group_id":744634,"label_names":["ssl","https","certificate","Zertifikat"],"body":"\u003cp\u003eNach Erstanschluss zeigt der eBlocker sein eBlocker Symbol nur auf HTTP Seiten an. Damit Sie das eBlocker Symbol auch auf HTTPS Seiten sehen können, müssen Sie die HTTPS Funktion im eBlocker aktivieren und das eBlocker HTTPS Zertifikat anschließend im gewünschten Gerät hinterlegen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWichtig\u003c/strong\u003e: Die HTTPS Funktion steht nur dem eBlocker Pro und eBlocker Family zur Verfügung.\u003c/p\u003e\n\u003cp\u003eFür Geräte bei denen man das eBlocker Zertifikat nicht hinterlegen kann, sollten Sie die HTTPS Funktion vom eBlocker nicht aktivieren.\u003c/p\u003e\n\u003cp\u003eDie eBlocker HTTPS Funktion finden Sie in den eBlocker \u003cstrong\u003eEinstellung\u003c/strong\u003e \u0026gt; Menü \u003cstrong\u003eHTTPS\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025735873/HTTPS-WD-DE-01.png\" alt=\"HTTPS-WD-DE-01.png\"\u003e\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0cm; line-height: 100%;\"\u003eWenn Sie die eBlocker HTTPS Funktion zum ersten Mal aktivieren, empfehlen wir Ihnen das eBlocker Zertifikat zu erneuern. Klicken Sie in dem Menü HTTPS auf den Reiter \u003cstrong\u003eZERTIFIKAT\u003c/strong\u003e und dort unten auf den Button \u003cstrong\u003eJetzt erneuern\u003c/strong\u003e.\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0cm; line-height: 100%;\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025735893/HTTPS-WD-EN-02.png\" alt=\"HTTPS-WD-EN-02.png\"\u003e\u003c/p\u003e\n\u003cp\u003eFolgen Sie dem Assistenten und danach haben Sie ein neues eBlocker Zertifikat erstellt, welches ab dem Zeitpunkt der Erstellung gültig ist.\u003c/p\u003e\n\u003cp\u003eNun können Sie das eBlocker Zertifikat hinterlegen. Wir empfehlen das eBlocker Zertifikat erst im Betriebssystem zu hinterlegen. Die meisten Browser, oder andere Programme, nutzen die Zertifikate aus dem Zertifikatsspeicher Ihres Betriebssystems. Einige der wenigen Programme, die einen eigenen Zertifikatsspeicher auf allen Betriebssystemen nutzen, sind der Browser Firefox, Cliqz, Seamonkey, oder auch das E-Mail-Programm Thunderbird.\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0cm; line-height: 100%;\"\u003eHier finden Sie eine Auflistung unserer Zertifikat FAQ Beiträge für die Betriebssysteme:\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0cm; line-height: 100%;\"\u003e\u003ca href=\"https://support.eblocker.com/hc/de/articles/360011665393\" target=\"_blank\" rel=\"noopener\"\u003eAufnahme des eBlocker-Zertifikats\u003c/a\u003e \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWarum ist das eBlocker Zertifikat so wichtig?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eStellen Sie sich das eBlocker Zertifikat wie einen Schlüssel vor. Sobald Sie die HTTPS Funktion vom eBlocker aktivieren, öffnet der eBlocker die verschlüsselten HTTPS / SSL Datenpakete. Der eBlocker entfernt Datensammler sowie datensammelnde Werbung und verschlüsselt das nun unverschlüsselte Datenpaket ein erneutes Mal. Ihr Browser, oder die App, erwarten ein verschlüsseltes Datenpaket. Damit Ihr Browser, oder die App, die vom eBlocker verschlüsselten Datenpakete wieder öffnen kann, benötigen Sie den passenden Schlüssel (das eBlocker Zertifikat).\u003c/p\u003e\n\u003cp\u003eBeachten Sie bitte auch unsere \u003ca href=\"https://support.eblocker.com/hc/de/categories/360000227134-FAQs\" target=\"_blank\" rel=\"noopener\"\u003eFAQ‘s\u003c/a\u003e.\u003c/p\u003e"},{"id":360004553474,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360004553474-Wie-wird-der-eBlocker-angeschlossen-.json","html_url":"https://support.eblocker.com/hc/de/articles/360004553474-Wie-wird-der-eBlocker-angeschlossen-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":8,"vote_count":12,"section_id":360000516753,"created_at":"2018-05-20T16:16:49Z","updated_at":"2019-04-02T13:23:46Z","name":"Wie wird der eBlocker angeschlossen?","title":"Wie wird der eBlocker angeschlossen?","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-04-02T13:22:54Z","user_segment_id":null,"permission_group_id":744634,"label_names":["license","lizenz","connect","anschließen","verpackung","aktivieren","activate","language","sprache"],"body":"\u003cp\u003eWenn Sie die eBlocker Verpackung vor sich stehen haben, öffnen Sie bitte erst das Siegel der Verpackung mit einem scharfen Gegenstand. Öffnen Sie nun die Verpackung und nehmen Sie den Lieferumfang aus dem Karton heraus.\u003c/p\u003e\n\u003cp\u003eSie sollten folgenden Lieferumfang ausgepackt haben:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDen eBlocker\u003c/li\u003e\n\u003cli\u003eEine Kurzanleitung\u003c/li\u003e\n\u003cli\u003eDie Lizenzkarte\u003c/li\u003e\n\u003cli\u003eEin Satz eBlocker Aufkleber\u003c/li\u003e\n\u003cli\u003eEin oranges LAN Kabel\u003c/li\u003e\n\u003cli\u003eEin Karton mit dem Netzteil\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eVerbinden Sie das orange LAN Kabel zunächst mit Ihrem Router und anschließend mit dem eBlocker. Wenn Sie ein „Klick“ während des Anschließens hören, ist das Kabel ordnungsgemäß zwischen Router und eBlocker verbunden.\u003c/p\u003e\n\u003cp\u003eTipp:\u003cbr\u003eWenn Sie den eBlocker mit Ihrem Router verbinden, dann meiden Sie den LAN Port Nummer 4 an Ihrem Router. Der LAN Port Nummer 4 könnte bei Ihrem Router gegebenenfalls als LAN-Gastzugang eingerichtet sein. Der eBlocker kann in dem Fall nicht an diesem LAN Port für Ihr Netzwerk aktiviert werden. Entfernen Sie ausserdem zunächst alle WLAN Repeater aus dem Netzwerk, im Idealfall sollte jedes Ihrer Endgeräte zunächst mindestens einmal ohne Repeater und ohne Powerlines über den eBlocker in das Internet gelangen.\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006172613/01.png\" alt=\"01.png\"\u003e  \u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006172633/02.png\" alt=\"02.png\"\u003e\u003c/p\u003e\n\u003cp\u003ePacken Sie nun das Netzteil aus und suchen Sie den passenden Aufsatz für Ihr Land heraus. Schieben Sie den Aufsatz auf das Netzteil, bis Sie ein „Klick“ hören.\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006172713/03.png\" alt=\"03.png\"\u003e\u003c/p\u003e\n\u003cp\u003eNun verbinden Sie das Netzteil mit dem eBlocker und nach wenigen Sekunden beginnen die beiden LEDs am LAN Port des eBlockers zu leuchten, oder zu blinken. Der eBlocker startet nun sein Betriebssystem und benötigt dazu ca. 5 Minuten.\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006175973/blink.gif\" alt=\"blink.gif\"\u003e\u003c/p\u003e\n\u003cp\u003eZur reibungslosen Einrichtung des eBlockers empfehlen wir einen Computer zu verwenden, der direkt per LAN-Kabel mit Ihrem Netzwerk verbunden ist. Nach ca. 5 Minuten starten Sie Ihren Internet Browser und rufen die Webseite eblocker.box auf. Sie sehen nun das sogenannte eBlocker Dashboard. Sie sehen auf dem Dashboard eine Karte mit dem Namen \"Settings\". Klicken Sie hier auf \"Activate\", um Ihren eBlocker zu aktivieren. Alternativ können Sie auf der Karte auch den Link \"Go to settings\" anklicken.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360011536353/dashboard-EN.png\" alt=\"dashboard-EN.png\"\u003e\u003c/p\u003e\n\u003cp\u003eSie können alternativ auch im Browser setup.eblocker.com aufrufen. Sie sehen dann die Welcome Seite. Klicken Sie hier auf \"Activate license\", um Ihren eBlocker zu aktivieren. Alternativ können Sie hier auch auf den Link \"Settings\" anklicken.\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360013106014/welcome.png\" alt=\"welcome.png\"\u003e\u003c/p\u003e\n\u003cp\u003eDer Aktivierungsassistent wird Sie nun durch die Aktivierung begleiten. Stellen Sie nun die Sprache auf Deutsch um und klicken auf \"Weiter\".\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360019364793/01_einricht_de.png\" alt=\"01_einricht_de.png\"\u003eAkzeptieren Sie die Lizenzbestimmungen und klicken auf \"Weiter\".\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360019364833/02_einricht_de.png\" alt=\"02_einricht_de.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWählen Sie nun Ihre Zeitzone aus, in welcher Sie leben und klicken auf \"Weiter\".\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360019364773/03_einricht_de.png\" alt=\"03_einricht_de.png\"\u003eNun werden Sie nach der eBlocker Seriennummer fragen, welche Sie auf dem Boden des eBlockers finden. Vergeben Sie dann dem eBlocker einen Namen und klicken auf \"Weiter\".\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360018648734/04_einricht_de.png\" alt=\"04_einricht_de.png\"\u003eGeben Sie anschließend den Lizenzschlüssel und Ihre Mailadresse an, mit der Sie die eBlocker Lizenz aktivieren möchten und klicken auf \"Weiter\".\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360019364853/05_einricht_de.png\" alt=\"05_einricht_de.png\"\u003e\u003c/p\u003e\n\u003cp\u003eDer eBlocker bestätigt die erfolgreiche Aktivierung und wird im Anschluss automatisch nach einem Update suchen. Sollte ein Update auf eine neue eBlockerOS Version vorliegen wird dieses Heruntergeladen und automatisch eingespielt. Ein Update kann bis zu 10 Minuten dauern. Bitte warten Sie bis der eBlocker das Update eingespielt hat.\u003c/p\u003e\n\u003cp\u003eÄltere eBlocker Versionen, fragen nach der erfolgreichen Aktivierung nicht automatisch nach einem Update. Gehen Sie in die eBlocker Einstellungen \u0026gt; Menü Allgemein \u0026gt; Reiter Aktualisierung und führen Sie ein manuelles Update aus. Falls Sie keinen Update Button sehen, sind automatische Updates schon aktiviert. Klicken Sie auf den Regler, um die automatischen Updates zu deaktivieren.\u003c/p\u003e\n\u003cp\u003eHerzlichen Glückwunsch, Sie haben Ihren eBlocker nun angeschlossen und aktiviert. Starten Sie nun einmal alle aktiven Geräte in Ihrem Netzwerk neu, oder trennen bei den aktiven Geräten für ein paar Sekunden die LAN oder WLAN Verbindung.\u003c/p\u003e\n\u003cp\u003eGut zu wissen:\u003cbr\u003eNach der Aktivierung sind Ihre Geräte durch die Domain Blocker des eBlockers geschützt. Der eBlocker verhindert nun automatisch, dass Daten sammelnde Cookies oder andere Elemente, durch die Sie identifizierbar sind, auf Ihren Browser gelangen. Ohne den eBlocker hat Ihr Browser jedoch wahrscheinlich bereits zahlreiche Tracking-Cookies der unterschiedlichsten Anbieter gesammelt. Wir empfehlen daher, zuerst alle Cookies zu löschen, damit diese Tracker „Ihre Spur verlieren“.\u003c/p\u003e"},{"id":360004396834,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360004396834-Ist-mein-Router-kompatibel-mit-dem-eBlocker-.json","html_url":"https://support.eblocker.com/hc/de/articles/360004396834-Ist-mein-Router-kompatibel-mit-dem-eBlocker-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":2,"vote_count":10,"section_id":360000956174,"created_at":"2018-05-17T07:58:42Z","updated_at":"2019-05-03T17:52:36Z","name":"Ist mein Router kompatibel mit dem eBlocker?","title":"Ist mein Router kompatibel mit dem eBlocker?","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-05-17T08:00:50Z","user_segment_id":null,"permission_group_id":744634,"label_names":["router","kompatibel","compatible"],"body":"\u003cp\u003eDer eBlocker ist mit den meisten Routern und sonstigen Netzwerkgeräten kompatibel. Er kann durch einfaches Verbinden mit einem LAN-Kabel im Heimnetz integriert werden.\u003c/p\u003e\n\u003cp\u003eWir haben eine Geräteliste mit den dazugehörigen Kompatibilitätsinformationen für Sie zusammengefasst. Die Kompatibilitätsliste finden Sie \u003ca href=\"https://www.eblocker.com/de/kompatibilitaetsinformationen-hardware/\" target=\"_blank\" rel=\"noopener\"\u003ehier\u003c/a\u003e.\u003c/p\u003e"},{"id":360002342854,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002342854-Das-eBlocker-Zertifikat-in-Windows-hinterlegen-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002342854-Das-eBlocker-Zertifikat-in-Windows-hinterlegen-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":8,"vote_count":14,"section_id":360000522774,"created_at":"2018-03-24T22:22:41Z","updated_at":"2019-04-06T16:58:49Z","name":"Das eBlocker Zertifikat in Windows hinterlegen.","title":"Das eBlocker Zertifikat in Windows hinterlegen.","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-02-06T20:48:49Z","user_segment_id":null,"permission_group_id":744634,"label_names":["windows","ssl","https","zertifikate","certificate"],"body":"\u003cdiv class=\"article-separator\"\u003eMit nur wenigen Schritten haben Sie das Zertifikat hinterlegt. Benutzen Sie bitte den Microsoft Edge Browser, oder den Microsoft Internet Explorer.\u003c/div\u003e\n\u003cdiv class=\"article-separator\"\u003e\n\u003cbr\u003eÖffnen Sie die eBlocker HTTPS Konfigurationsseite, oder das eBlocker Dashboard.\u003c/div\u003e\n\u003cdiv class=\"article-separator\"\u003e\n\u003cbr\u003eKlicken Sie in auf der HTTPS Konfigurationsseite auf den Button \u003cstrong\u003eHTTPS ASSISTENT STARTEN\u003c/strong\u003e, oder in dem eBlocker Dashboard in der HTTPS Karte auf den Link \u003cstrong\u003eHTTPS ASSISTENT STARTEN\u003c/strong\u003e.\u003c/div\u003e\n\u003cdiv class=\"article-separator\"\u003e\n\u003cbr\u003eDer Assistent wird Ihnen Schritt für Schritt aufzeigen, wie Sie das eBlocker Zertifikat in Windows hinterlegen.\u003c/div\u003e\n\u003cdiv class=\"article-separator\"\u003e\n\u003cbr\u003eAlternativ können Sie das eBlocker Zertifikat auch ohne den Assistenten hinterlegen.\u003c/div\u003e\n\u003cul\u003e\n\u003cli class=\"article-separator\"\u003eKlicken Sie auf der HTTPS Konfigurationsseite auf den Reiter \u003cstrong\u003eZERTIFIKAT\u003c/strong\u003e und dann auf den Button \u003cstrong\u003eHERUNTERLADEN\u003c/strong\u003e. Gegebenenfalls kann man das Zertifikat auch mit einem Rechtsklick auf den Button und dann \"Speichern unter\" herunterladen.\u003c/li\u003e\n\u003cli class=\"article-separator\"\u003eKlicken Sie in dem erscheinenden Dialog erst auf \u003cstrong\u003eSpeichern\u003c/strong\u003e und danach auf \u003cstrong\u003eÖffnen\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cdiv class=\"article-content\"\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cstrong\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360011479633/win01-DE.png\" alt=\"win01-DE.png\"\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGegebenenfalls sehen Sie eine Sicherheitswarnung von Windows. Klicken Sie dort dann bitte auf \u003cstrong\u003eÖffnen\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eKlicken Sie in dem erscheinenden Fenster auf \u003cstrong\u003eZertifikat installieren.\u003c/strong\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cstrong\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002680914/win-de02.png\" alt=\"win-de02.png\"\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEs öffnet sich der \u003cstrong\u003eZertifikatimport-Assistent\u003c/strong\u003e.\u003cbr\u003e \u003cbr\u003eHier haben Sie folgende Auswahl:\u003cbr\u003e\u003cstrong\u003eAktuelle Benutzer\u003cbr\u003e\u003c/strong\u003e\u003cstrong\u003eLokaler Computer\u003cbr\u003e\u003cbr\u003e\u003c/strong\u003eDer \"Aktuelle Benutzer\" ist Ihr Windows-Benutzer. Mit der Otion \"Lokaler Computer\" hinterlegen Sie das eBlocker Zertifikat für alle Benutzer, welche sich bei diesem Windows-Rechner anmelden können.\u003cbr\u003e \u003c/li\u003e\n\u003cli\u003eBitte bestätigen Sie Ihre Auswahl mit \u003cstrong\u003eWeiter\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002683213/win-de03.png\" alt=\"win-de03.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli class=\"wysiwyg-text-align-left\"\u003eKlicken Sie jetzt auf \u003cstrong\u003eAlle Zertifikate in folgendem Speicher speichern\u003c/strong\u003e und klicken Sie anschließend auf \u003cstrong\u003eDurchsuchen\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360019250193/certman-win-browse-de.png\" alt=\"certman-win-browse-de.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWählen Sie jetzt den zweiten Eintrag \u003cstrong\u003eVertrauenswürdige Stammzertifizierungsstelle\u003c/strong\u003e aus und bestätigen Sie den Vorgang mit \u003cstrong\u003eOK\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002683233/win-de04.png\" alt=\"win-de04.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIm \u003cstrong\u003eZertifikatimport-Assistent\u003c/strong\u003e klicken Sie auf \u003cstrong\u003eWeiter\u003c/strong\u003e und anschließend auf \u003cstrong\u003eFertig stellen\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002680974/win-de05.png\" alt=\"win-de05.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBestätigen Sie die folgende Sicherheitswarnung mit \u003cstrong\u003eJa\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDas eBlocker-Zertifikat ist nun in Windows hinterlegt. Die meisten Browser und Programme können jetzt auf das eBlocker-Zertifikat zugreifen.\u003c/p\u003e\n\u003cp\u003eHier eine Auswahl an gängigen Browsern, mit denen Sie die eBlocker Controlbar nun auf HTTPS-Seiten sehen können.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMicrosoft Internet Explorer\u003c/li\u003e\n\u003cli\u003eMicrosoft Edge\u003c/li\u003e\n\u003cli\u003eGoogle Chrome\u003c/li\u003e\n\u003cli\u003eOpera\u003c/li\u003e\n\u003cli\u003eVivaldi\u003c/li\u003e\n\u003cli\u003eYandex\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFür folgende Browser und Programme muss das eBlocker-Zertifikat in dem betreffenden, eigenen Zertifikatsspeicher hinterlegt werden.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFirefox\u003c/li\u003e\n\u003cli\u003eCliqz (basiert auf Firefox)\u003c/li\u003e\n\u003cli\u003eSeamonkey\u003c/li\u003e\n\u003cli\u003eThunderbird (E-Mail Programm)\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e"},{"id":360002342634,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002342634-DHCP-Server-Es-kann-nur-einen-geben-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002342634-DHCP-Server-Es-kann-nur-einen-geben-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":2,"vote_count":4,"section_id":360000515213,"created_at":"2018-03-24T21:45:57Z","updated_at":"2019-01-21T13:49:47Z","name":"DHCP Server - Es kann nur einen geben!","title":"DHCP Server - Es kann nur einen geben!","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-04-03T08:36:20Z","user_segment_id":null,"permission_group_id":744634,"label_names":["dhcp","server","netzwerk","network"],"body":"\u003cp\u003eWenn Sie den DHCP Server des eBlockers aktivieren, denken Sie bitte daran auch den DHCP Server Ihres Routers zu deaktivieren.\u003c/p\u003e\n\u003cp\u003eEs kann nur einen DHCP Server im Netzwerk geben.\u003c/p\u003e\n\u003cp\u003eWenn Sie den DHCP Server des eBlocker deaktivieren, denken Sie bitte daran, dass Sie vorher den DHCP Server Ihres Routers wieder aktivieren.\u003c/p\u003e\n\u003cp\u003eBeim Wechsel des DHCP Servers müssen immer alle Geräte im Netzwerk einmal vom Netzwerk getrennt und wieder verbunden werden. Entweder trennen Sie einmal kurz das Netzwerkkabel, deaktivieren ein mal kurz das WLAN, oder starten das Gerät einmal neu.\u003c/p\u003e"},{"id":360002342073,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002342073-Eine-App-funktioniert-nicht-Verbindungsfehler-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002342073-Eine-App-funktioniert-nicht-Verbindungsfehler-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":1,"vote_sum":-4,"vote_count":8,"section_id":360000515253,"created_at":"2018-03-24T17:22:16Z","updated_at":"2019-02-15T19:14:35Z","name":"Eine App funktioniert nicht (Verbindungsfehler).","title":"Eine App funktioniert nicht (Verbindungsfehler).","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-11-07T08:15:16Z","user_segment_id":null,"permission_group_id":744634,"label_names":["app","error","ssl","https","fehler","ausnahme","exception","verbindungsfehler"],"body":"\u003cp\u003eSehen Sie als erstes in dem eBlocker Einstellungen \u0026gt; Menü „Geräte“ nach, ob Sie bei den Geräten die „Blocker“ Einstellung auf „Automatisch“ gesetzt haben. Klicken das erste Gerät in der Liste an und in dessen Einstellungen sehen Sie unten den Reiter „Blocker“. Stellen Sie hier die Einstellung bitte auf „Automatisch“. Bei Geräten für die der eBlocker deaktiviert wurde können und brauchen Sie diese Einstellung nicht vornehmen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360017670694/app-de01.png\" alt=\"app-de01.png\"\u003e\u003c/p\u003e\n\u003cp\u003eRechts oben finden Sie eine Navigationshilfe, mit der Sie bequem zum nächsten Gerät springen können.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360017670674/app-de02.png\" alt=\"app-de02.png\"\u003e\u003c/p\u003e\n\u003cp\u003eKontrollieren Sie bei jedem Gerät einmal die „Blocker“ Einstellung und gegebenenfalls ändern die die Einstellung auf „Automatisch“.\u003c/p\u003e\n\u003cp\u003eDamit verhindert man Probleme die entstehen können, wenn sich die Pattern Blocker und die Domain Blocker in die Quere kommen.\u003c/p\u003e\n\u003cp\u003ePattern Blocker – Benötigen die aktivierte eBlocker HTTPS Funktion und das hinterlegte eBlocker Zertifikat.\u003cbr\u003eDomain Blocker – Benötigen nicht die Aktivierung der eBlocker HTTPS Funktion.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAktivierte eBlocker HTTPS Funktion\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eApps können HTTPS Verbindungen aufbauen, um bestimmte Services zu erreichen. Sie können mit dem eBlocker nachsehen, welche Verbindungen von Apps aufgebaut werden und für diese dann eine Ausnahmeregel anlegen. Die Ausnahmeregel wird unter eBlocker Einstellungen \u0026gt; Menü „HTTPS“ \u0026gt; „Vertrauenswürdige Apps“ gespeichert.\u003c/p\u003e\n\u003cp\u003eZur Auffindung der unterdrückten Verbindungen gibt es zwei Möglichkeiten.\u003c/p\u003e\n\u003cp\u003eEntweder sehen Sie schon in dem „HTTPS“ Menü des eBlocker in dem Reiter „HTTPS/SSL Verbindugsfehler“ das eine Verbindung unterdrückt wurde, oder Sie benutzen die „Manuelle Diagnose“ Funktion des eBlockers. Diese finden Sie in den eBlocker Einstellungen \u0026gt; Menü „HTTPS“ \u0026gt; Reiter „Manuelle Diagnose“.\u003c/p\u003e\n\u003cp\u003eEine Anleitung zu der Funktion „Manuelle Diagnose“ finden Sie hier: \u003ca href=\"https://support.eblocker.com/hc/de/articles/360004553714-eBlocker-manuelle-Diagnose\" target=\"_blank\" rel=\"noopener\"\u003eeBlocker manuelle Diagnose\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWenn eine App trotz aktivierter Ausnahmeregel immer noch Probleme mit dem kontaktieren eines Server hat, testen Sie bitte ob die „Domain“ Blocker in diesem Fall helfen. Gehen Sie in diesem Fall wie folgt vor:\u003c/p\u003e\n\u003cp\u003eIn den eBlocker Einstellungen \u0026gt; Menü „Geräte“ \u0026gt; stellen Sie bei dem betreffendem Geräte in dem Reiter „Blocker“ die Blocker auf „Automatisch“ stellen und deaktivieren Sie in dem Reiter „HTTPS“ die HTTPS Funktion für dieses Gerät.\u003c/p\u003e"}],"sort_by":"position","sort_order":"asc"}