{"count":195,"next_page":"https://eblocker.zendesk.com/api/v2/help_center/de/articles.json?page=5\u0026per_page=30","page":4,"page_count":7,"per_page":30,"previous_page":"https://eblocker.zendesk.com/api/v2/help_center/de/articles.json?page=3\u0026per_page=30","articles":[{"id":360017302293,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360017302293-eBlocker-Mobile.json","html_url":"https://support.eblocker.com/hc/de/articles/360017302293-eBlocker-Mobile","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":4,"vote_sum":0,"vote_count":0,"section_id":360003201954,"created_at":"2019-02-06T09:53:34Z","updated_at":"2019-02-19T15:53:35Z","name":"eBlocker Mobile","title":"eBlocker Mobile","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-02-19T14:59:55Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cspan class=\"wysiwyg-color-green120\"\u003eeBlocker Base ✓ / eBlocker Pro ✓ / eBlocker Family ✓\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eMit der eBlocker Mobile Funktion schützen Sie ihre mobilen Geräte, wie Handys, Tablets und, Notebooks auch von unterwegs mit ihrem eigenen eBlocker. Um dies zu ermöglichen, müssen Sie den eBlocker mit wenigen Einstellungen am Router und dem jeweiligen Mobilgerät erreichbar machen.\u003c/p\u003e\n\u003cp\u003eSie sollten eine IPv4 Verbindung von Ihrem Internetprovider gestellt bekommen. eBlocker Mobile funktioniert nicht mit einer IPv6 Verbindung.\u003c/p\u003e\n\u003cp\u003eWenn Sie die eBlocker Mobile Funktion nutzen wollen, muss Ihr eBlocker direkt mit Ihrem Router verbunden sein.\u003c/p\u003e\n\u003cp\u003eVergeben Sie für den eBlocker eine feste IP-Adresse in Ihrem Netzwerk.\u003c/p\u003e\n\u003cp\u003eSehen Sie gegebenenfalls in Ihrem Router-Handbuch nach, wie man eine feste IP-Adresse für ein Gerät im Netzwerk vergeben kann.\u003c/p\u003e\n\u003cp\u003eFür die Nutzung von eBlocker Mobile muss die eBlocker DNS-Firewall aktiviert sein.\u003cbr\u003eZunächst müssen Sie von Ihrem Router zum eBlocker für den Port 1194 eine Portweiterleitung einrichten.\u003c/p\u003e\n\u003cp\u003e\u003ca target=\"_blank\" rel=\"noopener\"\u003eHier finden Sie eine Anleitung zur Portweiterleitung für verschiedene Router.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025197114/mob-de-01.png\" alt=\"mob-de-01.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025197094/mob-de-02.png\" alt=\"mob-de-02.png\"\u003e\u003c/p\u003e\n\u003cp\u003eAktivieren Sie den Schalter, oder klicken Sie auf der Seite auf den Button Einstellungen ändern, um den Assistenten für die Einrichtung zu aktivieren. Der Assistent wird Sie bei der Einrichtung von eBlocker Mobile begleiten.\u003c/p\u003e\n\u003cp\u003eDer eBlocker Mobile Assistent wird bei Einrichtung einige Fragen stellen.\u003c/p\u003e\n\u003cp\u003eSo können Sie angeben, ob Sie eine feste IPv4 Adresse von Ihrem Internet Anbieter zugewiesen bekommen haben, einen Dynamic DNS Anbieter (DynDNS) benutzten, oder den kostenlosen eBlocker Dynamic DNS Service benutzen möchten.\u003c/p\u003e\n\u003cp\u003eEinige Router lassen das Einrichten einer Portweiterleitung automatisch zu. Der eBlocker Mobile Assistent unterstützt diese Funktion, aber um sicher zu gehen, kann man die Portweiterleitung für den Port 1194 vom Router zum eBlocker selber einrichten.\u003c/p\u003e\n\u003cp\u003eZum Abschluss kann man den Assistenten die Verbindung testen lassen und im Anschluss kann man den eBlocker Mobile Server starten.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025197054/mob-de-03.png\" alt=\"mob-de-03.png\"\u003e\u003c/p\u003e\n\u003cp\u003eUm auf den mobilen Geräten nun die eBlocker Mobile Funktion nutzen zu können, muss eine OpenVPN App installiert werden und die eBlocker OpenVPN Konfiguration in dieser App importiert werden.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://support.eblocker.com/hc/de/articles/360008030973\" target=\"_blank\" rel=\"noopener\"\u003eHier finden Sie eine Auflistung von den OpenVPN Apps.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://support.eblocker.com/hc/de/articles/360009066253\" target=\"_blank\" rel=\"noopener\"\u003eEin praktisches Beispiel für die Einrichtung der eBlocker Mobile Funktion und das Hinterlegen der eBlocker OpenVPN Konfiguration finden Sie hier.\u003c/a\u003e\u003c/p\u003e"},{"id":360006216733,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360006216733-Ich-kann-weder-Surfen-noch-Mails-abrufen-.json","html_url":"https://support.eblocker.com/hc/de/articles/360006216733-Ich-kann-weder-Surfen-noch-Mails-abrufen-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":4,"vote_sum":-5,"vote_count":7,"section_id":360000522734,"created_at":"2018-06-22T14:24:56Z","updated_at":"2019-01-21T13:49:04Z","name":"Ich kann weder Surfen noch Mails abrufen.","title":"Ich kann weder Surfen noch Mails abrufen.","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-09-02T05:02:15Z","user_segment_id":null,"permission_group_id":744634,"label_names":["website","mail","surfen","can't access","web"],"body":"\u003cp\u003e\u003cstrong\u003eFür eBlocker Pro und Family Kunden.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSofern Sie die eBlocker HTTPS-Funktion aktiviert haben, überprüfen Sie bitte, ob das eBlocker Zertifikat richtig hinterlegt wurde.\u003c/p\u003e\n\u003cp\u003eIn den folgenden FAQs finden Sie nähere Informationen dazu: \u003ca href=\"https://support.eblocker.com/hc/de/sections/360000522774-SSL-Funktion-SSL-HTTPS-\" target=\"_blank\" rel=\"noopener\"\u003eHTTPS Funktion (SSL/HTTPS)\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eDeaktivieren Sie die Verbindung zum Tor-Netzwerk – sofern Sie diese aktiviert haben – und versuchen Sie erneut, Ihre Mails abzurufen bzw. Webseiten aufzurufen.\u003c/p\u003e\n\u003cp\u003eSehen Sie sich hierzu unsere FAQs zum Thema Tor-Netzwerk und den Eintrag in unserer Wissensdatenbank an.\u003c/p\u003e\n\u003cp\u003eFAQ: \u003ca href=\"https://support.eblocker.com/hc/de/sections/360000515233-Anon-Funktion-Tor-Netzwerk-\" target=\"_blank\" rel=\"noopener\"\u003eAnon Funktion (Tor-Netzwerk)\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWissensdatenbank: \u003ca href=\"https://support.eblocker.com/hc/de/articles/360004587353-Die-eBlocker-Tor-Netzwerk-Funktion\" target=\"_blank\" rel=\"noopener\"\u003eDie eBlocker Tor-Netzwerk Funktion \u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFür eBlocker Base Kunden.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDeaktivieren Sie die Verbindung zum Tor-Netzwerk – sofern Sie diese aktiviert haben – und versuchen Sie erneut, Ihre Mails abzurufen bzw. Webseiten aufzurufen.\u003c/p\u003e\n\u003cp\u003eSehen Sie sich hierzu bitte unsere FAQs zum Thema Tor-Netzwerk und den Eintrag in unserer Wissensdatenbank an.\u003c/p\u003e\n\u003cp\u003eFAQ: \u003ca href=\"https://support.eblocker.com/hc/de/sections/360000515233-Anon-Funktion-Tor-Netzwerk-\" target=\"_blank\" rel=\"noopener\"\u003eAnon Funktion (Tor-Netzwerk) \u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWissensdatenbank: \u003ca href=\"https://support.eblocker.com/hc/de/articles/360004587353-Die-eBlocker-Tor-Netzwerk-Funktion\" target=\"_blank\" rel=\"noopener\"\u003eDie eBlocker Tor-Netzwerk Funktion \u003c/a\u003e\u003c/p\u003e"},{"id":360006033194,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360006033194-Ich-sehe-das-eBlocker-Symbol-nicht-auf-allen-Seiten.json","html_url":"https://support.eblocker.com/hc/de/articles/360006033194-Ich-sehe-das-eBlocker-Symbol-nicht-auf-allen-Seiten","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":4,"vote_sum":-9,"vote_count":15,"section_id":360000516793,"created_at":"2018-06-20T12:26:37Z","updated_at":"2019-04-30T16:18:33Z","name":"Ich sehe das eBlocker Symbol nicht auf allen Seiten","title":"Ich sehe das eBlocker Symbol nicht auf allen Seiten","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-10-11T08:39:01Z","user_segment_id":null,"permission_group_id":744634,"label_names":["icon","websites","pages","seiten","webseiten"],"body":"\u003cp\u003eEs gibt zwei Gründe, warum Sie das eBlocker Symbol nicht auf allen Seiten sehen.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eDer eBlocker Base kann das eBlocker Symbol nicht anzeigen. Alle Funktionen Ihres eBlockers Base sind jedoch weiterhin aktiv; lediglich das Symbol fehlt.\u003c/li\u003e\n\u003cli\u003eWenn Sie einen eBlocker Pro oder Family besitzen, können Sie die SSL-Funktion nutzen. Hierfür hinterlegen Sie bitte das eBlocker Zertifikat und aktivieren SSL. Danach ist das eBlocker Symbol auch auf HTTPS-Seiten sichtbar.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eWird Ihnen das Symbol nicht angezeigt, können Sie jederzeit auf die Einstellungen Ihres eBlockers zugreifen, indem Sie in Ihrem Browser die Seite eblocker.box aufrufen.\u003c/p\u003e"},{"id":360004587293,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360004587293-eBlocker-Jugendschutz.json","html_url":"https://support.eblocker.com/hc/de/articles/360004587293-eBlocker-Jugendschutz","author_id":362837673554,"comments_disabled":true,"draft":false,"promoted":false,"position":4,"vote_sum":1,"vote_count":3,"section_id":360000516773,"created_at":"2018-05-20T16:50:53Z","updated_at":"2019-06-07T12:55:59Z","name":"eBlocker Jugendschutz","title":"eBlocker Jugendschutz","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-06-07T12:55:59Z","user_segment_id":null,"permission_group_id":744634,"label_names":["Jugendschutz","Parental Controls","Patental","Control"],"body":"\u003cp\u003eUm den Jugendschutz zu nutzen, muss ein Passwort für den eBlocker-Administrator festgelegt werden. Niemand außer dem Administrator kann auf die eBlocker-Einstellungen zugreifen und die Kindersicherung deaktivieren.\u003c/p\u003e\n\u003cp\u003eDas Administrator-Passwort können Sie unter \"eBlocker-Einstellungen \u0026gt; System\" auf der Registerkarte \"Admin-Passwort\" festlegen.\u003c/p\u003e\n\u003cp\u003eGehen Sie zum Menü \"eBlocker-Einstellungen \u0026gt; Jugendschutz\".\u003c/p\u003e\n\u003cp\u003eSeit eBlocker OS 2.3.2 werden alle Einschränkungen als Teil der Benutzerattribute festgelegt. Es gibt keine separaten Profileinstellungen mehr.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEinen Benutzer anlegen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEinstellungen \u0026gt; Jugendschutz \u0026gt; Benutzer\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360038212833/23pc-example-de00a.png\" alt=\"23pc-example-de00a.png\"\u003e\u003c/p\u003e\n\u003cp\u003eErstellen Sie zunächst einen neuen Benutzer, indem Sie auf die Schaltfläche Neuer Benutzer klicken. Geben Sie einen Namen ein und wählen Sie die Hauptrolle des neuen Benutzers aus. Wenn Sie ein Kind hinzufügen, werden Sie aufgefordert, seinen Geburtstag einzugeben. Daher werden standardmäßig altersgerechte Empfehlungen aktiviert. Nachdem der Dialog Neuer Benutzer durch Klicken auf Speichern geschlossen wurde, wird die Seite Benutzerdetails Einstellungen geöffnet.\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360037378154/23pc-example-de00b.png\" alt=\"23pc-example-de00b.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenutzerdetaileinstellungen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEinstellungen \u0026gt; Jugendschutz \u0026gt; Benutzer \u0026gt; Benutzerdetails\u003c/p\u003e\n\u003cp\u003eAlle mit dem Stift-Symbol markierten Details können durch Anklicken des Stiftes geändert werden.\u003c/p\u003e\n\u003cp\u003eIm ersten Abschnitt der Seite Benutzerdetails können Sie die grundlegenden Informationen über den Benutzer ändern. Sie können nun sowohl die grundlegenden Benutzerdaten wie Geburtsdatum, Rolle als auch eine optionale PIN mit bis zu 16 Ziffern für diesen Benutzer definieren. Wenn ein Gerät durch die eBlocker-Kindersicherung geschützt ist, muss diese PIN beim Wechsel des Benutzers eingegeben werden. Das Alter wird entsprechend dem eingegebenen Geburtstag angezeigt.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360037375754/23-pc-example-de01.png\" alt=\"23-pc-example-de01.png\"\u003e\u003c/p\u003e\n\u003cp\u003eOrdnen Sie ihnen alle Geräte zu, die auch von Kindern, Jugendlichen und Gästen verwendet werden, indem Sie auf die Schaltfläche Gerät hinzufügen klicken, um ein entsprechendes Dialogfenster zur Auswahl der Geräte zu öffnen. Mit Bearbeiten können Sie ein oder mehrere Geräte aus der Tabelle entfernen.\u003c/p\u003e\n\u003cp\u003eWählen Sie die Schaltfläche Gerät hinzufügen, um dem Benutzer, den Sie bearbeiten, ein Gerät zuzuordnen. Es erscheint ein entsprechendes Dialogfenster zur Auswahl des/der Geräte(s).\u003c/p\u003e\n\u003cp\u003eEs kann jeweils nur ein Benutzer einem Gerät zugeordnet werden. Ein Benutzer hingegen kann mehreren Geräten zugeordnet werden - z.B. allen Geräten eines Kindes. Das Gerät kann weiterhin von anderen genutzt werden, da sie mit ihrer PIN die Verantwortung übernehmen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360037375734/23-pc-example-de02.png\" alt=\"23-pc-example-de02.png\"\u003e\u003c/p\u003e\n\u003cp\u003eGeräte, die keinem Benutzer zugeordnet wurden, unterliegen nicht der Jugendschutzregelung. In diesen Fällen ist ein globaler Schutz möglich.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBlockieren von Websites bestimmter Kategorien\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUm nicht jede unerwünschte Website einzeln eingeben zu müssen, stellt Ihnen eBlocker Kategorien von Webseiten zur Verfügung. Kategorien können für jeden einzelnen Benutzer gesperrt werden.\u003c/p\u003e\n\u003cp\u003eUm nun bestimmte Kategorien für ein Profil auszuwählen, aktivieren Sie den Schiebeschalter \"Der Zugriff auf Websites ist nicht eingeschränkt\" und klicken Sie auf die zu blockierenden Kategorien.\u003c/p\u003e\n\u003cp\u003eWenn Sie mit der Maus über die Liste der Kategorien fahren, informiert Sie ein Tooltip über den Inhalt der Kategorien. Die einzelnen Kategorien werden nachts automatisch mit den regelmäßigen eBlocker-Updates aktualisiert.\u003c/p\u003e\n\u003cp\u003eSie können Kategorien als Ausnahmen definieren, z.B. für die fragFinn-Suchmaschine.\u003c/p\u003e\n\u003cp\u003eBitte beachten Sie, dass Sie diese Einstellungen speichern müssen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360038210613/23-pc-example-de03.png\" alt=\"23-pc-example-de03.png\"\u003e\u003c/p\u003e\n\u003cp\u003eAnrufe auf Websites und Verbindungsanrufe zu Apps, die diesen Einschränkungen unterliegen, werden nun von eBlocker auf allen diesem Profil zugeordneten Geräten gesperrt. Anstelle der gewünschten Website erscheint eine entsprechende Meldung im Browser.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eZugriffszeiten einstellen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWenn Sie möchten, dass Ihre Kinder sich etwas Zeit für echte Freunde, Hausaufgaben oder andere Aktivitäten frei halten, dann können Sie ihnen nur in bestimmten Zeitabständen einen Internetzugang gewähren. Aktivieren Sie einfach den zweiten Schiebeschalter, so dass die Zeiten begrenzt sind. Hier können Sie neue Zutrittszeitfenster hinzufügen oder mit dem Bleistift-Symbol ändern. Mit dem \"-\" wird der Eintrag sofort gelöscht. Bitte beachten Sie, dass Sie diese Einstellungen speichern müssen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360038210593/23-pc-example-de04.png\" alt=\"23-pc-example-de04.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWenn Sie Zeitlimits definieren, werden von den zugeordneten Geräten außerhalb der zulässigen Zeiten keine Internetverbindungen zugelassen. Der eBlocker zeigt dann eine entsprechende Meldung auf dem Gerät an.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360037377314/23-pc-example-blocked-de.png\" alt=\"23-pc-example-blocked-de.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAchtung\u003c/strong\u003e: Ist kein Zeitraum angegeben, ist ein Internetzugang jederzeit möglich.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAchtung\u003c/strong\u003e: Mit einem Klick auf den Button \"Konfiguration\" kann der eBlocker-Administrator auf die Einstellungen des eBlockers zugreifen.\u003c/p\u003e\n\u003cp\u003eDie Beschränkung des Internetzugangs gilt für alle Apps und Websites. Online-Spiele oder Anwendungen, die eine Verbindung zu einem Server erfordern, können möglicherweise nicht gestartet werden oder einen Fehler anzeigen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360038210573/23-pc-example-de05.png\" alt=\"23-pc-example-de05.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJugendschutz auf dem eBlocker Dashboard\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSobald ein Benutzer einem Gerät zugeordnet ist, erscheinen zwei neue Karten im eBlocker Dashboard.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360038210533/23-pc-example-de06.png\" alt=\"23-pc-example-de06.png\"\u003e\u003c/p\u003e\n\u003cp\u003eDie Karte \"Online Time\" dient dazu, definierte Zeiträume im Auge zu behalten und bei zeitlichen Einschränkungen die Nutzung des Internets zu starten und zu stoppen.\u003c/p\u003e\n\u003cp\u003eDie Karte \"Benutzer\" zeigt den aktuellen Benutzer des Gerätes an und ermöglicht es Eltern, z.B. ein Gerät zu übernehmen oder zu blockieren.\u003c/p\u003e\n\u003cp\u003eWenn die beiden Karten nicht sichtbar sind, können Sie jederzeit auf das Dashboard-Symbol in der rechten oberen Ecke des Dashboards klicken und die Karten auf dem Dashboard anzeigen.\u003c/p\u003e\n\u003cp\u003eDas Gerät hat auch eine eigene Controllbar, die sich leicht von der normalen Controllbar unterscheidet. Bei Geräten, die mit Kindersicherungsprofilen geschützt sind, ist es nicht mehr möglich, auf die eBlocker-Einstellungen zuzugreifen, den eBlocker für das Gerät anzuhalten oder die eBlocker-Hilfe aufzurufen. Stattdessen werden der Profilname und die zulässigen Zeiten für den Internetzugang angezeigt.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360038210493/23-pc-example-de07.png\" alt=\"23-pc-example-de07.png\"\u003e\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e"},{"id":360004586853,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360004586853-Die-eBlocker-Controlbar.json","html_url":"https://support.eblocker.com/hc/de/articles/360004586853-Die-eBlocker-Controlbar","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":4,"vote_sum":-1,"vote_count":5,"section_id":360000516753,"created_at":"2018-05-20T16:22:08Z","updated_at":"2019-04-10T05:27:53Z","name":"Die eBlocker Controlbar","title":"Die eBlocker Controlbar","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-02-07T14:55:49Z","user_segment_id":null,"permission_group_id":744634,"label_names":["base","pro","family","controlbar"],"body":"\u003cp class=\"wysiwyg-indent4\"\u003eAlle Funktionen der eBlocker Controlbar können Sie auch über das eBlocker Dashbaord ausführen. Das eBlocker Dashboard soll das eBlocker Icon und die eBlocker Controlbar früher oder später ablösen. Schon jetzt hat das eBlocker Dashboard mehr Funktionen als die eBlocker Controlbar.\u003cbr\u003e\u003cbr\u003eDas eBlocker Dashboard erreichen Sie im Browser, wenn Sie entweder \u003ca href=\"eblocker.box\" target=\"_blank\" rel=\"noopener\"\u003eeblocker.box\u003c/a\u003e, oder die IP-Adresse Ihres eBlockers und geben dahinter \u003cstrong\u003e/dashboard\u003c/strong\u003e ein (Beispiel: 192.168.10.210/dashboard).\u003c/p\u003e\n\u003cp\u003eUm die eBlocker Controlbar zu öffnen, klicken Sie auf das eBlocker Symbol.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006132454/01-02-de.png\" alt=\"01-02-de.png\"\u003e\u003c/p\u003e\n\u003cp\u003eÜber die Controlbar haben Sie schnellen Zugriff auf wichtige Funktionen zur aktuell geladenen Seite und den zahlreichen eBlocker Funktionen.\u003c/p\u003e\n\u003cp\u003eJe nach eBlocker Version, enthält die eBlocker Controlbar unterschiedliche Funktionen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Base\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006131374/de-7-2-base.png\" alt=\"de-7-2-base.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eÜbersicht - Bietet Ihnen einen schnellen Zugriff auf wichtige eBlocker Funktionen.\u003c/li\u003e\n\u003cli\u003eIP-Anon – Zugriff auf das Tor-Netzwerk und den VPN-Verbindungen.\u003c/li\u003e\n\u003cli\u003ePause – Pausiert den eBlocker und leitet Sie weiter zur Übersicht.\u003c/li\u003e\n\u003cli\u003eNachrichten – Wird angezeigt, wenn der eBlocker eine Nachricht für Sie hat.\u003c/li\u003e\n\u003cli\u003eEinstellungen – Leitet Sie zu den eBlocker Einstellungen weiter.\u003c/li\u003e\n\u003cli\u003eHilfe – Leitet Sie zur Online Hilfe weiter.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Pro\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006170713/de-7-2-pro.png\" alt=\"de-7-2-pro.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eÜbersicht - Bietet Ihnen einen schnellen Zugriff auf wichtige eBlocker Funktionen.\u003c/li\u003e\n\u003cli\u003eTracker – Zeigt die Anzahl der gefundenen Tracker an und bietet Zugriff auf Funktionen.\u003c/li\u003e\n\u003cli\u003eWerbung – Zeigt die Anzahl der gefundenen Werbung an und bietet Zugriff auf Funktionen.\u003c/li\u003e\n\u003cli\u003eIP-Anon – Zugriff auf das Tor-Netzwerk und den VPN-Verbindungen.\u003c/li\u003e\n\u003cli\u003eTarnung – Bietet Ihnen die Tarnung als ein anderes Gerät.\u003c/li\u003e\n\u003cli\u003ePause – Pausiert den eBlocker und leitet Sie dann weiter zur Übersicht.\u003c/li\u003e\n\u003cli\u003eEinstellungen – Leitet Sie zu den eBlocker Einstellungen weiter.\u003c/li\u003e\n\u003cli\u003eHilfe – Leitet Sie zur Online Hilfe weiter.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Family\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360006170673/de-7-2-family.png\" alt=\"de-7-2-family.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eÜbersicht - Bietet Ihnen schnellen Zugriff auf wichtige eBlocker Funktionen.\u003c/li\u003e\n\u003cli\u003eBenutzer – Zeigt an, welcher Benutzer aktiv ist.\u003c/li\u003e\n\u003cli\u003eTracker – Zeigt die Anzahl der gefundenen Tracker an und bietet Zugriff auf Funktionen.\u003c/li\u003e\n\u003cli\u003eWerbung – Zeigt die Anzahl der gefundenen Werbung an und bietet Zugriff auf Funktionen.\u003c/li\u003e\n\u003cli\u003eIP-Anon – Zugriff auf das Tor-Netzwerk und den VPN-Verbindungen.\u003c/li\u003e\n\u003cli\u003eTarnung – Bietet Ihnen die Tarnung als ein anderes Gerät.\u003c/li\u003e\n\u003cli\u003ePause – Pausiert den eBlocker und leitet Sie dann weiter zur Übersicht (nicht wenn der Jugendschutz aktiviert ist).\u003c/li\u003e\n\u003cli\u003eEinstellungen – Leitet Sie zu den eBlocker Einstellungen weiter (nicht wenn der Jugendschutz aktiviert ist).\u003c/li\u003e\n\u003cli\u003eHilfe – Leitet Sie zur Online Hilfe weiter.\u003c/li\u003e\n\u003cli\u003eOnline-Zeiten – Zeigt die verbleibende Online-Zeit an (nur wenn der Jugendschutz aktiviert ist).\u003c/li\u003e\n\u003c/ul\u003e"},{"id":360002344133,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002344133-Das-eBlocker-Zertifikat-in-iOS-hinterlegen-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002344133-Das-eBlocker-Zertifikat-in-iOS-hinterlegen-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":4,"vote_sum":15,"vote_count":15,"section_id":360000522774,"created_at":"2018-03-24T22:04:53Z","updated_at":"2019-05-28T08:15:42Z","name":"Das eBlocker Zertifikat in iOS hinterlegen.","title":"Das eBlocker Zertifikat in iOS hinterlegen.","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-04-04T08:48:54Z","user_segment_id":null,"permission_group_id":744634,"label_names":["ssl","https","zertifikate","certificate","iOS"],"body":"\u003cp\u003eMit nur wenigen Schritten haben Sie das Zertifikat hinterlegt. Benutzen Sie bitte den iOS Safari Browser.\u003cbr\u003eÖffnen Sie die eBlocker HTTPS Konfigurationsseite, oder das eBlocker Dashboard.\u003c/p\u003e\n\u003cp\u003eKlicken Sie in auf der HTTPS Konfigurationsseite auf den Button \u003cstrong\u003eHTTPS ASSISTENT STARTEN\u003c/strong\u003e, oder in dem eBlocker Dashboard in der HTTPS Karte auf den Link \u003cstrong\u003eHTTPS ASSISTENT STARTEN\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eDer Assistent wird Ihnen Schritt für Schritt aufzeigen, wie Sie das eBlocker Zertifikat in iOS hinterlegen.\u003c/p\u003e\n\u003cp\u003eAlternativ können Sie das eBlocker Zertifikat auch ohne den Assistenten hinterlegen.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKlicken Sie auf der HTTPS Konfigurationsseite auf den Reiter \u003cstrong\u003eZERTIFIKAT.\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eNun klicken Sie auf den Button \u003cstrong\u003eHERUNTERLADEN\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eiOS wird Sie fragen, ob diese Webseite ein Konfigurationsprofil laden darf. Klicken Sie in diesem Dialog auf \u003cstrong\u003eZULASSEN\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eÖffnen Sie nun die iOS-Einstellungen.\u003c/li\u003e\n\u003cli\u003eKlicken links auf das Menü \u003cstrong\u003eALLGEMEIN\u003c/strong\u003e  und auf der rechten Seite auf \u003cstrong\u003ePROFIL.\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eKlicken Sie das eBlocker Konfigurationsprofil an.\u003c/li\u003e\n\u003cli\u003eKlicken Sie nun auf \u003cstrong\u003e\"Installieren\"\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002682993/ios-de01.png\" alt=\"ios-de01.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIm nachfolgenden Dialog klicken Sie nochmals auf \u003cstrong\u003e\"Installieren\"\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002680694/ios-de02.png\" alt=\"ios-de02.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBestätigen das Hinterlegen des Zertifikats mit dem Button \u003cstrong\u003e\"Installieren\"\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002680714/ios-de03.png\" alt=\"ios-de03.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDas eBlocker-Zertifikat ist dann in iOS aufgenommen worden.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002683033/ios-de04.png\" alt=\"ios-de04.png\"\u003e\u003c/p\u003e\n\u003cp\u003eAb der iOS Version 10.3 muss das hinterlegte eBlocker-Zertifikat noch einmal aktiviert werden.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eÖffnen Sie die iOS Einstellungen und navigieren zu \u003cstrong\u003e\"Allgemein\" \u0026gt; \"Info\" \u0026gt; \"Zertifikatsvertrauenseinstellungen\"\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eDort finden Sie das zuvor hinterlegte eBlocker-Zertifikat und können es jetzt aktivieren.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002680734/ios-de05.png\" alt=\"ios-de05.png\"\u003e\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002683053/ios-de06.png\" alt=\"ios-de06.png\"\u003e\u003c/p\u003e"},{"id":360002344073,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002344073-Weder-Router-noch-eBlocker-als-DHCP-Server.json","html_url":"https://support.eblocker.com/hc/de/articles/360002344073-Weder-Router-noch-eBlocker-als-DHCP-Server","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":4,"vote_sum":2,"vote_count":2,"section_id":360000515213,"created_at":"2018-03-24T21:43:38Z","updated_at":"2018-12-17T12:21:55Z","name":"Weder Router noch eBlocker als DHCP Server","title":"Weder Router noch eBlocker als DHCP Server","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:43:54Z","user_segment_id":null,"permission_group_id":744634,"label_names":["dhcp","server"],"body":"\u003cp\u003eEs gibt auch die Möglichkeit, weder den DHCP Server vom Router, noch den DHCP Server vom eBlocker zu nutzen. Sie können auch einen anderen DHCP Server in Ihrem Netzwerk einbinden. So bieten zum Beispiel einige NAS Geräte eine zusätzliche DHCP Server Funktion an. Als weitere Option können Sie sich auch einen eigenen DHCP Server auf Basis eines Einplatinenrechners bauen.\u003c/p\u003e"},{"id":360024593114,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360024593114-Welche-Domains-sollte-man-immer-erlauben-.json","html_url":"https://support.eblocker.com/hc/de/articles/360024593114-Welche-Domains-sollte-man-immer-erlauben-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":0,"vote_count":0,"section_id":360004584253,"created_at":"2019-06-13T06:33:42Z","updated_at":"2019-06-13T07:45:36Z","name":"Welche Domains sollte man immer erlauben?","title":"Welche Domains sollte man immer erlauben?","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-06-13T06:33:42Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003eEs einige Domains, welche oft einmal auf Blockerlisten landen und Sie dann diese Domain im Browser nicht mehr aufrufen können, oder gegebenenfalls Apps nicht mehr funktionieren.\u003c/p\u003e\n\u003cp\u003eHier haben wir eine Auflistung von uns bekannten Domains, welche Sie gegebenenfalls in der eBlocker Dashboard Karte „Blocker“ aufnehmen können.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAmazon\u003c/strong\u003e\u003c/p\u003e\n\u003cpre\u003es3.amazonaws.com\u003cbr\u003efls-eu.amazon.com\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003eGoogle\u003c/strong\u003e\u003c/p\u003e\n\u003cpre\u003eclients2.google.com\u003cbr\u003eclients3.google.com\u003cbr\u003eclients4.google.com\u003cbr\u003eclients5.google.com\u003cbr\u003ephotos.google.com\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003eLink Shortner\u003c/strong\u003es\u003c/p\u003e\n\u003cpre\u003ewww.bit.ly\u003cbr\u003ebit.ly\u003cbr\u003eow.ly\u003cbr\u003ej.mp\u003cbr\u003egoo.gl\u003cbr\u003etinyurl.com\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003eMicrosoft \u003c/strong\u003e\u003c/p\u003e\n\u003cpre\u003emsftncsi.com\u003cbr\u003ewww.msftncsi.com\u003cbr\u003ewatson.telemetry.microsoft.com\u003cbr\u003ev10.events.data.microsoft.com\u003cbr\u003esettings-win.data.microsoft.com\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003eEA / Origin\u003c/strong\u003e\u003c/p\u003e\n\u003cpre\u003eea.com\u003cbr\u003ecdn.optimizely.com\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003eFacebook\u003c/strong\u003e\u003c/p\u003e\n\u003cpre\u003efacebook.com\u003cbr\u003eupload.facebook.com\u003cbr\u003estar.c10r.facebook.com\u003cbr\u003eres.cloudinary.com \u003cbr\u003e0-edge-chat.facebook.com\u003cbr\u003e1-edge-chat.facebook.com\u003cbr\u003e2-edge-chat.facebook.com\u003cbr\u003e3-edge-chat.facebook.com\u003cbr\u003e4-edge-chat.facebook.com\u003cbr\u003e5-edge-chat.facebook.com\u003cbr\u003e6-edge-chat.facebook.com\u003cbr\u003eb-api.facebook.com\u003cbr\u003eb-graph.facebook.com\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003ePinterest\u003c/strong\u003e\u003c/p\u003e\n\u003cpre\u003epinterest.com\u003cbr\u003eassets.pinterest.com\u003cbr\u003eapi.pinterest.com\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003eDiverse Domains\u003c/strong\u003e\u003c/p\u003e\n\u003cpre\u003egravatar.com\u003cbr\u003erover.ebay.com\u003cbr\u003eimgs.xkcd.com\u003cbr\u003enetflix.com\u003cbr\u003ealluremedia.com.au \u003cbr\u003eocsp.apple.com \u003cbr\u003ekeystone.mwbsys.com \u003cbr\u003edl.dropbox.com\u003cbr\u003eapi.ipify.org\u003cbr\u003eapi.pinterest.com\u003cbr\u003eitunes.apple.com\u003cbr\u003em.youtube.com\u003cbr\u003es.shopify.com\u003cbr\u003espclient.wg.spotify.com\u003cbr\u003et.kck.st\u003cbr\u003epbs.twimg.com\u003cbr\u003eraw.githubusercontent.com\u003cbr\u003evimeo.com\u003c/pre\u003e"},{"id":360024168534,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360024168534-Habe-ich-die-gleichen-Anspr%C3%BCche-als-wenn-ich-den-eBlocker-direkt-auf-der-eBlocker-Website-gekauft-h%C3%A4tte-.json","html_url":"https://support.eblocker.com/hc/de/articles/360024168534-Habe-ich-die-gleichen-Anspr%C3%BCche-als-wenn-ich-den-eBlocker-direkt-auf-der-eBlocker-Website-gekauft-h%C3%A4tte-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":0,"vote_count":0,"section_id":360004512333,"created_at":"2019-06-05T08:49:14Z","updated_at":"2019-06-17T09:35:35Z","name":"Habe ich die gleichen Ansprüche, als wenn ich den eBlocker direkt auf der eBlocker Website gekauft hätte?","title":"Habe ich die gleichen Ansprüche, als wenn ich den eBlocker direkt auf der eBlocker Website gekauft hätte?","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-06-05T08:49:14Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp class=\"western\" style=\"margin-bottom: 0in;\"\u003eBis auf die Rückgabemöglichkeiten gibt es keinen Unterschied.\u003c/p\u003e"},{"id":360017142554,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360017142554-Blocker.json","html_url":"https://support.eblocker.com/hc/de/articles/360017142554-Blocker","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":0,"vote_count":0,"section_id":360003201954,"created_at":"2019-02-06T09:52:40Z","updated_at":"2019-06-13T06:55:28Z","name":"Blocker","title":"Blocker","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-06-13T06:55:28Z","user_segment_id":null,"permission_group_id":744634,"label_names":["blocker"],"body":"\u003cp\u003e\u003cspan class=\"wysiwyg-color-green120\"\u003e\u003cspan class=\"wysiwyg-color-red120\"\u003eeBlocker Base ✕\u003c/span\u003e / eBlocker Pro ✓ / eBlocker Family ✓\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eDiese Seite ist weiter unterteilt in die folgenden Abschnitte:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eÜbersicht\u003c/li\u003e\n\u003cli\u003eErweiterte Einstellungen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025737813/blocker-00-de.png\" alt=\"blocker-00-de.png\"\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eÜbersicht\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eHier erhalten Sie eine Übersicht über die genutzten Blocker Funktionen des eBlocker. Wenn Sie mit der Maus über die einzelnen Symbole fahren, erhalten Sie weitere Informationen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360037770334/2-4-blocker-01-de.png\" alt=\"2-4-blocker-01-de.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eStatus\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFahren Sie mit der Maus über das Status Symbol und Sie bekommen eine kurze Information zu dem Filter und die Anzahl der Geräte, welche diesen Blocker benutzen.\u003c/p\u003e\n\u003cp\u003eSehen Sie hier hinter dem Status Symbol ein gelbes Dreieck, so ist das ein extra Hinweis zu dem Blocker. Wenn Sie mit der Maus über das gelbe Dreieck fahren, wird Ihnen der Hinweis angezeigt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBlocker\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier unterscheidet der eBlocker zwischen \u003cstrong\u003ePattern\u003c/strong\u003e und \u003cstrong\u003eDomain\u003c/strong\u003e \u003cstrong\u003eBlocker\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGeräte\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier sehen Sie eine Auflistung alle Geräte, welche diesen Blocker zurzeit nutzen. Wenn Sie mit der Maus über die Gräte fahren, wird eine Liste mit allen Geräten angezeigt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGeblockt\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier sehen Sie eine Auflistung aller blockierten Anfragen von allen Geräten seit dem Start Ihres eBlockers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWas sind Domain und Pattern Blocker?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie \u003cstrong\u003eDomain Blocker\u003c/strong\u003e für Werbung und Tracker blockieren schon beim Aufrufen der Domain, Werbungen und Tracker. Dieser Blocker kann auch ohne die Aktivierung der eBlocker HTTPS Funktion genutzt werden.\u003c/p\u003e\n\u003cp\u003eDie \u003cstrong\u003ePattern Blocker\u003c/strong\u003e für Werbung und Tracker erkennen anhand von Mustern die Tracker und Werbung. Für diese Blocker ist die Aktivierung von der eBlocker HTTPS Funktion notwendig.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHochladen von eigenen Listen.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSie haben hier die Möglichkeit auch eigene, beziehungsweise freie, Domain- und Pattern (Muster) Listen hoch zu laden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWichtig:\u003c/strong\u003e\u003cbr\u003eBeachten Sie beim Hochladen der Listen bitte deren Funktion. Nur wenn Sie zum Beispiel Domain Werbe Blocker Listen bei den Domain Werbe Blocker hochladen, so werden im Anschluss auch die richtigen Statistiken im eBlocker ausgewertet. Falls Sie nicht darauf achten, so werden gegebenenfalls bei den Domain Werbe Blocker die Tracker Blocker mitgezählt. \u003c/p\u003e\n\u003cp\u003eDer eBlocker erlaubt Ihnen das Hochladen von verschieden Listen-Formate:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e„Domain Liste“\u003c/strong\u003e \u003cbr\u003eDomain Listen sind Listen, welche ganz normale Domains enthalten.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eBeispiel\u003c/strong\u003e: domain.com\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003e„squid-acl Liste“\u003c/strong\u003e \u003cbr\u003eSquid-acl Listen sind vergleichbar mit den Domain Liste Listen.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eBeispiel\u003c/strong\u003e: domain.com\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003e„etc.hosts Liste“\u003c/strong\u003e \u003cbr\u003eEtc.host Listen sind Listen, die vor der Domain zum Beispiel eine IP-Adresse stehen haben. Dabei handelt es sich meist um die IP-Adresse des Localhost (127.0.0.1), oder auch um die IP-Adresse 0.0.0.0.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eBeispiel\u003c/strong\u003e: 127.0.0.1 domain.com\u003c/pre\u003e\n\u003cp\u003e\u003cstrong\u003e„easylist“\u003c/strong\u003e \u003cbr\u003eEasylist sind Listen im Format der bekannten Browser Erweiterungen wie zum Beispiel AdBlock.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eBeispiel\u003c/strong\u003e: @@/ad_file/*$image,domain=domain.de|domains.de\u003c/pre\u003e\n\u003cp\u003eFür die Domain, squid-acl und ect.hosts Liste gilt, dass das\u003cstrong\u003e #\u003c/strong\u003e Zeichen eine Bemerkung kennzeichnet, welche nicht vom eBlocker importiert wird.\u003c/p\u003e\n\u003cpre\u003e\u003cstrong\u003eBeispiel\u003c/strong\u003e: # Es folgen Domains\u003c/pre\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003e\u003cstrong\u003eHochladen von eigenen / freien Listen.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUm eine Liste hoch zu laden klicken Sie in der Übersicht der \u003cstrong\u003eDomain\u003c/strong\u003e oder \u003cstrong\u003ePattern\u003c/strong\u003e \u003cstrong\u003eBlocker\u003c/strong\u003e einen der drei Punkte (Werbe, Tracker, Malware \u0026amp; Phishing) an. \u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360038605953/2-4-blocker-02-de.png\" alt=\"2-4-blocker-02-de.png\"\u003e\u003c/p\u003e\n\u003cp\u003eAuf der folgenden Seite klicken Sie bitte auf den Button \u003cstrong\u003eHINZUFÜGEN\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eNun können Sie der Liste einen Namen vergeben, das Format der Liste auswählen (siehe oben), die URL (Webadresse) der Liste eingeben und können gegebenenfalls den Schalter für „tägliche Aktualisierung“ aktivieren.\u003c/p\u003e\n\u003cp\u003eNach einem Klick auf den Button \u003cstrong\u003eSPEICHERN\u003c/strong\u003e wird der eBlocker im Anschluss diese Liste erst herunterladen und dann importieren. Der Import einer Liste kann, je nach Länge der Liste, einige Sekunden benötigen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEin Beispiel für Sammlungen von Listen im Internet:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAuf der Seite \u003ca href=\"https://firebog.net/\" target=\"_blank\" rel=\"noopener\"\u003ehttps://firebog.net/\u003c/a\u003e finden Sie hauptsächlich \u003cstrong\u003eDomain\u003c/strong\u003e und \u003cstrong\u003eect.hosts\u003c/strong\u003e Listen. Achten Sie bei den Listen immer auf den Anfang. Finden Sie am Anfang eine IP-Adresse (127.0.0.1 oder auch 0.0.0.0), dann handelt es sich um eine \u003cstrong\u003eect.hosts\u003c/strong\u003e Liste.\u003c/p\u003e\n\u003cp\u003eAuf der Seite \u003ca href=\"https://filterlists.com/\" target=\"_blank\" rel=\"noopener\"\u003ehttps://filterlists.com/\u003c/a\u003e finden Sie eine Menge an Filterlisten. Hier können Sie zum Beispiel nach „\u003cstrong\u003eAdBlock\u003c/strong\u003e“ Listen suchen, welche Sie bei den eBlocker Pattern Blocker importieren können. Achten Sie darauf, dass Sie bei solchen Listen das Format „\u003cstrong\u003eeasylist\u003c/strong\u003e“ auswählen.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eErweiterte Funktionen\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eDie erweiterten Funktionen benötigen die Aktivierung der HTTPS Funktion.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024820174/blocker-02-de.png\" alt=\"blocker-02-de.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCaptive Portal Check\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGoogle Captive Portal Check wird von Google-Produkten wie Android, Chrome und Chromebooks benutzt um zu testen, ob eine Internet-Verbindung besteht. Dabei wird Ihre IP-Adresse zum Google Captive Portal gesendet. eBlocker blockiert den Aufbau zum Google Captive Portal, da sonst Ihre IP-Adresse von Google erfasst wird. Aktivieren Sie diese Option mit einem Klick, wenn Android-Geräte oftmals von Ihrem WLAN getrennt werden.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDo Not Track\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDo-Not-Track (DNT) ist ein HTTP-Header-Feld, welche einer Website signalisiert, dass der Besucher kein Nutzerprofil von der Website erstellt haben möchte. Leider ist dieser Wunsch des Benutzers unverbindlich und wird daher von sehr vielen Websites nicht beachtet.\u003c/p\u003e\n\u003cp\u003eBei den meisten Browsern ist diese Funktion in den Einstellungen zum Datenschutz oder zur Sicherheit zu finden.\u003c/p\u003e\n\u003cp\u003eDer eBlocker macht es Ihnen leichter und setzt nach Aktivierung der Funktion das Do-Not-Track Feld automatisch in allen Anfragen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHTTP Referrer Header\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHTTP Referrer Header werden automatisch erstellt, wenn Sie im Internet surfen. Der Referrer zeigt die Webseite an, die Sie besucht haben bevor Sie auf die aktuelle Webseite gelangt sind.\u003c/p\u003e\n\u003cp\u003eDurch Nutzung der Referrer-Header können Websites Ihre Surfgewohnheiten teilweise verfolgen. Einige Webseiten nutzen die Referrer-Header auch für interne Zwecke. Das Blockieren der Referrer-Header kann daher dazu führen, dass einige Seiten nicht mehr richtig angezeigt werden. Entscheiden Sie mit einem Klick, ob Referrer-Header zugelassen werden sollen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKompression\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWebserver komprimieren oftmals die ausgelieferten Webseiten, um die übertragene Datenmenge im Internet möglichst gering zu halten. Der eBlocker muss dann die Daten dekomprimieren, um die Seite analysieren und seine Schutzfunktionen ausführen zu können. In Ihrem lokalen Netzwerk würde sich durch eine erneute Kompression auf dem letzten Stück zum Gerät kein Geschwindigkeitsvorteil ergeben. Im Gegenteil: Der Seitenaufbau ist in der Regel sogar schneller, wenn für dieses letzte Stück auf eine erneute Kompression und Dekompression verzichtet wird.\u003c/p\u003e\n\u003cp\u003eNur wenn Ihr Gerät von unterwegs über eBlocker Mobile verbunden ist, sollte eine Kompression zum Gerät erfolgen.\u003c/p\u003e\n\u003cp\u003eDaher bietet die Kompressionsfunktion des eBlockers Ihnen drei Einstellungen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKeine Kompression\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier werden die Daten für den kurzen Weg zwischen eBlocker und Gerät nicht wieder komprimiert.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKompression für eBlocker Mobile Geräte (empfohlen)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAuch hier werden die Daten für den kurzen Weg zwischen eBlocker und Gerät nicht wieder komprimiert. Nur wenn Ihr Gerät sich von unterwegs über eBlocker Mobile verbindet, werden die Daten zwischen eBlocker und Gerät komprimiert.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eImmer komprimieren\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier werden die Daten beim Transport vom eBlocker zum Gerät grundsätzlich komprimiert.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWebRTC\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWebRTC ist eine Browser-Technologie, mit der Kommunikation zwischen zwei Parteien in Echtzeit ermöglicht wird. Sie wird beispielsweise für Internet-Telefonie und Chat verwendet.\u003c/p\u003e\n\u003cp\u003eLeider offenbart WebRTC Ihre echte IP-Adresse (und sogar Ihre lokale LAN-IP), um die Verbindungen herzustellen. Selbst bei der Verwendung von Tor (IP-Anonymisierung), können Sie so über Ihre echte IP-Adresse identifiziert werden, wenn WebRTC nicht blockiert wird. Entscheiden Sie mit einem Klick, ob WebRTC-Verbindungen zugelassen werden sollen.\u003c/p\u003e"},{"id":360016875134,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360016875134-Technische-Spezifikationen-und-Sicherheitshinweise.json","html_url":"https://support.eblocker.com/hc/de/articles/360016875134-Technische-Spezifikationen-und-Sicherheitshinweise","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":0,"vote_count":0,"section_id":360000516753,"created_at":"2019-02-05T05:45:00Z","updated_at":"2019-02-05T05:47:57Z","name":"Technische Spezifikationen und Sicherheitshinweise","title":"Technische Spezifikationen und Sicherheitshinweise","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-02-05T05:47:57Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e(nicht gültig für Software Lizenzen)\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e1 x 10/100/1000 LAN RJ45\u003c/li\u003e\n\u003cli\u003e1 x Stromversorgung 5V (≥ 2A)\u003c/li\u003e\n\u003cli\u003e1 x Wifi 802.11 b/g/n\u003c/li\u003e\n\u003cli\u003e2 x USB 2.0 (für Erweiterungen)\u003c/li\u003e\n\u003cli\u003e1 x HDMI (ohne Funktion)\u003c/li\u003e\n\u003cli\u003eEnergieverbrauch: \u0026lt;10W\u003c/li\u003e\n\u003cli\u003eAbmessungen: 9x9x9cm\u003c/li\u003e\n\u003cli\u003eGewicht: ca. 153g\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSicherheitshinweise\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBeachten Sie vor dem Anschluss Ihres eBlocker die folgenden Sicherheitshinweise, um den eBlocker vor Schäden zu bewahren.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDer eBlocker hat keinen Ein- oder Ausschalter. Eine Trennung des eBlockers vom Stromnetz sollte jederzeit möglich sein. Fahren dazu den eBlocker in den Einstellungen \u0026gt; Menü SYSTEM \u0026gt; Reiter NEUSTART herunter, in dem Sie auf den Button \"Ausschalten\" klicken.\u003c/li\u003e\n\u003cli\u003eStellen Sie vor der Wandmontage des eBlockers sicher, dass sich hinter den geplanten Bohrstellen keine Leitungen befinden.\u003c/li\u003e\n\u003cli\u003eSchützen Sie den eBlocker vor Nässe, Staub, Flüssigkeiten und Dämpfen.\u003c/li\u003e\n\u003cli\u003eVerdecken Sie nicht die Lüftungsschlitze des eBlockers.\u003c/li\u003e\n\u003cli\u003eUnterbrechen Sie niemals die Stromzufuhr oder Netzwerkverbindung während eines Updates. Dies kann den eBlocker irreparabel beschädigen.\u003c/li\u003e\n\u003c/ul\u003e"},{"id":360006032854,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360006032854-Kein-Internet-aber-der-eBlocker-ist-erreichbar.json","html_url":"https://support.eblocker.com/hc/de/articles/360006032854-Kein-Internet-aber-der-eBlocker-ist-erreichbar","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":-1,"vote_count":1,"section_id":360000516793,"created_at":"2018-06-20T12:21:16Z","updated_at":"2019-04-17T10:24:23Z","name":"Kein Internet, aber der eBlocker ist erreichbar","title":"Kein Internet, aber der eBlocker ist erreichbar","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-11-21T05:41:14Z","user_segment_id":null,"permission_group_id":744634,"label_names":["dns","router","no","kein","internet"],"body":"\u003cp\u003eIn seltenen Fällen kann es vorkommen, dass keine Verbindung zum Internet vorhanden ist. Der Grund dafür könnte ein Absturz einer essentiellen eBlocker Unterroutine sein, oder eine Einstellung bei der eBlocker DNS-Funktion.\u003c/p\u003e\n\u003cp\u003ePrüfen Sie in diesem Fall folgendes:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIst Ihr Router im Browser mit seiner IP-Adresse zu erreichen?\u003c/li\u003e\n\u003cli\u003eKönnen Sie die eBlocker Einstellungen im Browser aufrufen wenn Sie die IP-Adresse vom eBlocker eingeben (bei älteren eBlockerOS Versionen geben Sie bitte die eBlocker IP-Adresse und :3000 ein (Beispiel: 192.168.1.240:3000)?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWenn Sie beides mit \"ja\" beantworten können, gehen Sie bitte in die eBlocker Einstellungen \u0026gt; Menü \"System\" \u0026gt; Reiter \"Neustart und Herunterfahren\" und starten Sie den eBlocker neu (Button \"Neustart\").\u003c/p\u003e\n\u003cp\u003eIhr eBlocker wird erst herunterfahren und dann neu starten. Der Vorgang dauert ca. fünf Minuten. Nach dem Neustart sollten Sie wieder wie gewohnt das Internet nutzen können.\u003c/p\u003e\n\u003cp\u003eWenn der Vorgang nicht zum gewünschten Erfolg führt, gehen Sie bitte in die eBlocker Einstellungen \u0026gt; Menü \"IP-Anonymisierung\" \u0026gt; Reiter \"DNS\".\u003c/p\u003e\n\u003cp\u003eÜberprüfen Sie bitte folgendes:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIst die eBlocker DNS Funktion aktiviert?\u003c/li\u003e\n\u003cli\u003eNutzen Sie die Einstellungen \"Benutzerdefinierte Liste von externen DNS Servern\" und haben dort nur einen DNS Server (zum Beispiel Ihren Router) angegeben?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWenn Sie beides mit \"ja\" beantworten können, ändern Sie die eBlocker DNS bitte wie folgt:\u003c/p\u003e\n\u003cp\u003eWählen Sie entweder die Option \"Internet Provider\", welche den DNS-Server in Ihrem Netzwerk verwendet.\u003cbr\u003eOder nutzen Sie weiterhin die Option \"Externe DNS Servern\" und geben Sie dort mehr als einen DNS-Server an.\u003c/p\u003e\n\u003cp\u003eEine Liste von DNS-Server finden Sie zum Beispiel \u003ca href=\"https://www.eblocker.com/de/dns-server-liste/\" target=\"_blank\" rel=\"noopener\"\u003ehier\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eSollte dies öfter vorkommen, kontaktieren Sie bitte das eBlocker Support-Team und senden Sie den eBlocker Diagnosebericht mit. Diesen finden Sie in den eBlocker Einstellungen \u0026gt; Menü \"System\" \u0026gt; Reiter \"Diagnosebericht\". Der Bericht wird in Ihrem Downloadordner oder in dem von Ihnen bestimmten Ordner gespeichert.\u003c/p\u003e"},{"id":360004587233,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360004587233-eBlocker-DNS-Firewall.json","html_url":"https://support.eblocker.com/hc/de/articles/360004587233-eBlocker-DNS-Firewall","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":3,"vote_count":7,"section_id":360000516773,"created_at":"2018-05-20T16:48:10Z","updated_at":"2019-06-27T11:09:44Z","name":"eBlocker DNS Firewall","title":"eBlocker DNS Firewall","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-03-25T05:46:57Z","user_segment_id":null,"permission_group_id":744634,"label_names":["dns"],"body":"\u003cp\u003eWenn Sie diese Funktion aktivieren, können Sie die DNS Anfragen über Ihren eBlocker an eine Liste von verschiedenen DNS Servern verteilen, oder über des Tor-Netzwerk auflösen lassen. Ihnen stehen dafür drei verschiedene Optionen zur Verfügung.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eInternet Provider\u003c/li\u003e\n\u003cli\u003eTor-Netzwerk (DNS Auflösung erfolgt anonym)\u003c/li\u003e\n\u003cli\u003eExterne DNS-Server\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360011643894/dns-de.png\" alt=\"dns-de.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInternet Provider\u003cbr\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier wird die Einstellung Ihres lokalen Netzwerkes verwendet. Es wird der DNS Server verwendet, welcher in Ihrem Router eingetragen ist.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTor-Netzwerk (DNS Auflösung erfolgt anonym)\u003cbr\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier werden die DNS Anfragen durch das Tor-Netzwerk geleitet und am Ausgangspunkt des Tor-Netzwerkes erst an einem DNS Server übergeben.\u003c/p\u003e\n\u003cp\u003eDiese Funktion kann den Internetzugriff leicht verlangsamen. Dies gilt auch für Geräte, die sonst nicht Tor nutzen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExterne DNS-Server\u003cbr\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMit dieser Option können Sie eine Liste von DNS Servern hinterlegen. Diese Liste kann dann nach Verfügbarkeit, der Reihe nach, oder in zufälliger Reihenfolge vom eBlocker abgearbeitet werden.\u003c/p\u003e\n\u003cp\u003eEine kleine Anzahl von DNS Servern haben wir \u003ca href=\"https://www.eblocker.com/de/dns-server-liste/\" target=\"_blank\" rel=\"noopener\"\u003ehier\u003c/a\u003e für Sie aufgelistet.\u003c/p\u003e\n\u003cp\u003eWeitere öffentlich verfügbare DNS Server finden Sie im Internet. Geben Sie hierfür die Begriffe „Öffentliche Nameserver“, oder „Alternative DNS Server“ in die Suchmaschine ein.\u003c/p\u003e\n\u003cp\u003eBeachten Sie bitte auch unsere \u003ca href=\"http://user.forum.eblocker.com/knowledge-base/faqs\" target=\"_blank\" rel=\"noopener\"\u003eFAQ‘s\u003c/a\u003e.\u003c/p\u003e"},{"id":360004428013,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360004428013-Wieso-liefert-der-eBlocker-einen-umfassenderen-Schutz-als-andere-Tools-.json","html_url":"https://support.eblocker.com/hc/de/articles/360004428013-Wieso-liefert-der-eBlocker-einen-umfassenderen-Schutz-als-andere-Tools-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":7,"vote_count":7,"section_id":360000956174,"created_at":"2018-05-17T08:28:24Z","updated_at":"2019-04-16T19:49:00Z","name":"Wieso liefert der eBlocker einen umfassenderen Schutz als andere Tools?","title":"Wieso liefert der eBlocker einen umfassenderen Schutz als andere Tools?","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-05-17T08:28:55Z","user_segment_id":null,"permission_group_id":744634,"label_names":["protection","privacy","Schutz","Privatsphäre"],"body":"\u003cp\u003eHerkömmliche Tools fokussieren in der Regel nur auf einen kleinen, spezifischen Bereich. So gibt es z.B. für bestimmte PCs Browser-Plugins, die nur Tracker blockieren, und andere, die nur einen Teil der Online-Werbung ausblenden. Trotz mehrerer aktivierter Browser-Plugins ist es möglich, dass Sie von der aktuell besuchten Webseite über Ihre IP-Adresse getrackt werden. Der eBlocker blockt hingegen sämtliche Dienste, über die Nutzerprofile erstellt werden und lässt Sie anonym surfen. Aktivieren Sie mit einem Klick das sogenannte Tor-Netzwerk. Das Tor-Netzwerk verhindert, dass Sie anhand Ihrer IP-Adresse identifiziert werden können. Nur in dieser Kombination ist ein umfassender Schutz Ihrer Privatsphäre gegeben.\u003c/p\u003e"},{"id":360002343874,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002343874-%C3%96ffentliche-IP-hat-sich-ge%C3%A4ndert.json","html_url":"https://support.eblocker.com/hc/de/articles/360002343874-%C3%96ffentliche-IP-hat-sich-ge%C3%A4ndert","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":-3,"vote_count":3,"section_id":360000522814,"created_at":"2018-03-25T04:34:08Z","updated_at":"2018-12-23T13:41:04Z","name":"Öffentliche IP hat sich geändert","title":"Öffentliche IP hat sich geändert","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-09-05T12:31:48Z","user_segment_id":null,"permission_group_id":744634,"label_names":["ip","address","mobile","adresse","changed"],"body":"\u003cp\u003eWenn sich die öffentliche IP-Adresse Ihres Routers ändert und Sie keinen DynDNS Service nutzen, muss die eBlocker Mobile Funktion in dem Menü \"eBlocker Mobile\" zurückgesetzt werden. Danach können Sie die Einstellungen der eBlocker Mobile Funktion ändern und müssen die eBlocker Mobile Konfiguration bei jedem Gerät erneut in der OpenVPN App hinterlegen.\u003c/p\u003e"},{"id":360002342714,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002342714-Das-eBlocker-Zertifikat-in-Firefox-Cliqz-und-Seamonkey-hinterlegen-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002342714-Das-eBlocker-Zertifikat-in-Firefox-Cliqz-und-Seamonkey-hinterlegen-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":5,"vote_count":11,"section_id":360000522774,"created_at":"2018-03-24T21:58:21Z","updated_at":"2019-06-19T10:18:37Z","name":"Das eBlocker Zertifikat in Firefox, Cliqz und Seamonkey hinterlegen.","title":"Das eBlocker Zertifikat in Firefox, Cliqz und Seamonkey hinterlegen.","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-02-06T17:46:56Z","user_segment_id":null,"permission_group_id":744634,"label_names":["ssl","https","zertifikate","certificate","firefox","cliqz","seamonkey"],"body":"\u003cdiv class=\"article-separator\"\u003e\n\u003cp\u003eMit nur wenigen Schritten haben Sie das Zertifikat hinterlegt. Benutzen Sie bitte den Firefox, Cliqz, oder SeamonkeyBrowser.\u003c/p\u003e\n\u003cp\u003eÖffnen Sie die eBlocker HTTPS Konfigurationsseite, oder das eBlocker Dashboard.\u003c/p\u003e\n\u003cp\u003eKlicken Sie in auf der HTTPS Konfigurationsseite auf den Button \u003cstrong\u003eHTTPS ASSISTENT STARTEN\u003c/strong\u003e, oder in dem eBlocker Dashboard in der HTTPS Karte auf den Link \u003cstrong\u003eHTTPS ASSISTENT STARTEN\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eDer Assistent wird Ihnen Schritt für Schritt aufzeigen, wie Sie das eBlocker Zertifikat in Firefox, Cliqz, oder Seamonkey hinterlegen.\u003c/p\u003e\n\u003cp\u003eAlternativ können Sie das eBlocker Zertifikat auch ohne den Assistenten hinterlegen.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKlicken Sie auf der HTTPS Konfigurationsseite auf den Reiter \u003cstrong\u003eZERTIFIKAT\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eNun klicken Sie den Button \u003cstrong\u003eHERUNTERLADEN\u003c/strong\u003e. Gegebenenfalls kann man das Zertifikat auch mit einem Rechtsklick auf den Button und dann \"Speichern unter\" herunterladen.\u003c/li\u003e\n\u003cli class=\"article-separator-repeat\"\u003eStellen Sie sicher, dass die erste Checkbox \u003cstrong\u003e\"Dieser CA vertrauen, um Websites zu identifizieren\"\u003c/strong\u003e ausgewählt ist (siehe Bilddarstellung).\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\u003cdiv class=\"article-content\"\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360011432274/firefox-01-DE.png\" alt=\"firefox-01-DE.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKlicken Sie auf \u003cstrong\u003eOK\u003c/strong\u003e um das eBlocker-Zertifikat in Firefox aufzunehmen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSie sehen im Firefox, Cliqz, oder Seamonkey Browser nun die eBlocker Controlbar auf HTTPS-Seiten.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAchtung\u003c/strong\u003e: Diese Anleitung gilt auch für den Android Firefox Browser, aber \u003cstrong\u003enicht\u003c/strong\u003e für den iOS Firefox Browser.\u003c/p\u003e\n\u003c/div\u003e"},{"id":360002344033,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002344033-WLAN-Repeater-und-der-eBlocker.json","html_url":"https://support.eblocker.com/hc/de/articles/360002344033-WLAN-Repeater-und-der-eBlocker","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":10,"vote_count":10,"section_id":360000515213,"created_at":"2018-03-24T21:42:54Z","updated_at":"2019-05-31T21:51:30Z","name":"WLAN Repeater und der eBlocker","title":"WLAN Repeater und der eBlocker","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-27T08:34:00Z","user_segment_id":null,"permission_group_id":744634,"label_names":["repeater","WiFi","WLAN"],"body":"\u003cp\u003eWLAN Repeater werden häufig verwendet, um die Signalstärke und -reichweite in Privathaushalten und kleinen Büros zu verbessern. Viele WLAN Repeater arbeiten mit einem sogenannten Brücken-Modus. In diesem Modus können sich andere Geräte über den WLAN Repeater im Netzwerk anmelden. Für den Router, und damit auch für den eBlocker, ist jedoch jedes über den Repeater angeschlossene Gerät in der Regel mit der Hardware-Adresse (MAC-Adresse) des Repeaters zu sehen. Dadurch kann der eBlocker die Geräte, die über einen Repeater angeschlossen sind, nicht voneinander unterscheiden.\u003c/p\u003e\n\u003cp\u003eAb der eBlockerOS Version 1.14.8 kann der eBlocker nun Geräte, welche über einen WLAN Repeater angebunden sind, besser verwalten. Wichtig ist nur, dass sich diese Geräte vorher einmal direkt beim Router in das WLAN eingebucht haben, damit der eBlocker die MAC- und IP-Adresse des Gerätes eindeutig zuordnen kann.\u003c/p\u003e"},{"id":360002341433,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002341433-Der-eBlocker-reagiert-nicht-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002341433-Der-eBlocker-reagiert-nicht-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":5,"vote_sum":-42,"vote_count":42,"section_id":360000522734,"created_at":"2018-03-24T15:34:29Z","updated_at":"2019-06-25T14:39:44Z","name":"Der eBlocker reagiert nicht.","title":"Der eBlocker reagiert nicht.","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-26T08:15:36Z","user_segment_id":null,"permission_group_id":744634,"label_names":["respond","not","connection","reagiert","nicht","verbindung"],"body":"\u003cp\u003eÜberprüfen Sie die Verbindung zum Router. Der Stecker des Ethernet-Kabels klickt hörbar, wenn er in den Ethernet-Port gesteckt wird.\u003c/p\u003e\n\u003cp\u003eÜberprüfen Sie die Verbindung vom Netzteil.\u003c/p\u003e"},{"id":360024341193,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360024341193-Gilt-die-30-Tage-R%C3%BCckgabem%C3%B6glichkeit-noch-.json","html_url":"https://support.eblocker.com/hc/de/articles/360024341193-Gilt-die-30-Tage-R%C3%BCckgabem%C3%B6glichkeit-noch-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":6,"vote_sum":0,"vote_count":0,"section_id":360004512333,"created_at":"2019-06-05T08:49:51Z","updated_at":"2019-06-24T11:47:33Z","name":"Gilt die 30 Tage-Rückgabemöglichkeit noch? ","title":"Gilt die 30 Tage-Rückgabemöglichkeit noch? ","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-06-24T11:46:21Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp class=\"western\" style=\"margin-bottom: 0in;\"\u003eDie freiwillige 30 Tage-Rückgabemöglichkeit besteht weiterhin.\u003c/p\u003e\n\u003cp class=\"western\" style=\"margin-bottom: 0in;\"\u003eBeachten Sie jedoch, dass der Insolvenzverwalter Masseunzulänglichkeit angezeigt hat, so dass gegebenenfalls nicht der volle Kaufpreis erstattet werden kann. Zudem ist es möglich, dass eine Rückzahlung erst mit Abschluss des Insolvenzverfahrens erfolgen kann.\u003c/p\u003e"},{"id":360017302173,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360017302173-DNS-Firewall.json","html_url":"https://support.eblocker.com/hc/de/articles/360017302173-DNS-Firewall","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":6,"vote_sum":1,"vote_count":1,"section_id":360003201954,"created_at":"2019-02-06T09:51:30Z","updated_at":"2019-03-05T16:42:13Z","name":"DNS-Firewall","title":"DNS-Firewall","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-02-19T15:20:17Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cspan class=\"wysiwyg-color-green120\"\u003eeBlocker Base ✓ / eBlocker Pro ✓ / eBlocker Family ✓\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eDiese Seite ist weiter unterteilt in die folgenden Abschnitte:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStatus\u003c/li\u003e\n\u003cli\u003eExterne DNS-Server\u003c/li\u003e\n\u003cli\u003eLokale Gerätenamen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024850334/dns-de-00.png\" alt=\"dns-de-00.png\"\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eStatus\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eWenn Sie diese Funktion aktivieren, können Sie die DNS Anfragen über Ihren eBlocker an eine Liste von verschiedenen DNS Servern verteilen oder über des Tor-Netzwerks auflösen lassen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025771133/dns-de-01.png\" alt=\"dns-de-01.png\"\u003e\u003c/p\u003e\n\u003cp\u003eeBlocker Pro und Family Kunden profitieren außerdem nach der Aktivierung dieser Funktion von den Domain Blockern des eBlockers.\u003c/p\u003e\n\u003cp\u003eIhnen stehen dafür drei verschiedene Optionen zur Verfügung.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024850354/dns-de-02.png\" alt=\"dns-de-02.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInternet Provider\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier wird der DNS Server verwendet, welchen Sie in Ihrer Router Konfiguration hinterlegt haben.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTor-Netzwerk (DNS Auflösung erfolgt anonym)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier werden die DNS Anfragen durch das Tor-Netzwerk geleitet und am Ausgangspunkt des Tor-Netzwerkes an einen DNS Server übergeben. Vergewissern Sie sich, dass Tor verfügbar ist. Dies können Sie im Menü IP-Anonymisierung \u0026gt; Tor-Netzwerk überprüfen.\u003c/p\u003e\n\u003cp\u003eDie DNS Anfragen über das Tor-Netzwerk können unter Umständen länger benötigen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExterne DNS-Server\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMit dieser Option können Sie eine Liste von DNS Servern hinterlegen. Diese Liste kann nach Verfügbarkeit, der Reihe nach oder in zufälliger Reihenfolge vom eBlocker abgearbeitet werden. Die einzelnen DNS Server können Sie im Reiter \u003cstrong\u003eExterne\u003c/strong\u003e \u003cstrong\u003eDNS-Server\u003c/strong\u003e anlegen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDNS-Cache\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDer eBlocker verwendet einen internen Zwischenspeicher (Cache) für DNS-Anfragen. In seltenen Fällen kann das Leeren des Caches Probleme beseitigen, wenn Änderungen an den Einstellungen vorgenommen wurden.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025771153/dns-de-03.png\" alt=\"dns-de-03.png\"\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eExterne DNS-Server\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eHier können Sie eine Liste von DNS Servern externer Anbieter anlegen, denen Sie Ihr Vertrauen schenken.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360024850374/dns-de-04.png\" alt=\"dns-de-04.png\"\u003e\u003c/p\u003e\n\u003cp\u003eTragen Sie mittels des Buttons \u003cstrong\u003eHinzufügen\u003c/strong\u003e direkt die IPv4 Adresse des jeweiligen gewünschten DNS Servers ein. Zum Entfernen eines Eintrages klicken Sie auf \u003cstrong\u003eBearbeiten\u003c/strong\u003e, wählen die Zeile aus und gehen auf \u003cstrong\u003ex Einträge löschen\u003c/strong\u003e.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eLokale Gerätenamen\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eDer eBlocker DNS Server kann dazu verwendet werden, eigene aussagekräftige Einträge für das Heimnetz zu schaffen. So können Sie per Webinterface steuerbare Geräte im Heimnetzwerk selbst benennen und schneller aufrufen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025771173/dns-de-05.png\" alt=\"dns-de-05.png\"\u003e\u003c/p\u003e\n\u003cp\u003eStatt unter setup.eBlocker.com oder seiner IP-Adresse ist der eBlocker dann zum Beispiel unter eblocker.box zu erreichen.\u003c/p\u003e"},{"id":360009066253,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360009066253-Die-eBlocker-Mobile-Funktion.json","html_url":"https://support.eblocker.com/hc/de/articles/360009066253-Die-eBlocker-Mobile-Funktion","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":6,"vote_sum":3,"vote_count":7,"section_id":360000516773,"created_at":"2018-09-07T13:15:16Z","updated_at":"2019-06-22T15:57:00Z","name":"Die eBlocker Mobile Funktion","title":"Die eBlocker Mobile Funktion","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-11-23T14:42:45Z","user_segment_id":null,"permission_group_id":744634,"label_names":["mobile","openvpn","eblockeros2"],"body":"\u003cp\u003eIn dieser Anleitung zeigen wir auf, wie Sie eine Portweiterleitung in Ihrem Router einrichten und die eBlocker Mobile Funktion konfigurieren. Anschließend beschreiben wir, wie Sie die Funktion auf einem mobilen Gerät einrichten.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWichtig\u003c/strong\u003e: Bitte beachten Sie, dass die durchsichtigen eBlocker (auch bekannt als Vorversions-eBlocker) nach dem Update von eBlockerOS 1.x auf 2.x noch nicht kompatibel mit der eBlocker Mobile Funktion sind. Wir arbeiten zur Zeit an einer Lösung des Problems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAchtung:\u003c/strong\u003e Sie sollten eine IPv4 Verbindung von Ihrem Internetprovider gestellt bekommen. eBlocker Mobile funktioniert nicht mit einer IPv6 Verbindung.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAchtung\u003c/strong\u003e: Für die Nutzung von eBocker Mobile muss die eBlocker DNS-Firewall aktiviert sein.\u003c/p\u003e\n\u003cp\u003eEine Anleitung zum Thema DNS-Firewall finden Sie hier: „\u003ca href=\"https://support.eblocker.com/hc/de/articles/360004587233-eBlocker-DNS-Firewall\" target=\"_blank\" rel=\"noopener\"\u003eeBlocker DNS Firewall\u003c/a\u003e“.\u003c/p\u003e\n\u003cp\u003eLeiten Sie zunächst in Ihrem Router den Port 1194 an den eBlocker weiter.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAchtung\u003c/strong\u003e: Wenn Sie die eBlocker Mobile Funktion nutzen wollen, muss Ihr eBlocker direkt mit Ihrem Router verbunden sein.\u003c/p\u003e\n\u003cp\u003eHilfe zur Einrichtung einer Portweiterleitung finden Sie hier: „\u003ca href=\"https://support.eblocker.com/hc/de/articles/360007395294-Wie-richte-ich-eine-Portweiterleitung-am-Router-ein-\" target=\"_blank\" rel=\"noopener\"\u003eWie richte ich eine Portweiterleitung am Router ein?\u003c/a\u003e“\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTipp vom Support\u003c/strong\u003e: Vergeben Sie für Ihren eBlocker eine feste IP-Adresse.\u003c/p\u003e\n\u003cp\u003eHilfe dazu finden Sie hier: „\u003ca href=\"https://support.eblocker.com/hc/de/articles/360006746274-Kann-man-dem-eBlocker-eine-feste-IP-Adresse-zuweisen-\" target=\"_blank\" rel=\"noopener\"\u003eKann man dem eBlocker eine feste IP-Adresse zuweisen?\u003c/a\u003e“\u003c/p\u003e\n\u003cp\u003eDamit Sie sich jederzeit von unterwegs mit Ihrem eBlocker zuhause verbinden können, laden Sie bitte eine OpenVPN App auf Ihr mobiles Gerät herunter.\u003c/p\u003e\n\u003cp\u003eEine Liste von Apps finden Sie hier: „\u003ca href=\"https://support.eblocker.com/hc/de/articles/360008030973-Wo-kann-ich-eine-passende-OpenVPN-App-herunterladen-\" target=\"_blank\" rel=\"noopener\"\u003eWo kann ich eine passende OpenVPN App herunterladen?\u003c/a\u003e“\u003c/p\u003e\n\u003cp\u003eFür ein Android Smartphone, das wir in unserem Beispiel verwenden, laden Sie die App „OpenVPN Connect“ runter. Bitte stellen Sie sicher, dass sich Ihr Smartphone im WLAN befindet.\u003c/p\u003e\n\u003cp\u003eÖffnen Sie an Ihrem PC, Laptop o. a. die eBlocker Einstellungen (diese erreichen Sie über die URL eblocker.box). Klicken Sie in der Karte „Einstellungen“ auf „Einstellungen öffnen“ und wählen Sie dort den Menüpunkt „eBlocker Mobile“ aus.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAchtung\u003c/strong\u003e: Wenn Sie schon einmal eBlocker Mobile aktiviert haben, klicken Sie zuerst auf „ZURÜCKSETZEN“. Das Zurücksetzen einer aktivierten eBlocker Mobile Konfiguration kann einige Sekunden dauern.\u003c/p\u003e\n\u003cp\u003eNun klicken Sie auf „EINSTELLUNGEN ÄNDERN“.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012126313/de-01.jpg\" alt=\"de-01.jpg\"\u003e\u003c/p\u003e\n\u003cp\u003eDer eBlocker Mobile Assistent öffnet sich.\u003c/p\u003e\n\u003cp\u003eKlicken Sie auf „WEITER“.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012126293/de-02.jpg\" alt=\"de-02.jpg\"\u003e\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003eWählen Sie „Ich möchte den eBlocker Dynamic DNS Dienst zum Testen von eBlocker Mobile nutzen“ aus und klicken auf „WEITER“.\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012085754/de-03.jpg\" alt=\"de-03.jpg\"\u003e\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003eBestätigen Sie den folgenden Dialog und klicken Sie auf \"WEITER\".\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012126253/de-04.jpg\" alt=\"de-04.jpg\"\u003e\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003eDa Sie – wie zu Beginn dieser Anleitung beschrieben – den Port 1194 in den Router-Einstellungen bereits dem eBlocker zugewiesen haben, wählen Sie „Ich werde die Ports selber zuweisen“ aus und klicken auf „WEITER“.\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012085694/de-05.jpg\" alt=\"de-05.jpg\"\u003e\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003eBestätigen Sie im folgenden Dialog, dass Sie in Ihrem Router den Port 1194 dem eBlocker zugewiesen haben und klicken anschließend auf „EINSTELLUNGEN ÜBERNEHMEN“.\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012126493/de-06.jpg\" alt=\"de-06.jpg\"\u003e\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003eIn dem folgenden Dialog führen Sie sicherheitshalber einen Verbindungstest durch.\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012085714/de-07.jpg\" alt=\"de-07.jpg\"\u003e\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003eNach dem erfolgreichen Test klicken Sie auf „SERVER STARTEN“.\u003c/p\u003e\n\u003cp style=\"margin-bottom: 0in; line-height: 100%;\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012126273/de-08.jpg\" alt=\"de-08.jpg\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAchtung\u003c/strong\u003e: Es kann bis zu 60 Sekunden dauern, ehe der Server gestartet wird.\u003c/p\u003e\n\u003cp\u003eKlicken Sie anschließend auf „SCHLIESSEN“.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012085734/de-09.jpg\" alt=\"de-09.jpg\"\u003e\u003c/p\u003e\n\u003cp\u003eIn den eBlocker Einstellungen sehen Sie nun, dass eBlocker Mobile aktiviert ist.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012126613/de-10.jpg\" alt=\"de-10.jpg\"\u003e\u003c/p\u003e\n\u003cp\u003eRufen Sie auf Ihrem mobilen Gerät im Browser setup.eblocker.com oder eblocker.box auf.\u003c/p\u003e\n\u003cp\u003eKlicken Sie oben rechts auf das Dashboard Icon und überprüfen, ob die eBlocker Mobile Karte angezeigt wird. Wenn dies nicht der Fall ist, klicken Sie bitte auf „eBlocker Mobile“ in der Liste.\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012086174/de-11.png\" alt=\"de-11.png\"\u003e\u003c/p\u003e\n\u003cp\u003eScrollen Sie im Dashboard nun bis zur eBLocker Mobile karte. Der eBlocker erkennt Ihr mobiles Gerät und schlägt daher „Android“ in der Liste vor. Sollte dies nicht der Fall sein, treffen Sie die Auswahl bitte selbst.\u003c/p\u003e\n\u003cp\u003eKlicken Sie auf „KONFIGURATION HERUNTERLADEN“, um die eBlocker OpenVPN Konfiguration auf dem Smartphone zu speichern.\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012126753/de-12.png\" alt=\"de-12.png\"\u003e\u003c/p\u003e\n\u003cp\u003eÖffnen Sie nun die OpenVPN App auf dem Smartphone und wählen in der App „OVPN Profile“ aus.\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012126813/de-13.png\" alt=\"de-13.png\"\u003e   \u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012126833/de-14.png\" alt=\"de-14.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWählen Sie die heruntergeladene eBlocker OpenVPN Konfiguration aus und klicken auf „IMPORT“.\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012086114/de-15.png\" alt=\"de-15.png\"\u003e\u003c/p\u003e\n\u003cp\u003eDie OpenVPN Konfiguration des eBlockers wird nun importiert und kann mit „ADD“ zu den Profilen hinzugefügt werden.\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012086134/de-17.png\" alt=\"de-17.png\"\u003e\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-left\"\u003eJetzt aktivieren Sie die Verbindung in der OpenVPN App.\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012126633/de-19.png\" alt=\"de-19.png\"\u003e\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-left\"\u003eAuf dem Smartphone wird die VPN Verbindung mit einem Schlüssel dargestellt (die Anzeige kann je nach Betriebssystem variieren).\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012086154/de-20.png\" alt=\"de-20.png\"\u003e\u003c/p\u003e\n\u003cp\u003eBitte deaktivieren Sie nun die WLAN-Verbindung auf dem Smartphone.\u003c/p\u003e\n\u003cp\u003eIn einem Browser des Smartphones geben Sie die Adresse setup.eBlocker.com oder eblocker.box ein. Dass Sie nun den vollen Schutz des eBlockers auch mobil genießen, erkennen Sie an dem angezeigten eBlocker Dashboard. Herzlichen Glückwunsch!\u003c/p\u003e\n\u003cp class=\"wysiwyg-text-align-center\"\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360012085674/de-21.png\" alt=\"de-21.png\"\u003e\u003c/p\u003e\n\u003cp\u003eSollten Sie Probleme bei der Einrichtung haben, lesen Sie bitte folgende Tipps: „\u003ca href=\"https://support.eblocker.com/hc/de/articles/360002345453-Fehlerbehebung\" target=\"_blank\" rel=\"noopener\"\u003eFehlerbehebung\u003c/a\u003e“.\u003c/p\u003e"},{"id":360004553994,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360004553994-Sehr-langsame-Netzwerkverbindung.json","html_url":"https://support.eblocker.com/hc/de/articles/360004553994-Sehr-langsame-Netzwerkverbindung","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":6,"vote_sum":0,"vote_count":6,"section_id":360000516793,"created_at":"2018-05-20T17:25:54Z","updated_at":"2019-04-24T19:02:45Z","name":"Sehr langsame Netzwerkverbindung","title":"Sehr langsame Netzwerkverbindung","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-03-24T11:20:26Z","user_segment_id":null,"permission_group_id":744634,"label_names":["network","slow","langsame","langsames","Netzwerk","Netzwerkverbindung"],"body":"\u003cp\u003eWenn Sie eine sehr langsame Netzwerkverbindung bemerken, überprüfen Sie, ob Ihr Gerät über das Tor-Netzwerk ins Internet geht. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Dashboard\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDas eBlocker Dashboard können Sie wie folgt aufrufen:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eÖffnen Sie im Browser die Seite setup.eblocker.com\u003c/li\u003e\n\u003cli\u003eOder öffnen Sie im Browser die Seite eblocker.box\u003c/li\u003e\n\u003cli\u003eOder öffnen Sie im Browser die IP-Adresse Ihres eBlockers und geben dahinter „/dashboard“ ein (Beispiel: 192.168.10.210/dashboard)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAuf dem eBlocker Dashboard finden Sie eine Karte mit dem Namen \"Anonymisierung\". Sollte eine Verbindung zum Tor-Netzwerk bestehen, können Sie dort die Verbindung trennen. Überprüfen Sie, ob Sie nun wieder gewohnt, schnell im Internet unterwegs sind.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eeBlocker Controlbar\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie eBlocker Controlbar können Sie wie folgt aufrufen:\u003c/p\u003e\n\u003cp\u003eÖffnen Sie die eBlocker Controlbar auf der Seite \u003ca href=\"http://setup.eblocker.com\" target=\"_blank\" rel=\"noopener\"\u003ehttp://setup.eblocker.com\u003c/a\u003e, mit einem Klick auf das eBlocker Symbol. Sollte eine Verbindung zu Tor-Netzwerk, oder zu einem VPN-Server, aufgebaut sein, sollte das Schild über dem Punkt \"IP-Anon\" mit einem Karomuster ausgefüllt sein. Deaktivieren Sie die Tor- Netzwerk oder VPN-Server Verbindung und überprüfen Sie, ob Sie nun wieder gewohnt, schnell im Internet unterwegs sind.\u003c/p\u003e\n\u003cp\u003eDas Tor-Netzwerk ist ein nicht-kommerzieller Zusammenschluss von Menschen auf der ganzen Welt, die kostenlos Netzwerk-Infrastruktur bereitstellen, damit Nutzer Ihre IP-Adresse beim Surfen im Internet anonymisieren können. Das Tor-Netzwerk garantiert jedoch keine Verfügbarkeit oder Mindestbandbreite.\u003c/p\u003e\n\u003cp\u003eWenn Sie dennoch eine sehr langsame Netzwerkverbindung bemerken, überprüfen Sie mit einem anderen Gerät, ob dieses Problem bei Ihnen im gesamten Netzwerk besteht. Wenn dem so ist, kann es sein, dass Ihr Router nicht mit dem automatischen Netzwerkeinstellungen des eBlockers zusammenarbeitet. In diesem Fall können Sie den eBlocker in seine individuellen Einstellungen umstellen, so dass der eBlocker den DHCP-Server in Ihrem Netzwerk übernimmt. Bei Ihrem Router können Sie den DHCP-Server dann deaktivieren.\u003c/p\u003e\n\u003cp\u003eWie man den eBlocker in wenigen Schritten umstellt, können Sie hier in dem Artikel „\u003ca href=\"https://support.eblocker.com/hc/de/articles/360004553694\" target=\"_blank\" rel=\"noopener\"\u003eIndividuelle Netzwerkeinstellung\u003c/a\u003e“ nachlesen.\u003c/p\u003e"},{"id":360004397834,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360004397834-Funktioniert-der-eBlocker-mit-jedem-Internet-Anschluss-.json","html_url":"https://support.eblocker.com/hc/de/articles/360004397834-Funktioniert-der-eBlocker-mit-jedem-Internet-Anschluss-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":6,"vote_sum":4,"vote_count":4,"section_id":360000956174,"created_at":"2018-05-17T08:29:53Z","updated_at":"2019-04-16T19:49:18Z","name":"Funktioniert der eBlocker mit jedem Internet-Anschluss?","title":"Funktioniert der eBlocker mit jedem Internet-Anschluss?","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-05-17T08:30:32Z","user_segment_id":null,"permission_group_id":744634,"label_names":["work with any Internet","Internet","Internet-Anschluss","Anschluss"],"body":"\u003cp\u003eJa. Der eBlocker funktioniert unabhängig vom Internet-Anbieter und mit jedem Internet-Anschluss weltweit. Wir empfehlen eine Breitbandverbindung mit mind. 1Mbit, die „always-on“ mit dem Internet verbunden ist.\u003c/p\u003e"},{"id":360002345513,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002345513-Einen-Client-sperren.json","html_url":"https://support.eblocker.com/hc/de/articles/360002345513-Einen-Client-sperren","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":6,"vote_sum":1,"vote_count":1,"section_id":360000522814,"created_at":"2018-03-25T04:33:23Z","updated_at":"2018-09-02T06:08:56Z","name":"Einen Client sperren","title":"Einen Client sperren","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-08-29T10:45:42Z","user_segment_id":null,"permission_group_id":744634,"label_names":["mobile","lock","client","gerät","sperren"],"body":"\u003cp\u003eSie können in den eBlocker Einstellungen \u0026gt; Menü \"Geräte\" für jedes Gerät den eBlocker Mobile Remote Zugriff deaktivieren. Wenn Sie den eBlocker Mobile Remote Zugriff für ein Gerät wieder aktivieren wollen, dann müssen Sie auch die eBlocker Mobile Konfigurationsdatei auf dem entsprechenden Gerät wieder herunterladen und in der OpenVPN App hinterlegen.\u003c/p\u003e"},{"id":360002342674,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002342674-Das-eBlocker-Zertifikat-in-Thunderbird-hinterlegen-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002342674-Das-eBlocker-Zertifikat-in-Thunderbird-hinterlegen-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":6,"vote_sum":2,"vote_count":2,"section_id":360000522774,"created_at":"2018-03-24T21:53:17Z","updated_at":"2019-03-16T03:57:31Z","name":"Das eBlocker Zertifikat in Thunderbird hinterlegen.","title":"Das eBlocker Zertifikat in Thunderbird hinterlegen.","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-02-06T17:54:18Z","user_segment_id":null,"permission_group_id":744634,"label_names":["ssl","https","certificate","zertifikat","tunderbird"],"body":"\u003cp\u003eMit nur wenigen Schritten haben Sie das Zertifikat hinterlegt.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKlicken Sie auf der HTTPS Konfigurationsseite auf den Reiter \u003cstrong\u003eZERTIFIKAT\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003eNun klicken Sie auf den Button \u003cstrong\u003eHERUNTERLADEN\u003c/strong\u003e. Gegebenenfalls kann man das Zertifikat auch mit einem Rechtsklick auf den Button und dann \u003cstrong\u003eSpeichern unter\u003c/strong\u003e herunterladen.\u003c/li\u003e\n\u003cli\u003eRufen Sie in Thunderbird das Menü \u003cstrong\u003eEinstellungen\u003c/strong\u003e auf.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360002682873/tunderb-de01.png\" alt=\"tunderb-de01.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWählen Sie \u003cstrong\u003eErweitert\u003c/strong\u003e aus und im Reiter \u003cstrong\u003eZertifikate\u003c/strong\u003e klicken Sie bitte auf \u003cstrong\u003eZertifikate verwalten\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360020774173/neu-de-01.png\" alt=\"neu-de-01.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEs öffnet sich die Zertifikatverwaltung. Dort klicken Sie bitte im Reiter \u003cstrong\u003eZertifizierungsstellen\u003c/strong\u003e auf \u003cstrong\u003eImportieren\u003c/strong\u003e und wählen anschließend das eBlocker-Zertifikat aus dem Download-Verzeichnis aus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360019864554/neu-de-02.png\" alt=\"neu-de-02.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLaden Sie das eBlocker-Zertifikat mit \u003cstrong\u003eÖffnen\u003c/strong\u003e und stellen Sie sicher, dass im folgenden Dialog die erste Checkbox \u003cstrong\u003e\"Dieser CA vertrauen, um Websites zu identifizieren\"\u003c/strong\u003e ausgewählt ist und bestätigen Sie mit \u003cstrong\u003eOK\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360020774153/neu-de-03.png\" alt=\"neu-de-03.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKlicken Sie nun im Zertifikat-Manager auf \u003cstrong\u003eOK\u003c/strong\u003e und bestätigen die Einstellungen ebenfalls mit \u003cstrong\u003eOK\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDas Zertifikat ist nun im Thunderbird E-Mail-Programm hinterlegt.\u003c/p\u003e"},{"id":360002342574,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002342574-WLAN-Access-Points-und-der-eBlocker.json","html_url":"https://support.eblocker.com/hc/de/articles/360002342574-WLAN-Access-Points-und-der-eBlocker","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":6,"vote_sum":-1,"vote_count":1,"section_id":360000515213,"created_at":"2018-03-24T21:42:02Z","updated_at":"2018-09-21T15:03:02Z","name":"WLAN Access-Points und der eBlocker","title":"WLAN Access-Points und der eBlocker","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-03-24T21:42:17Z","user_segment_id":null,"permission_group_id":744634,"label_names":["wlan","wifi","access","point","points"],"body":"\u003cp\u003eEin WLAN Access-Point wird verwendet, um die Signalstärke und -reichweite in Privathaushalten und kleinen Büros zu verbessern. Geräte die sich über den WLAN Access-Point anmelden, werden von dem WLAN Access-Point an den Router weiter gereicht. Der WLAN Access-Point sorgt in der Regel dafür, dass die Kombination von IP Adresse und MAC Adresse pro Gerät erhalten bleiben, so dass der eBlocker alle Geräte einzeln identifizieren und schützen kann.\u003c/p\u003e"},{"id":360002341413,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360002341413-Die-Netzwerkeinbindung-pr%C3%BCfen-mit-Windows-.json","html_url":"https://support.eblocker.com/hc/de/articles/360002341413-Die-Netzwerkeinbindung-pr%C3%BCfen-mit-Windows-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":6,"vote_sum":0,"vote_count":6,"section_id":360000522734,"created_at":"2018-03-24T15:30:43Z","updated_at":"2019-01-20T15:01:56Z","name":"Die Netzwerkeinbindung prüfen mit Windows.","title":"Die Netzwerkeinbindung prüfen mit Windows.","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2018-04-03T08:24:17Z","user_segment_id":null,"permission_group_id":744634,"label_names":["connection","verbindung","windows","netzwerk","network","cmd"],"body":"\u003cdiv class=\"rollbar-content\" style=\"position: relative; top: 0px; left: 0px; height: auto; overflow: hidden;\"\u003e\n\u003cdiv class=\"modalBlock bottom-nav\"\u003e\n\u003cp\u003eSie können mit den Bordmitteln von Windows ganz leicht erkennen, ob der eBlocker richtig eingebunden ist.\u003c/p\u003e\n\u003cp\u003eWenn Sie die IP-Adresse Ihres eBlockers nicht kennen, sehen Sie bitte in den Netzwerkeinstellungen / Heimnetzübersicht Ihres Routers nach. Dort sollte der eBlocker und die dazugehörige IP-Adresse zu sehen sein.\u003c/p\u003e\n\u003cp\u003eÖffnen Sie bitte das Kommandozeilen Programm (CMD.exe). Geben Sie nun den Befehl „tracert www.eblocker.com“ ein und warten Sie kurz, bis die Anfrage beendet ist. Der Befehl „tracert“ zeigt Ihnen den Weg durch das Internet auf, welchen Sie bis zum Zielserver zurück legen. Wichtig ist die erste IP Adresse. Diese sollte die IP Adresse Ihres eBlockers sein.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e"},{"id":360024341253,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360024341253-Gilt-die-gesetzliche-Widerrufsfrist-von-14-Tagen-noch-.json","html_url":"https://support.eblocker.com/hc/de/articles/360024341253-Gilt-die-gesetzliche-Widerrufsfrist-von-14-Tagen-noch-","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":7,"vote_sum":0,"vote_count":0,"section_id":360004512333,"created_at":"2019-06-05T08:50:22Z","updated_at":"2019-06-24T11:45:36Z","name":"Gilt die gesetzliche Widerrufsfrist von 14 Tagen noch?","title":"Gilt die gesetzliche Widerrufsfrist von 14 Tagen noch?","source_locale":"de","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-06-24T11:45:36Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp class=\"western\" style=\"margin-bottom: 0in;\"\u003eDie gesetzliche Widerrufsfrist gilt weiterhin.\u003c/p\u003e\n\u003cp class=\"western\" style=\"margin-bottom: 0in;\"\u003eBeachten Sie jedoch, dass der Insolvenzverwalter Masseunzulänglichkeit angezeigt hat, so dass gegebenenfalls nicht der volle Kaufpreis erstattet werden kann. Zudem ist es möglich, dass eine Rückzahlung erst mit Abschluss des Insolvenzverfahrens erfolgen kann.\u003c/p\u003e"},{"id":360020260414,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360020260414-Der-Router-startet-spontan-neu.json","html_url":"https://support.eblocker.com/hc/de/articles/360020260414-Der-Router-startet-spontan-neu","author_id":116161470334,"comments_disabled":false,"draft":false,"promoted":false,"position":7,"vote_sum":0,"vote_count":0,"section_id":360000516793,"created_at":"2019-03-24T17:59:06Z","updated_at":"2019-03-24T18:00:52Z","name":"Der Router startet spontan neu","title":"Der Router startet spontan neu","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-03-24T17:59:43Z","user_segment_id":null,"permission_group_id":744634,"label_names":["router","gerät","devices","suchen","geräte","restart","discovery","neustart"],"body":"\u003cp\u003eIn sehr seltenen Fällen kann es vorkommen, dass der Router nach einigen Stunden neu startet, wenn Sie den eBlocker am Router angeschlossen haben.\u003c/p\u003e\n\u003cp\u003eUns ist dieses Verhalten zur Zeit nur von der Fritzbox 6490 Cable bekannt.\u003c/p\u003e\n\u003cp\u003eDer Grund dafür ist, dass der eBlocker alle 10 Sekunden nach neuen Geräten im Netzwerk sucht. Mit der Umstellung auf eine 5 minütigen Suche nach neuen Geräte lässt sich diese Problem beheben.\u003c/p\u003e\n\u003cp\u003eGehen Sie dazu bitte in die eBlocker Einstellungen \u0026gt; Menü \"Geräte\". Oben sehen Sie einen Reiter \"Geräte suchen\". Klicken Sie bitte auf den Reiter und stellen dort die Suche nach neuen Geräten auf 5 Minuten um.\u003c/p\u003e"},{"id":360017142194,"url":"https://eblocker.zendesk.com/api/v2/help_center/de/articles/360017142194-HTTPS.json","html_url":"https://support.eblocker.com/hc/de/articles/360017142194-HTTPS","author_id":116161470334,"comments_disabled":true,"draft":false,"promoted":false,"position":7,"vote_sum":1,"vote_count":1,"section_id":360003201954,"created_at":"2019-02-06T09:46:14Z","updated_at":"2019-06-05T07:33:59Z","name":"HTTPS","title":"HTTPS","source_locale":"en-us","locale":"de","outdated":false,"outdated_locales":[],"edited_at":"2019-06-05T07:32:59Z","user_segment_id":null,"permission_group_id":744634,"label_names":[],"body":"\u003cp\u003e\u003cspan class=\"wysiwyg-color-red120\"\u003eeBlocker Base ✕\u003c/span\u003e\u003cspan class=\"wysiwyg-color-green120\"\u003e / eBlocker Pro ✓ / eBlocker Family ✓\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eDiese Seite ist weiter unterteilt in die folgenden Abschnitte:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStatus\u003c/li\u003e\n\u003cli\u003eZertifikat\u003c/li\u003e\n\u003cli\u003eHTTPS Verbindungsfehler\u003c/li\u003e\n\u003cli\u003eVertrauenswürdige Apps\u003c/li\u003e\n\u003cli\u003eVertrauenswürdige Websites\u003c/li\u003e\n\u003cli\u003eManuelle Diagnose\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192394/DE-HTTPS-01.png\" alt=\"DE-HTTPS-01.png\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan class=\"wysiwyg-underline wysiwyg-color-red120\"\u003e\u003cstrong\u003eWichtig:\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eWenn Sie diese Funktion aktivieren, müssen Sie mit erweiterten Einstellungen Ihrer Geräte vertraut sein und ein Verschlüsselungs-Zertifikat auf den Geräten hinterlegen, um den Datenstrom durch den eBlocker analysieren zu lassen.\u003c/p\u003e\n\u003cp\u003e\u003cspan class=\"wysiwyg-underline\"\u003e\u003cstrong\u003eVorwort:\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eSSL steht für Secure Sockets Layer und ist ein Protokoll, um die Kommunikation „Ende-zu-Ende“ zwischen zwei Kommunikationspartnern zu verschlüsseln. Manchmal wird Ihnen vielleicht auch die Abkürzung TLS begegnen (TLS steht für Transport Layer Security). Sie bezeichnet im Grunde das gleiche wie SSL. Wird das Standard-Webprotokoll HTTP mit Hilfe von SSL verschlüsselt, so wird es als HTTPS bezeichnet. Sie erkennen eine verschlüsselt geladene Seite daran, dass die URL mit https:// beginnt. Viele Browser zeigen in der Adresszeile zusätzlich ein grünes Schloss an.\u003c/p\u003e\n\u003cp\u003eViele Webseiten, insbesondere von Banken und Online-Shops sind heute mit SSL-Verschlüsselung geschützt. Dadurch können Sie sicher sein, dass Sie tatsächlich mit dem Anbieter kommunizieren dessen URL Sie aufgerufen haben und dass kein Dritter Ihre eingegebenen Daten verändern oder mitlesen kann. Allerdings verwenden nicht nur seriöse Shops und Banken SSL. Auch Tracking- und Werbeanbieter sammeln ihre Daten immer öfter über HTTPS/SSL. Ihre Profildaten werden dann zwar verschlüsselt zum Trackingserver geschickt, aber das hindert den Datensammler natürlich nicht daran, weiterhin ein detailliertes Profil von Ihnen zu erstellen.\u003c/p\u003e\n\u003cp\u003eSobald die HTTPS-Unterstützung im eBlocker aktiviert wird, generiert jeder eBlocker ein eindeutiges Geräte-Stammzertifikat und einen privaten Schlüssel. Dieses Zertifikat wird genutzt, um die Kommunikation zwischen Ihrem Gerät und dem eBlocker zu verschlüsseln, wenn der eBlocker eine mit SSL geschützte Webseite lädt.\u003c/p\u003e\n\u003cp\u003eSobald HTTPS aktiviert wurde, terminiert der eBlocker die verschlüsselte Verbindung, damit der Datenstrom analysiert werden kann. Der eBlocker ist damit das Ende der „Ende-zu-Ende Verschlüsselung“. Da der Browser bei HTTPS eine verschlüsselte Verbindung erwartet, verschlüsselt der eBlocker anschließend die Kommunikation zu Ihrem Endgerät. Dazu ist es notwendig einmalig das sogenannte Sicherheitszertifikat Ihres eBlockers erst in Ihrem Betriebssystem und dann gegebenenfalls in den Browsern mit einem eigenen Zertifikatsspeicher aufzunehmen. Dieses Zertifikat wird manchmal auch als Zertifikat für Zertifizierungsstellen, als Stammzertifikat oder als Root-Zertifikat bezeichnet.\u003c/p\u003e\n\u003cp\u003eWir haben weder Zugang zu Ihrem privaten Schlüssel noch zu Ihrem Gerät und haben alles dafür getan, um den eBlocker vor Hackern zu schützen – aber natürlich gibt es keine 100 prozentige Sicherheit.\u003c/p\u003e\n\u003cp\u003eWir bieten die HTTPS-Unterstützung als Option an. Sollten Sie sich unwohl damit fühlen, dass der eBlocker die HTTPS-Verbindung entschlüsselt, aktivieren Sie diese Option bitte nicht.\u003c/p\u003e\n\u003cp\u003eOhne die HTTPS-Unterstützung schützt Sie der eBlocker durch seine Domain Blocker.\u003cbr\u003e\u003ca href=\"https://support.eblocker.com/hc/de/articles/360008681633\" target=\"_blank\" rel=\"noopener\"\u003eLesen Sie hier gegebenenfalls den Unterschied zwischen Pattern (Muster) und Domain Blocker.\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eStatus\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eAktivieren Sie hier die HTTPS Funktion für Ihren eBlocker, indem Sie den \u003cstrong\u003eSchalter\u003c/strong\u003e nach rechts schieben.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360026112113/DE-HTTPS-02.png\" alt=\"DE-HTTPS-02.png\"\u003e\u003c/p\u003e\n\u003cp\u003eBitte beachten Sie, dass das Zertifikat erst in Ihrem Betriebssystem und dann gegebenenfalls noch in Browsern mit eigenem Zertifikatsspeicher hinterlegt werden muss.\u003c/p\u003e\n\u003cp\u003eWenn Sie auf den Button \u003cstrong\u003eHTTPS Assistent\u003c/strong\u003e klicken, wird Sie ein Assistent bei dem Hinterlegen des eBlocker Zertifikats begleiten. Der Link Anleitungen führt Sie zu einem Beitrag, in dem wir Ihnen für die wichtigsten Betriebssysteme das Hinterlegen des eBlocker Zertifikats Schritt für Schritt beschrieben.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eZertifikat\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eVon hier aus können Sie auch das eBlocker Zertifikat mit Hilfe des HTTPS Assistenten hinterlegen. Der Link Anleitungen führt Sie ebenfalls zu einem Beitrag, in dem wir Ihnen für die wichtigsten Betriebssysteme das Hinterlegen des eBlocker Zertifikats Schritt für Schritt beschrieben.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192374/DE-HTTPS-03.png\" alt=\"DE-HTTPS-03.png\"\u003e\u003c/p\u003e\n\u003cp\u003eHier können Sie einige Informationen zu Ihrem Zertifikat einsehen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192354/DE-HTTPS-04.png\" alt=\"DE-HTTPS-04.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWenn Sie auf den Button \u003cstrong\u003eHerunterladen\u003c/strong\u003e klicken, können Sie das eBlocker Zertifikat auch auf Ihren Rechner speichern. Das kann notwendig sein, wenn Sie zum Beispiel eine App mit einem eigenen Zertifikatsspeicher benutzten (Beispiel: Der Mailclient Thunderbird).\u003c/p\u003e\n\u003cp\u003eDas eBlocker Zertifikat wird vier Wochen vor dem Ablauf automatisch erneuert.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192334/DE-HTTPS-05.png\" alt=\"DE-HTTPS-05.png\"\u003e\u003c/p\u003e\n\u003cp\u003eNach der Erneuerung muss das neue Zertifikat wieder auf allen Geräten aufgenommen werden!\u003cbr\u003eSie können das eBlocker Zertifikat auch jeder Zeit manuell erneuern, wenn Sie auf den Button\u003cstrong\u003e Jetzt erneuern\u003c/strong\u003e klicken.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eHTTPS Verbindungsfehler\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eHier können Sie den Datenstrom einzelner Anwendungen mit einem einfachen Werkzeug untersuchen und gegebenenfalls Ausnahmen erstellen, sofern eine App bzw. eine Webseite bei aktivierter HTTPS-Unterstützung nicht korrekt arbeitet.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192314/DE-HTTPS-06.png\" alt=\"DE-HTTPS-06.png\"\u003e\u003c/p\u003e\n\u003cp\u003eDie aufgezeichneten HTTPS Verbindungsfehler helfen Ihnen dabei festzustellen, welche Apps betroffen sind, bzw. welche Domains-/IP-Adressen als Ausnahmen für die jeweilige App definiert werden sollten.\u003c/p\u003e\n\u003cp\u003eDer eBlocker kann Domains erkennen, welche einer schon vorhandenen vertrauenswürdigen App Ausnahme hinzugefügt werden kann. In der Aufzeichnung wir Ihnen auch angezeigt von welchem Gerät und zu welcher Zeit der Verbindungsfehler aufgezeichnet wurde.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360026112093/DE-HTTPS-07.png\" alt=\"DE-HTTPS-07.png\"\u003e\u003c/p\u003e\n\u003cp\u003eMit einem Klick auf den Button \u003cstrong\u003eBearbeiten\u003c/strong\u003e können Sie die Domain dieser App Ausnahme hinzufügen. Anschließen klicken Sie auf den Button \u003cstrong\u003eApp vertrauen\u003c/strong\u003e, um Ihre Auswahl zu speichern.\u003c/p\u003e\n\u003cp\u003eIn der Liste der \u003cstrong\u003eVorgeschlagene Ausnahmen\u003c/strong\u003e zeigt der eBlocker Verbindungsfehler an, welche keiner vorhandenen App Ausnahme zugeordnet werden konnten.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192294/DE-HTTPS-08.png\" alt=\"DE-HTTPS-08.png\"\u003e\u003c/p\u003e\n\u003cp\u003eMit einem Klick auf den Button \u003cstrong\u003eBearbeiten\u003c/strong\u003e können Sie die Domain auswählen, welche Sie speichern möchten.\u003c/p\u003e\n\u003cp\u003eEs stehen Ihnen drei Optionen zum Speichern zur Verfügung:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNeue App anlegen\u003c/li\u003e\n\u003cli\u003eZur App hinzufügen\u003c/li\u003e\n\u003cli\u003eZur Ausnahmeliste hinzufügen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNeue App anlegen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMit dieser Option legen Sie eine neue App Ausnahme an.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192274/DE-HTTPS-09.png\" alt=\"DE-HTTPS-09.png\"\u003e\u003c/p\u003e\n\u003cp\u003eVergeben Sie einen Namen für die App Ausnahme und geben Sie gegebenenfalls eine kurze Beschreibung ein.\u003c/p\u003e\n\u003cp\u003eDie Ausgewählten Domains werden Ihnen hier noch einmal angezeigt.\u003c/p\u003e\n\u003cp\u003eMit einem Klick auf den Button \u003cstrong\u003eSpeichern\u003c/strong\u003e hinterlegen Sie Ihre neue App Ausnahme. Diese finden Sie nun in der Übersicht Vertrauenswürdige Apps. Neu angelegte App Ausnahmen werden nach dem Anlegen automatisch aktiviert.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eZur App hinzufügen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier können Sie die ausgewählten Domains einer schon vorhandenen App Ausnahme hinzufügen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192254/DE-HTTPS-10.png\" alt=\"DE-HTTPS-10.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWählen Sie eine schon vorhandene Apps Ausnahme aus und überprüfen Sie noch einmal die Domains. Wenn Sie nun auf den Button \u003cstrong\u003eSpeichern\u003c/strong\u003e klicken, werden die hier angegebenen Domains automatisch der schon vorhandenen App Ausnahme hinzugefügt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eZur Ausnahmeliste hinzufügen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHier können Sie die gefunden Domains der Liste der vertrauenswürdigen Websites Hinzufügen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360026112073/DE-HTTPS-11.png\" alt=\"DE-HTTPS-11.png\"\u003e\u003c/p\u003e\n\u003cp\u003eVergebenem Sie hier einen Namen und überprüfen Sie noch einmal die Domains. Wenn Sie nun auf den Button \u003cstrong\u003eSpeichern\u003c/strong\u003e klicken, werden die hier angegebenen Domains automatisch Liste der vertrauenswürdigen Websites hinzugefügt.\u003c/p\u003e\n\u003cp\u003eGanz unten auf der Seite finden Sie hier den Button \u003cstrong\u003eAlle Aufzeichnungen löschen\u003c/strong\u003e. Wenn Sie diesen Button anklicken, werden alle Aufzeichnungen gelöscht.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eVertrauenswürdige Apps\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eHier sehen Sie eine Liste der schon vordefinierten vertrauenswürdigen Apps.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360037088134/23-01de-trustedapps.png\" alt=\"23-01de-trustedapps.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWenn Sie ein Problem mit einer App haben sollten, dann suchen Sie hier einmal nach den Namen der App. Vielleicht gibt es schon eine vordefinierte Ausnahme für diese App. Wenn ja, dann aktivieren Sie die Ausnahme indem Sie auf die Ausnahme klicken und mit dem Schalter die Ausnahme aktivieren.\u003c/p\u003e\n\u003cp\u003eIn der Liste sehen Sie den Namen der App, eine kurze Beschreibung, ein Auszug der erlaubten Domains/Ips und den Status der App. Der Status unterscheidet zwischen Vordefinierte App und Benutzerdefinierten App.\u003c/p\u003e\n\u003cp\u003eSie können in der Übersicht der vertrauenswürdigen Apps alle Ausnahmen einfach aktivieren, oder deaktivieren, indem Sie den Schalter vor der Ausnahme umstellen.\u003c/p\u003e\n\u003cp\u003eBitte beachten Sie, dass aktivierte Ausnahmelisten bedeuten, dass die entsprechenden Apps und Websites nicht durch den eBlocker geschützt werden und Ihre Daten an Dritte weiter gegeben werden könnten.\u003c/p\u003e\n\u003cp\u003eUm eine neue App Ausnahme hinzuzufügen klicken Sie auf den Button \u003cstrong\u003eApp Hinzufügen\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192234/DE-HTTPS-13.png\" alt=\"DE-HTTPS-13.png\"\u003e\u003c/p\u003e\n\u003cp\u003eVergeben Sie einen Namen und gegebenenfalls eine Beschreibung für die App.\u003c/p\u003e\n\u003cp\u003eNun können Sie pro Zeile eine Domain / IP für diese Ausnahmen eingeben.\u003c/p\u003e\n\u003cp\u003eWenn Sie auf den Button \u003cstrong\u003eSpeichern\u003c/strong\u003e klicken wird diese Ausnahme in die Liste der Ausnahmen aufgenommen und automatisch für Sie aktiviert.\u003c/p\u003e\n\u003cp\u003eKlicken Sie auf den Button \u003cstrong\u003eBearbeiten\u003c/strong\u003e, um eine App Ausnahme aus der Liste zu löschen. Wählen Sie im Anschluss die betroffene App Ausnahme aus und klicken dann auf den Button\u003cstrong\u003e App Löschen\u003c/strong\u003e oder zurücksetzten.\u003c/p\u003e\n\u003cp\u003eNur vordefinierte App Ausnahmen können, sofern Sie diesen weitere Domains hinzugefügt haben, zurückgesetzt werden.\u003c/p\u003e\n\u003cp\u003eKlicken Sie in der Liste der App Ausnahmen eine App Ausnahme an, um diese zu bearbeiten.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192214/DE-HTTPS-14.png\" alt=\"DE-HTTPS-14.png\"\u003e\u003c/p\u003e\n\u003cp\u003eHier können Sie den Namen und die Beschreibung der App bearbeiten, in dem Sie auf den \u003cstrong\u003eStift\u003c/strong\u003e klicken.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360026112033/DE-HTTPS-15.png\" alt=\"DE-HTTPS-15.png\"\u003e\u003c/p\u003e\n\u003cp\u003eMit diesem \u003cstrong\u003eSchalter\u003c/strong\u003e aktivieren Sie die Ausnahmeliste. Der eBlocker wird dann die Kommunikation zu den angegebenen Domains / IPs nicht mehr kontrollieren.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360026112013/DE-HTTPS-16.png\" alt=\"DE-HTTPS-16.png\"\u003e\u003c/p\u003e\n\u003cp\u003eKlicken Sie auf den Button \u003cstrong\u003eNeu\u003c/strong\u003e, um eine Domain / IP zu dieser Liste hinzuzufügen.\u003c/p\u003e\n\u003cp\u003eKlicken Sie auf den Button \u003cstrong\u003eBearbeiten\u003c/strong\u003e, um eine Domain aus der Liste zu löschen. Wählen Sie im Anschluss die betroffene Domain aus und klicken dann auf den Button \u003cstrong\u003eDomain/IP löschen\u003c/strong\u003e.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eVertrauenswürdige Websites\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eHier sehen Sie eine Liste der vertrauenswürdigen Websites.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360026111993/DE-HTTPS-17.png\" alt=\"DE-HTTPS-17.png\"\u003e\u003c/p\u003e\n\u003cp\u003eIn dieser Liste sehen Sie als alle Domains, welche in den vertrauenswürdigen Apps Ausnahmen eingetragen wurden.\u003c/p\u003e\n\u003cp\u003eDie Liste besteht aus den Namen, der Domain/IP, gegebenenfalls den Namen der App Ausnahme, und dem Status Benutzerdefinierte Domain/IP oder Von eBlocker festgelegte Domain.\u003c/p\u003e\n\u003cp\u003eFalls einzelne Webseiten mit dem eBlocker nicht kompatibel sind, können Sie diese Webseiten vom Schutz durch den eBlocker ausnehmen, in dem Sie auf den Button \u003cstrong\u003eNeue Websites\u003c/strong\u003e klicken.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192174/DE-HTTPS-18.png\" alt=\"DE-HTTPS-18.png\"\u003e\u003c/p\u003e\n\u003cp\u003eVergeben Sie einen Namen für die Ausnahme und geben Sie die Domains oder IPs ein. Nach dem Sie auf den Button \u003cstrong\u003eSpeichern\u003c/strong\u003e geklickt haben wird diese Ausnahme in der Liste der Web Ausnahmen hinzugefügt.\u003c/p\u003e\n\u003cp\u003eKlicken Sie auf den Button \u003cstrong\u003eBearbeiten\u003c/strong\u003e, um eine Web Ausnahme aus der Liste zu löschen. Wählen Sie im Anschluss die betroffene Web Ausnahme aus und klicken dann auf den Button \u003cstrong\u003eWebsite Löschen\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eWichtig: Nur Benutzerdefinierte Domain/IP Ausnahmen können hier gelöscht werden.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eManuelle Diagnose\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eMit der manuellen HTTPS-Diagnose ist es möglich noch weitere - zusätzlich zu den unter \"HTTPS-Verbindungsfehler\" gefundenen Fehlern - aufzuzeichnen und in die Liste der vertrauenswürdigen Apps aufzunehmen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://support.eblocker.com/hc/article_attachments/360025192194/DE-HTTPS-19.png\" alt=\"DE-HTTPS-19.png\"\u003e\u003c/p\u003e\n\u003cp\u003eWählen Sie mittels der Listenschaltflächen das Gerät aus Ihrem Netzwerk bei dem die Fehler auftreten, die maximale Zeitdauer der Aufzeichnung und die maximale Größe des Protokolls. Standard: 5 Minuten, 100 MB.\u003c/p\u003e\n\u003cp\u003eNun verwenden Sie auf dem ausgewählten Gerät die App bei deren Nutzung Fehler auftreten. Nach automatischem oder manuellem Stopp der Aufzeichnung erstellt der eBlocker für Sie eine Liste der aufgerufenen Domainnamen und der verbundenen IP Adressen, des verwendeten Protokolls und der eBlocker Regeln. In der letzten Spalte können Sie der vom eBlocker ausgegebenen empfohlenen Regel zustimmen oder widersprechen.\u003c/p\u003e\n\u003cp\u003eDie Tabellenzeilen der analysierten Verbindungen können durch Anklicken für jede aufgerufene Domain einzeln angepasst werden.\u003c/p\u003e\n\u003cp\u003eDie aufgezeichneten Apps können Sie testen und einer neuen App Definition für die Liste der vertrauenswürdigen Apps hinzufügen.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://support.eblocker.com/hc/de/articles/360004553714\" target=\"_blank\" rel=\"noopener\"\u003eHier finden Sie ein praktisches Beispiel...\u003c/a\u003e\u003c/p\u003e"}],"sort_by":"position","sort_order":"asc"}